{
	"File": {
		"__typename": "FileMatch",
		"repository": {
			"name": "github.com/stackql/stackql-provider-registry"
		},
		"file": {
			"name": "composer.yaml",
			"size": 0,
			"path": "providers/src/googleapis.com/v1.0.4/services/composer.yaml",
			"byteSize": 62409,
			"content": "components:\n  parameters:\n    _.xgafv:\n      description: V1 error format.\n      in: query\n      name: _.xgafv\n      schema:\n        enum:\n          - '1'\n          - '2'\n        type: string\n    access_token:\n      description: OAuth access token.\n      in: query\n      name: access_token\n      schema:\n        type: string\n    alt:\n      description: Data format for response.\n      in: query\n      name: alt\n      schema:\n        enum:\n          - json\n          - media\n          - proto\n        type: string\n    callback:\n      description: JSONP\n      in: query\n      name: callback\n      schema:\n        type: string\n    fields:\n      description: Selector specifying which fields to include in a partial response.\n      in: query\n      name: fields\n      schema:\n        type: string\n    key:\n      description: API key. Your API key identifies your project and provides you with API access, quota, and reports. Required unless you provide an OAuth 2.0 token.\n      in: query\n      name: key\n      schema:\n        type: string\n    oauth_token:\n      description: OAuth 2.0 token for the current user.\n      in: query\n      name: oauth_token\n      schema:\n        type: string\n    prettyPrint:\n      description: Returns response with indentations and line breaks.\n      in: query\n      name: prettyPrint\n      schema:\n        type: boolean\n    quotaUser:\n      description: Available to use for quota purposes for server-side applications. Can be any arbitrary string assigned to a user, but should not exceed 40 characters.\n      in: query\n      name: quotaUser\n      schema:\n        type: string\n    uploadType:\n      description: Legacy upload protocol for media (e.g. \"media\", \"multipart\").\n      in: query\n      name: uploadType\n      schema:\n        type: string\n    upload_protocol:\n      description: Upload protocol for media (e.g. \"raw\", \"multipart\").\n      in: query\n      name: upload_protocol\n      schema:\n        type: string\n  schemas:\n    AllowedIpRange:\n      description: Allowed IP range with user-provided description.\n      id: AllowedIpRange\n      properties:\n        description:\n          description: Optional. User-provided description. It must contain at most 300 characters.\n          type: string\n        value:\n          description: 'IP address or range, defined using CIDR notation, of requests that this rule applies to. Examples: `192.168.1.1` or `192.168.0.0/16` or `2001:db8::/32` or `2001:0db8:0000:0042:0000:8a2e:0370:7334`. IP range prefixes should be properly truncated. For example, `1.2.3.4/24` should be truncated to `1.2.3.0/24`. Similarly, for IPv6, `2001:db8::1/32` should be truncated to `2001:db8::/32`.'\n          type: string\n      type: object\n    CheckUpgradeResponse:\n      description: Message containing information about the result of an upgrade check operation.\n      id: CheckUpgradeResponse\n      properties:\n        buildLogUri:\n          description: Output only. Url for a docker build log of an upgraded image.\n          readOnly: true\n          type: string\n        containsPypiModulesConflict:\n          description: Output only. Whether build has succeeded or failed on modules conflicts.\n          enum:\n            - CONFLICT_RESULT_UNSPECIFIED\n            - CONFLICT\n            - NO_CONFLICT\n          enumDescriptions:\n            - It is unknown whether build had conflicts or not.\n            - There were python packages conflicts.\n            - There were no python packages conflicts.\n          readOnly: true\n          type: string\n        imageVersion:\n          description: Composer image for which the build was happening.\n          type: string\n        pypiConflictBuildLogExtract:\n          description: Output only. Extract from a docker image build log containing information about pypi modules conflicts.\n          readOnly: true\n          type: string\n        pypiDependencies:\n          additionalProperties:\n            type: string\n          description: Pypi dependencies specified in the environment configuration, at the time when the build was triggered.\n          type: object\n      type: object\n    CidrBlock:\n      description: CIDR block with an optional name.\n      id: CidrBlock\n      properties:\n        cidrBlock:\n          description: CIDR block that must be specified in CIDR notation.\n          type: string\n        displayName:\n          description: User-defined name that identifies the CIDR block.\n          type: string\n      type: object\n    DatabaseConfig:\n      description: The configuration of Cloud SQL instance that is used by the Apache Airflow software.\n      id: DatabaseConfig\n      properties:\n        machineType:\n          description: 'Optional. Cloud SQL machine type used by Airflow database. It has to be one of: db-n1-standard-2, db-n1-standard-4, db-n1-standard-8 or db-n1-standard-16. If not specified, db-n1-standard-2 will be used. Supported for Cloud Composer environments in versions composer-1.*.*-airflow-*.*.*.'\n          type: string\n      type: object\n    Date:\n      description: 'Represents a whole or partial calendar date, such as a birthday. The time of day and time zone are either specified elsewhere or are insignificant. The date is relative to the Gregorian Calendar. This can represent one of the following: * A full date, with non-zero year, month, and day values. * A month and day, with a zero year (for example, an anniversary). * A year on its own, with a zero month and a zero day. * A year and month, with a zero day (for example, a credit card expiration date). Related types: * google.type.TimeOfDay * google.type.DateTime * google.protobuf.Timestamp'\n      id: Date\n      properties:\n        day:\n          description: Day of a month. Must be from 1 to 31 and valid for the year and month, or 0 to specify a year by itself or a year and month where the day isn't significant.\n          format: int32\n          type: integer\n        month:\n          description: Month of a year. Must be from 1 to 12, or 0 to specify a year without a month and day.\n          format: int32\n          type: integer\n        year:\n          description: Year of the date. Must be from 1 to 9999, or 0 to specify a date without a year.\n          format: int32\n          type: integer\n      type: object\n    Empty:\n      description: 'A generic empty message that you can re-use to avoid defining duplicated empty messages in your APIs. A typical example is to use it as the request or the response type of an API method. For instance: service Foo { rpc Bar(google.protobuf.Empty) returns (google.protobuf.Empty); }'\n      id: Empty\n      properties: {}\n      type: object\n    EncryptionConfig:\n      description: The encryption options for the Cloud Composer environment and its dependencies.Supported for Cloud Composer environments in versions composer-1.*.*-airflow-*.*.*.\n      id: EncryptionConfig\n      properties:\n        kmsKeyName:\n          description: Optional. Customer-managed Encryption Key available through Google's Key Management Service. Cannot be updated. If not specified, Google-managed key will be used.\n          type: string\n      type: object\n    Environment:\n      description: An environment for running orchestration tasks.\n      id: Environment\n      properties:\n        config:\n          $ref: '#/components/schemas/EnvironmentConfig'\n          description: Configuration parameters for this environment.\n        createTime:\n          description: Output only. The time at which this environment was created.\n          format: google-datetime\n          type: string\n        labels:\n          additionalProperties:\n            type: string\n          description: 'Optional. User-defined labels for this environment. The labels map can contain no more than 64 entries. Entries of the labels map are UTF8 strings that comply with the following restrictions: * Keys must conform to regexp: \\p{Ll}\\p{Lo}{0,62} * Values must conform to regexp: [\\p{Ll}\\p{Lo}\\p{N}_-]{0,63} * Both keys and values are additionally constrained to be \u003c= 128 bytes in size.'\n          type: object\n        name:\n          description: 'The resource name of the environment, in the form: \"projects/{projectId}/locations/{locationId}/environments/{environmentId}\" EnvironmentId must start with a lowercase letter followed by up to 63 lowercase letters, numbers, or hyphens, and cannot end with a hyphen.'\n          type: string\n        state:\n          description: The current state of the environment.\n          enum:\n            - STATE_UNSPECIFIED\n            - CREATING\n            - RUNNING\n            - UPDATING\n            - DELETING\n            - ERROR\n          enumDescriptions:\n            - The state of the environment is unknown.\n            - The environment is in the process of being created.\n            - The environment is currently running and healthy. It is ready for use.\n            - The environment is being updated. It remains usable but cannot receive additional update requests or be deleted at this time.\n            - The environment is undergoing deletion. It cannot be used.\n            - The environment has encountered an error and cannot be used.\n          type: string\n        updateTime:\n          description: Output only. The time at which this environment was last modified.\n          format: google-datetime\n          type: string\n        uuid:\n          description: Output only. The UUID (Universally Unique IDentifier) associated with this environment. This value is generated when the environment is created.\n          type: string\n      type: object\n    EnvironmentConfig:\n      description: Configuration information for an environment.\n      id: EnvironmentConfig\n      properties:\n        airflowUri:\n          description: Output only. The URI of the Apache Airflow Web UI hosted within this environment (see [Airflow web interface](/composer/docs/how-to/accessing/airflow-web-interface)).\n          type: string\n        dagGcsPrefix:\n          description: Output only. The Cloud Storage prefix of the DAGs for this environment. Although Cloud Storage objects reside in a flat namespace, a hierarchical file tree can be simulated using \"/\"-delimited object name prefixes. DAG objects for this environment reside in a simulated directory with the given prefix.\n          type: string\n        databaseConfig:\n          $ref: '#/components/schemas/DatabaseConfig'\n          description: Optional. The configuration settings for Cloud SQL instance used internally by Apache Airflow software.\n        encryptionConfig:\n          $ref: '#/components/schemas/EncryptionConfig'\n          description: Optional. The encryption options for the Cloud Composer environment and its dependencies. Cannot be updated.\n        environmentSize:\n          description: Optional. The size of the Cloud Composer environment. This field is supported for Cloud Composer environments in versions composer-2.*.*-airflow-*.*.* and newer.\n          enum:\n            - ENVIRONMENT_SIZE_UNSPECIFIED\n            - ENVIRONMENT_SIZE_SMALL\n            - ENVIRONMENT_SIZE_MEDIUM\n            - ENVIRONMENT_SIZE_LARGE\n          enumDescriptions:\n            - The size of the environment is unspecified.\n            - The environment size is small.\n            - The environment size is medium.\n            - The environment size is large.\n          type: string\n        gkeCluster:\n          description: Output only. The Kubernetes Engine cluster used to run this environment.\n          type: string\n        maintenanceWindow:\n          $ref: '#/components/schemas/MaintenanceWindow'\n          description: Optional. The maintenance window is the period when Cloud Composer components may undergo maintenance. It is defined so that maintenance is not executed during peak hours or critical time periods. The system will not be under maintenance for every occurrence of this window, but when maintenance is planned, it will be scheduled during the window. The maintenance window period must encompass at least 12 hours per week. This may be split into multiple chunks, each with a size of at least 4 hours. If this value is omitted, the default value for maintenance window will be applied. The default value is Saturday and Sunday 00-06 GMT.\n        masterAuthorizedNetworksConfig:\n          $ref: '#/components/schemas/MasterAuthorizedNetworksConfig'\n          description: 'Optional. The configuration options for GKE cluster master authorized networks. By default master authorized networks feature is: - in case of private environment: enabled with no external networks allowlisted. - in case of public environment: disabled.'\n        nodeConfig:\n          $ref: '#/components/schemas/NodeConfig'\n          description: The configuration used for the Kubernetes Engine cluster.\n        nodeCount:\n          description: The number of nodes in the Kubernetes Engine cluster that will be used to run this environment. This field is supported for Cloud Composer environments in versions composer-1.*.*-airflow-*.*.*.\n          format: int32\n          type: integer\n        privateEnvironmentConfig:\n          $ref: '#/components/schemas/PrivateEnvironmentConfig'\n          description: The configuration used for the Private IP Cloud Composer environment.\n        softwareConfig:\n          $ref: '#/components/schemas/SoftwareConfig'\n          description: The configuration settings for software inside the environment.\n        webServerConfig:\n          $ref: '#/components/schemas/WebServerConfig'\n          description: Optional. The configuration settings for the Airflow web server App Engine instance.\n        webServerNetworkAccessControl:\n          $ref: '#/components/schemas/WebServerNetworkAccessControl'\n          description: Optional. The network-level access control policy for the Airflow web server. If unspecified, no network-level access restrictions will be applied.\n        workloadsConfig:\n          $ref: '#/components/schemas/WorkloadsConfig'\n          description: Optional. The workloads configuration settings for the GKE cluster associated with the Cloud Composer environment. The GKE cluster runs Airflow scheduler, web server and workers workloads. This field is supported for Cloud Composer environments in versions composer-2.*.*-airflow-*.*.* and newer.\n      type: object\n    IPAllocationPolicy:\n      description: Configuration for controlling how IPs are allocated in the GKE cluster running the Apache Airflow software.\n      id: IPAllocationPolicy\n      properties:\n        clusterIpv4CidrBlock:\n          description: Optional. The IP address range used to allocate IP addresses to pods in the GKE cluster. For Cloud Composer environments in versions composer-1.*.*-airflow-*.*.*, this field is applicable only when `use_ip_aliases` is true. Set to blank to have GKE choose a range with the default size. Set to /netmask (e.g. `/14`) to have GKE choose a range with a specific netmask. Set to a [CIDR](https://en.wikipedia.org/wiki/Classless_Inter-Domain_Routing) notation (e.g. `10.96.0.0/14`) from the RFC-1918 private networks (e.g. `10.0.0.0/8`, `172.16.0.0/12`, `192.168.0.0/16`) to pick a specific range to use.\n          type: string\n        clusterSecondaryRangeName:\n          description: Optional. The name of the GKE cluster's secondary range used to allocate IP addresses to pods. For Cloud Composer environments in versions composer-1.*.*-airflow-*.*.*, this field is applicable only when `use_ip_aliases` is true.\n          type: string\n        servicesIpv4CidrBlock:\n          description: Optional. The IP address range of the services IP addresses in this GKE cluster. For Cloud Composer environments in versions composer-1.*.*-airflow-*.*.*, this field is applicable only when `use_ip_aliases` is true. Set to blank to have GKE choose a range with the default size. Set to /netmask (e.g. `/14`) to have GKE choose a range with a specific netmask. Set to a [CIDR](https://en.wikipedia.org/wiki/Classless_Inter-Domain_Routing) notation (e.g. `10.96.0.0/14`) from the RFC-1918 private networks (e.g. `10.0.0.0/8`, `172.16.0.0/12`, `192.168.0.0/16`) to pick a specific range to use.\n          type: string\n        servicesSecondaryRangeName:\n          description: Optional. The name of the services' secondary range used to allocate IP addresses to the GKE cluster. For Cloud Composer environments in versions composer-1.*.*-airflow-*.*.*, this field is applicable only when `use_ip_aliases` is true.\n          type: string\n        useIpAliases:\n          description: Optional. Whether or not to enable Alias IPs in the GKE cluster. If `true`, a VPC-native cluster is created. This field is only supported for Cloud Composer environments in versions composer-1.*.*-airflow-*.*.*. Environments in newer versions always use VPC-native GKE clusters.\n          type: boolean\n      type: object\n    ImageVersion:\n      description: ImageVersion information\n      id: ImageVersion\n      properties:\n        creationDisabled:\n          description: Whether it is impossible to create an environment with the image version.\n          type: boolean\n        imageVersionId:\n          description: 'The string identifier of the ImageVersion, in the form: \"composer-x.y.z-airflow-a.b.c\"'\n          type: string\n        isDefault:\n          description: Whether this is the default ImageVersion used by Composer during environment creation if no input ImageVersion is specified.\n          type: boolean\n        releaseDate:\n          $ref: '#/components/schemas/Date'\n          description: The date of the version release.\n        supportedPythonVersions:\n          description: supported python versions\n          items:\n            type: string\n          type: array\n        upgradeDisabled:\n          description: Whether it is impossible to upgrade an environment running with the image version.\n          type: boolean\n      type: object\n    ListEnvironmentsResponse:\n      description: The environments in a project and location.\n      id: ListEnvironmentsResponse\n      properties:\n        environments:\n          description: The list of environments returned by a ListEnvironmentsRequest.\n          items:\n            $ref: '#/components/schemas/Environment'\n          type: array\n        nextPageToken:\n          description: The page token used to query for the next page if one exists.\n          type: string\n      type: object\n    ListImageVersionsResponse:\n      description: The ImageVersions in a project and location.\n      id: ListImageVersionsResponse\n      properties:\n        imageVersions:\n          description: The list of supported ImageVersions in a location.\n          items:\n            $ref: '#/components/schemas/ImageVersion'\n          type: array\n        nextPageToken:\n          description: The page token used to query for the next page if one exists.\n          type: string\n      type: object\n    ListOperationsResponse:\n      description: The response message for Operations.ListOperations.\n      id: ListOperationsResponse\n      properties:\n        nextPageToken:\n          description: The standard List next-page token.\n          type: string\n        operations:\n          description: A list of operations that matches the specified filter in the request.\n          items:\n            $ref: '#/components/schemas/Operation'\n          type: array\n      type: object\n    MaintenanceWindow:\n      description: 'The configuration settings for Cloud Composer maintenance window. The following example: ``` { \"startTime\":\"2019-08-01T01:00:00Z\" \"endTime\":\"2019-08-01T07:00:00Z\" \"recurrence\":\"FREQ=WEEKLY;BYDAY=TU,WE\" } ``` would define a maintenance window between 01 and 07 hours UTC during each Tuesday and Wednesday.'\n      id: MaintenanceWindow\n      properties:\n        endTime:\n          description: Required. Maintenance window end time. It is used only to calculate the duration of the maintenance window. The value for end-time must be in the future, relative to `start_time`.\n          format: google-datetime\n          type: string\n        recurrence:\n          description: 'Required. Maintenance window recurrence. Format is a subset of [RFC-5545](https://tools.ietf.org/html/rfc5545) `RRULE`. The only allowed values for `FREQ` field are `FREQ=DAILY` and `FREQ=WEEKLY;BYDAY=...` Example values: `FREQ=WEEKLY;BYDAY=TU,WE`, `FREQ=DAILY`.'\n          type: string\n        startTime:\n          description: Required. Start time of the first recurrence of the maintenance window.\n          format: google-datetime\n          type: string\n      type: object\n    MasterAuthorizedNetworksConfig:\n      description: Configuration options for the master authorized networks feature. Enabled master authorized networks will disallow all external traffic to access Kubernetes master through HTTPS except traffic from the given CIDR blocks, Google Compute Engine Public IPs and Google Prod IPs.\n      id: MasterAuthorizedNetworksConfig\n      properties:\n        cidrBlocks:\n          description: Up to 50 external networks that could access Kubernetes master through HTTPS.\n          items:\n            $ref: '#/components/schemas/CidrBlock'\n          type: array\n        enabled:\n          description: Whether or not master authorized networks feature is enabled.\n          type: boolean\n      type: object\n    NodeConfig:\n      description: The configuration information for the Kubernetes Engine nodes running the Apache Airflow software.\n      id: NodeConfig\n      properties:\n        diskSizeGb:\n          description: Optional. The disk size in GB used for node VMs. Minimum size is 30GB. If unspecified, defaults to 100GB. Cannot be updated. This field is supported for Cloud Composer environments in versions composer-1.*.*-airflow-*.*.*.\n          format: int32\n          type: integer\n        enableIpMasqAgent:\n          description: 'Optional. Deploys ''ip-masq-agent'' daemon set in the GKE cluster and defines nonMasqueradeCIDRs equals to pod IP range so IP masquerading is used for all destination addresses, except between pods traffic. See: https://cloud.google.com/kubernetes-engine/docs/how-to/ip-masquerade-agent'\n          type: boolean\n        ipAllocationPolicy:\n          $ref: '#/components/schemas/IPAllocationPolicy'\n          description: Optional. The configuration for controlling how IPs are allocated in the GKE cluster.\n        location:\n          description: 'Optional. The Compute Engine [zone](/compute/docs/regions-zones) in which to deploy the VMs used to run the Apache Airflow software, specified as a [relative resource name](/apis/design/resource_names#relative_resource_name). For example: \"projects/{projectId}/zones/{zoneId}\". This `location` must belong to the enclosing environment''s project and location. If both this field and `nodeConfig.machineType` are specified, `nodeConfig.machineType` must belong to this `location`; if both are unspecified, the service will pick a zone in the Compute Engine region corresponding to the Cloud Composer location, and propagate that choice to both fields. If only one field (`location` or `nodeConfig.machineType`) is specified, the location information from the specified field will be propagated to the unspecified field. This field is supported for Cloud Composer environments in versions composer-1.*.*-airflow-*.*.*.'\n          type: string\n        machineType:\n          description: 'Optional. The Compute Engine [machine type](/compute/docs/machine-types) used for cluster instances, specified as a [relative resource name](/apis/design/resource_names#relative_resource_name). For example: \"projects/{projectId}/zones/{zoneId}/machineTypes/{machineTypeId}\". The `machineType` must belong to the enclosing environment''s project and location. If both this field and `nodeConfig.location` are specified, this `machineType` must belong to the `nodeConfig.location`; if both are unspecified, the service will pick a zone in the Compute Engine region corresponding to the Cloud Composer location, and propagate that choice to both fields. If exactly one of this field and `nodeConfig.location` is specified, the location information from the specified field will be propagated to the unspecified field. The `machineTypeId` must not be a [shared-core machine type](/compute/docs/machine-types#sharedcore). If this field is unspecified, the `machineTypeId` defaults to \"n1-standard-1\". This field is supported for Cloud Composer environments in versions composer-1.*.*-airflow-*.*.*.'\n          type: string\n        network:\n          description: 'Optional. The Compute Engine network to be used for machine communications, specified as a [relative resource name](/apis/design/resource_names#relative_resource_name). For example: \"projects/{projectId}/global/networks/{networkId}\". If unspecified, the \"default\" network ID in the environment''s project is used. If a [Custom Subnet Network](/vpc/docs/vpc#vpc_networks_and_subnets) is provided, `nodeConfig.subnetwork` must also be provided. For [Shared VPC](/vpc/docs/shared-vpc) subnetwork requirements, see `nodeConfig.subnetwork`.'\n          type: string\n        oauthScopes:\n          description: Optional. The set of Google API scopes to be made available on all node VMs. If `oauth_scopes` is empty, defaults to [\"https://www.googleapis.com/auth/cloud-platform\"]. Cannot be updated. This field is supported for Cloud Composer environments in versions composer-1.*.*-airflow-*.*.*.\n          items:\n            type: string\n          type: array\n        serviceAccount:\n          description: Optional. The Google Cloud Platform Service Account to be used by the node VMs. If a service account is not specified, the \"default\" Compute Engine service account is used. Cannot be updated.\n          type: string\n        subnetwork:\n          description: 'Optional. The Compute Engine subnetwork to be used for machine communications, specified as a [relative resource name](/apis/design/resource_names#relative_resource_name). For example: \"projects/{projectId}/regions/{regionId}/subnetworks/{subnetworkId}\" If a subnetwork is provided, `nodeConfig.network` must also be provided, and the subnetwork must belong to the enclosing environment''s project and location.'\n          type: string\n        tags:\n          description: Optional. The list of instance tags applied to all node VMs. Tags are used to identify valid sources or targets for network firewalls. Each tag within the list must comply with [RFC1035](https://www.ietf.org/rfc/rfc1035.txt). Cannot be updated. This field is supported for Cloud Composer environments in versions composer-1.*.*-airflow-*.*.*.\n          items:\n            type: string\n          type: array\n      type: object\n    Operation:\n      description: This resource represents a long-running operation that is the result of a network API call.\n      id: Operation\n      properties:\n        done:\n          description: If the value is `false`, it means the operation is still in progress. If `true`, the operation is completed, and either `error` or `response` is available.\n          type: boolean\n        error:\n          $ref: '#/components/schemas/Status'\n          description: The error result of the operation in case of failure or cancellation.\n        metadata:\n          additionalProperties:\n            description: Properties of the object. Contains field @type with type URL.\n            type: any\n          description: Service-specific metadata associated with the operation. It typically contains progress information and common metadata such as create time. Some services might not provide such metadata. Any method that returns a long-running operation should document the metadata type, if any.\n          type: object\n        name:\n          description: The server-assigned name, which is only unique within the same service that originally returns it. If you use the default HTTP mapping, the `name` should be a resource name ending with `operations/{unique_id}`.\n          type: string\n        response:\n          additionalProperties:\n            description: Properties of the object. Contains field @type with type URL.\n            type: any\n          description: The normal response of the operation in case of success. If the original method returns no data on success, such as `Delete`, the response is `google.protobuf.Empty`. If the original method is standard `Get`/`Create`/`Update`, the response should be the resource. For other methods, the response should have the type `XxxResponse`, where `Xxx` is the original method name. For example, if the original method name is `TakeSnapshot()`, the inferred response type is `TakeSnapshotResponse`.\n          type: object\n      type: object\n    OperationMetadata:\n      description: Metadata describing an operation.\n      id: OperationMetadata\n      properties:\n        createTime:\n          description: Output only. The time the operation was submitted to the server.\n          format: google-datetime\n          type: string\n        endTime:\n          description: Output only. The time when the operation terminated, regardless of its success. This field is unset if the operation is still ongoing.\n          format: google-datetime\n          type: string\n        operationType:\n          description: Output only. The type of operation being performed.\n          enum:\n            - TYPE_UNSPECIFIED\n            - CREATE\n            - DELETE\n            - UPDATE\n            - CHECK\n            - SAVE_SNAPSHOT\n            - LOAD_SNAPSHOT\n          enumDescriptions:\n            - Unused.\n            - A resource creation operation.\n            - A resource deletion operation.\n            - A resource update operation.\n            - A resource check operation.\n            - Saves snapshot of the resource operation.\n            - Loads snapshot of the resource operation.\n          type: string\n        resource:\n          description: Output only. The resource being operated on, as a [relative resource name]( /apis/design/resource_names#relative_resource_name).\n          type: string\n        resourceUuid:\n          description: Output only. The UUID of the resource being operated on.\n          type: string\n        state:\n          description: Output only. The current operation state.\n          enum:\n            - STATE_UNSPECIFIED\n            - PENDING\n            - RUNNING\n            - SUCCEEDED\n            - SUCCESSFUL\n            - FAILED\n          enumDescriptions:\n            - Unused.\n            - The operation has been created but is not yet started.\n            - The operation is underway.\n            - The operation completed successfully.\n            - ''\n            - The operation is no longer running but did not succeed.\n          type: string\n      type: object\n    PrivateClusterConfig:\n      description: Configuration options for the private GKE cluster in a Cloud Composer environment.\n      id: PrivateClusterConfig\n      properties:\n        enablePrivateEndpoint:\n          description: Optional. If `true`, access to the public endpoint of the GKE cluster is denied.\n          type: boolean\n        masterIpv4CidrBlock:\n          description: Optional. The CIDR block from which IPv4 range for GKE master will be reserved. If left blank, the default value of '172.16.0.0/23' is used.\n          type: string\n        masterIpv4ReservedRange:\n          description: Output only. The IP range in CIDR notation to use for the hosted master network. This range is used for assigning internal IP addresses to the GKE cluster master or set of masters and to the internal load balancer virtual IP. This range must not overlap with any other ranges in use within the cluster's network.\n          readOnly: true\n          type: string\n      type: object\n    PrivateEnvironmentConfig:\n      description: The configuration information for configuring a Private IP Cloud Composer environment.\n      id: PrivateEnvironmentConfig\n      properties:\n        cloudComposerConnectionSubnetwork:\n          description: Optional. When specified, the environment will use Private Service Connect instead of VPC peerings to connect to Cloud SQL in the Tenant Project, and the PSC endpoint in the Customer Project will use an IP address from this subnetwork.\n          type: string\n        cloudComposerNetworkIpv4CidrBlock:\n          description: Optional. The CIDR block from which IP range for Cloud Composer Network in tenant project will be reserved. Needs to be disjoint from private_cluster_config.master_ipv4_cidr_block and cloud_sql_ipv4_cidr_block. This field is supported for Cloud Composer environments in versions composer-2.*.*-airflow-*.*.* and newer.\n          type: string\n        cloudComposerNetworkIpv4ReservedRange:\n          description: Output only. The IP range reserved for the tenant project's Cloud Composer network. This field is supported for Cloud Composer environments in versions composer-2.*.*-airflow-*.*.* and newer.\n          readOnly: true\n          type: string\n        cloudSqlIpv4CidrBlock:\n          description: Optional. The CIDR block from which IP range in tenant project will be reserved for Cloud SQL. Needs to be disjoint from `web_server_ipv4_cidr_block`.\n          type: string\n        enablePrivateEnvironment:\n          description: Optional. If `true`, a Private IP Cloud Composer environment is created. If this field is set to true, `IPAllocationPolicy.use_ip_aliases` must be set to true for Cloud Composer environments in versions composer-1.*.*-airflow-*.*.*.\n          type: boolean\n        enablePrivatelyUsedPublicIps:\n          description: Optional. When enabled, IPs from public (non-RFC1918) ranges can be used for `IPAllocationPolicy.cluster_ipv4_cidr_block` and `IPAllocationPolicy.service_ipv4_cidr_block`.\n          type: boolean\n        privateClusterConfig:\n          $ref: '#/components/schemas/PrivateClusterConfig'\n          description: Optional. Configuration for the private GKE cluster for a Private IP Cloud Composer environment.\n        webServerIpv4CidrBlock:\n          description: Optional. The CIDR block from which IP range for web server will be reserved. Needs to be disjoint from `private_cluster_config.master_ipv4_cidr_block` and `cloud_sql_ipv4_cidr_block`. This field is supported for Cloud Composer environments in versions composer-1.*.*-airflow-*.*.*.\n          type: string\n        webServerIpv4ReservedRange:\n          description: Output only. The IP range reserved for the tenant project's App Engine VMs. This field is supported for Cloud Composer environments in versions composer-1.*.*-airflow-*.*.*.\n          readOnly: true\n          type: string\n      type: object\n    SchedulerResource:\n      description: Configuration for resources used by Airflow schedulers.\n      id: SchedulerResource\n      properties:\n        count:\n          description: Optional. The number of schedulers.\n          format: int32\n          type: integer\n        cpu:\n          description: Optional. CPU request and limit for a single Airflow scheduler replica.\n          format: float\n          type: number\n        memoryGb:\n          description: Optional. Memory (GB) request and limit for a single Airflow scheduler replica.\n          format: float\n          type: number\n        storageGb:\n          description: Optional. Storage (GB) request and limit for a single Airflow scheduler replica.\n          format: float\n          type: number\n      type: object\n    SoftwareConfig:\n      description: Specifies the selection and configuration of software inside the environment.\n      id: SoftwareConfig\n      properties:\n        airflowConfigOverrides:\n          additionalProperties:\n            type: string\n          description: Optional. Apache Airflow configuration properties to override. Property keys contain the section and property names, separated by a hyphen, for example \"core-dags_are_paused_at_creation\". Section names must not contain hyphens (\"-\"), opening square brackets (\"[\"), or closing square brackets (\"]\"). The property name must not be empty and must not contain an equals sign (\"=\") or semicolon (\";\"). Section and property names must not contain a period (\".\"). Apache Airflow configuration property names must be written in [snake_case](https://en.wikipedia.org/wiki/Snake_case). Property values can contain any character, and can be written in any lower/upper case format. Certain Apache Airflow configuration property values are [blocked](/composer/docs/concepts/airflow-configurations), and cannot be overridden.\n          type: object\n        envVariables:\n          additionalProperties:\n            type: string\n          description: 'Optional. Additional environment variables to provide to the Apache Airflow scheduler, worker, and webserver processes. Environment variable names must match the regular expression `a-zA-Z_*`. They cannot specify Apache Airflow software configuration overrides (they cannot match the regular expression `AIRFLOW__[A-Z0-9_]+__[A-Z0-9_]+`), and they cannot match any of the following reserved names: * `AIRFLOW_HOME` * `C_FORCE_ROOT` * `CONTAINER_NAME` * `DAGS_FOLDER` * `GCP_PROJECT` * `GCS_BUCKET` * `GKE_CLUSTER_NAME` * `SQL_DATABASE` * `SQL_INSTANCE` * `SQL_PASSWORD` * `SQL_PROJECT` * `SQL_REGION` * `SQL_USER`'\n          type: object\n        imageVersion:\n          description: The version of the software running in the environment. This encapsulates both the version of Cloud Composer functionality and the version of Apache Airflow. It must match the regular expression `composer-([0-9]+(\\.[0-9]+\\.[0-9]+(-preview\\.[0-9]+)?)?|latest)-airflow-([0-9]+(\\.[0-9]+(\\.[0-9]+)?)?)`. When used as input, the server also checks if the provided version is supported and denies the request for an unsupported version. The Cloud Composer portion of the image version is a full [semantic version](https://semver.org), or an alias in the form of major version number or `latest`. When an alias is provided, the server replaces it with the current Cloud Composer version that satisfies the alias. The Apache Airflow portion of the image version is a full semantic version that points to one of the supported Apache Airflow versions, or an alias in the form of only major or major.minor versions specified. When an alias is provided, the server replaces it with the latest Apache Airflow version that satisfies the alias and is supported in the given Cloud Composer version. In all cases, the resolved image version is stored in the same field. See also [version list](/composer/docs/concepts/versioning/composer-versions) and [versioning overview](/composer/docs/concepts/versioning/composer-versioning-overview).\n          type: string\n        pypiPackages:\n          additionalProperties:\n            type: string\n          description: Optional. Custom Python Package Index (PyPI) packages to be installed in the environment. Keys refer to the lowercase package name such as \"numpy\" and values are the lowercase extras and version specifier such as \"==1.12.0\", \"[devel,gcp_api]\", or \"[devel]\u003e=1.8.2, \u003c1.9.2\". To specify a package without pinning it to a version specifier, use the empty string as the value.\n          type: object\n        pythonVersion:\n          description: Optional. The major version of Python used to run the Apache Airflow scheduler, worker, and webserver processes. Can be set to '2' or '3'. If not specified, the default is '3'. Cannot be updated. This field is only supported for Cloud Composer environments in versions composer-1.*.*-airflow-*.*.*. Environments in newer versions always use Python major version 3.\n          type: string\n        schedulerCount:\n          description: Optional. The number of schedulers for Airflow. This field is supported for Cloud Composer environments in versions composer-1.*.*-airflow-2.*.*.\n          format: int32\n          type: integer\n      type: object\n    Status:\n      description: 'The `Status` type defines a logical error model that is suitable for different programming environments, including REST APIs and RPC APIs. It is used by [gRPC](https://github.com/grpc). Each `Status` message contains three pieces of data: error code, error message, and error details. You can find out more about this error model and how to work with it in the [API Design Guide](https://cloud.google.com/apis/design/errors).'\n      id: Status\n      properties:\n        code:\n          description: The status code, which should be an enum value of google.rpc.Code.\n          format: int32\n          type: integer\n        details:\n          description: A list of messages that carry the error details. There is a common set of message types for APIs to use.\n          items:\n            additionalProperties:\n              description: Properties of the object. Contains field @type with type URL.\n              type: any\n            type: object\n          type: array\n        message:\n          description: A developer-facing error message, which should be in English. Any user-facing error message should be localized and sent in the google.rpc.Status.details field, or localized by the client.\n          type: string\n      type: object\n    WebServerConfig:\n      description: The configuration settings for the Airflow web server App Engine instance. Supported for Cloud Composer environments in versions composer-1.*.*-airflow-*.*.*\n      id: WebServerConfig\n      properties:\n        machineType:\n          description: 'Optional. Machine type on which Airflow web server is running. It has to be one of: composer-n1-webserver-2, composer-n1-webserver-4 or composer-n1-webserver-8. If not specified, composer-n1-webserver-2 will be used. Value custom is returned only in response, if Airflow web server parameters were manually changed to a non-standard values.'\n          type: string\n      type: object\n    WebServerNetworkAccessControl:\n      description: Network-level access control policy for the Airflow web server.\n      id: WebServerNetworkAccessControl\n      properties:\n        allowedIpRanges:\n          description: A collection of allowed IP ranges with descriptions.\n          items:\n            $ref: '#/components/schemas/AllowedIpRange'\n          type: array\n      type: object\n    WebServerResource:\n      description: Configuration for resources used by Airflow web server.\n      id: WebServerResource\n      properties:\n        cpu:\n          description: Optional. CPU request and limit for Airflow web server.\n          format: float\n          type: number\n        memoryGb:\n          description: Optional. Memory (GB) request and limit for Airflow web server.\n          format: float\n          type: number\n        storageGb:\n          description: Optional. Storage (GB) request and limit for Airflow web server.\n          format: float\n          type: number\n      type: object\n    WorkerResource:\n      description: Configuration for resources used by Airflow workers.\n      id: WorkerResource\n      properties:\n        cpu:\n          description: Optional. CPU request and limit for a single Airflow worker replica.\n          format: float\n          type: number\n        maxCount:\n          description: Optional. Maximum number of workers for autoscaling.\n          format: int32\n          type: integer\n        memoryGb:\n          description: Optional. Memory (GB) request and limit for a single Airflow worker replica.\n          format: float\n          type: number\n        minCount:\n          description: Optional. Minimum number of workers for autoscaling.\n          format: int32\n          type: integer\n        storageGb:\n          description: Optional. Storage (GB) request and limit for a single Airflow worker replica.\n          format: float\n          type: number\n      type: object\n    WorkloadsConfig:\n      description: The Kubernetes workloads configuration for GKE cluster associated with the Cloud Composer environment. Supported for Cloud Composer environments in versions composer-2.*.*-airflow-*.*.* and newer.\n      id: WorkloadsConfig\n      properties:\n        scheduler:\n          $ref: '#/components/schemas/SchedulerResource'\n          description: Optional. Resources used by Airflow schedulers.\n        webServer:\n          $ref: '#/components/schemas/WebServerResource'\n          description: Optional. Resources used by Airflow web server.\n        worker:\n          $ref: '#/components/schemas/WorkerResource'\n          description: Optional. Resources used by Airflow workers.\n      type: object\n  securitySchemes:\n    Oauth2:\n      description: Oauth 2.0 implicit authentication\n      flows:\n        implicit:\n          authorizationUrl: https://accounts.google.com/o/oauth2/auth\n          scopes:\n            https://www.googleapis.com/auth/cloud-platform: See, edit, configure, and delete your Google Cloud data and see the email address for your Google Account.\n      type: oauth2\n    Oauth2c:\n      description: Oauth 2.0 authorization code authentication\n      flows:\n        authorizationCode:\n          authorizationUrl: https://accounts.google.com/o/oauth2/auth\n          scopes:\n            https://www.googleapis.com/auth/cloud-platform: See, edit, configure, and delete your Google Cloud data and see the email address for your Google Account.\n          tokenUrl: https://accounts.google.com/o/oauth2/token\n      type: oauth2\n  x-stackQL-resources:\n    environments:\n      id: google.composer.environments\n      name: environments\n      title: Environments\n      methods:\n        projects_locations_environments_list:\n          operation:\n            $ref: '#/paths/~1v1~1projects~1{projectsId}~1locations~1{locationsId}~1environments/get'\n          response:\n            mediaType: application/json\n            openAPIDocKey: '200'\n            objectKey: environments\n        projects_locations_environments_create:\n          operation:\n            $ref: '#/paths/~1v1~1projects~1{projectsId}~1locations~1{locationsId}~1environments/post'\n          response:\n            mediaType: application/json\n            openAPIDocKey: '200'\n        projects_locations_environments_delete:\n          operation:\n            $ref: '#/paths/~1v1~1projects~1{projectsId}~1locations~1{locationsId}~1environments~1{environmentsId}/delete'\n          response:\n            mediaType: application/json\n            openAPIDocKey: '200'\n        projects_locations_environments_get:\n          operation:\n            $ref: '#/paths/~1v1~1projects~1{projectsId}~1locations~1{locationsId}~1environments~1{environmentsId}/get'\n          response:\n            mediaType: application/json\n            openAPIDocKey: '200'\n        projects_locations_environments_patch:\n          operation:\n            $ref: '#/paths/~1v1~1projects~1{projectsId}~1locations~1{locationsId}~1environments~1{environmentsId}/patch'\n          response:\n            mediaType: application/json\n            openAPIDocKey: '200'\n      sqlVerbs:\n        select:\n          - $ref: '#/components/x-stackQL-resources/environments/methods/projects_locations_environments_get'\n          - $ref: '#/components/x-stackQL-resources/environments/methods/projects_locations_environments_list'\n        insert:\n          - $ref: '#/components/x-stackQL-resources/environments/methods/projects_locations_environments_create'\n        update: []\n        delete:\n          - $ref: '#/components/x-stackQL-resources/environments/methods/projects_locations_environments_delete'\n    image_versions:\n      id: google.composer.image_versions\n      name: image_versions\n      title: Image_versions\n      methods:\n        projects_locations_imageVersions_list:\n          operation:\n            $ref: '#/paths/~1v1~1projects~1{projectsId}~1locations~1{locationsId}~1imageVersions/get'\n          response:\n            mediaType: application/json\n            openAPIDocKey: '200'\n            objectKey: imageVersions\n      sqlVerbs:\n        select:\n          - $ref: '#/components/x-stackQL-resources/image_versions/methods/projects_locations_imageVersions_list'\n        insert: []\n        update: []\n        delete: []\n    operations:\n      id: google.composer.operations\n      name: operations\n      title: Operations\n      methods:\n        projects_locations_operations_list:\n          operation:\n            $ref: '#/paths/~1v1~1projects~1{projectsId}~1locations~1{locationsId}~1operations/get'\n          response:\n            mediaType: application/json\n            openAPIDocKey: '200'\n            objectKey: operations\n        projects_locations_operations_delete:\n          operation:\n            $ref: '#/paths/~1v1~1projects~1{projectsId}~1locations~1{locationsId}~1operations~1{operationsId}/delete'\n          response:\n            mediaType: application/json\n            openAPIDocKey: '200'\n        projects_locations_operations_get:\n          operation:\n            $ref: '#/paths/~1v1~1projects~1{projectsId}~1locations~1{locationsId}~1operations~1{operationsId}/get'\n          response:\n            mediaType: application/json\n            openAPIDocKey: '200'\n      sqlVerbs:\n        select:\n          - $ref: '#/components/x-stackQL-resources/operations/methods/projects_locations_operations_get'\n          - $ref: '#/components/x-stackQL-resources/operations/methods/projects_locations_operations_list'\n        insert: []\n        update: []\n        delete:\n          - $ref: '#/components/x-stackQL-resources/operations/methods/projects_locations_operations_delete'\nexternalDocs:\n  url: https://cloud.google.com/composer/\ninfo:\n  description: Manages Apache Airflow environments on Google Cloud Platform.\n  title: Cloud Composer API\n  version: v1\nopenapi: 3.1.0\npaths:\n  /v1/projects/{projectsId}/locations/{locationsId}/environments:\n    get:\n      description: List environments.\n      operationId: composer.projects.locations.environments.list\n      parameters:\n        - in: path\n          name: projectsId\n          required: true\n          schema:\n            type: string\n        - in: path\n          name: locationsId\n          required: true\n          schema:\n            type: string\n        - in: query\n          name: pageSize\n          schema:\n            type: integer\n        - in: query\n          name: pageToken\n          schema:\n            type: string\n      responses:\n        '200':\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/ListEnvironmentsResponse'\n          description: Successful response\n      security:\n        - Oauth2:\n            - https://www.googleapis.com/auth/cloud-platform\n          Oauth2c:\n            - https://www.googleapis.com/auth/cloud-platform\n      tags:\n        - environments\n    parameters:\n      - $ref: '#/components/parameters/callback'\n      - $ref: '#/components/parameters/access_token'\n      - $ref: '#/components/parameters/upload_protocol'\n      - $ref: '#/components/parameters/key'\n      - $ref: '#/components/parameters/alt'\n      - $ref: '#/components/parameters/uploadType'\n      - $ref: '#/components/parameters/oauth_token'\n      - $ref: '#/components/parameters/fields'\n      - $ref: '#/components/parameters/prettyPrint'\n      - $ref: '#/components/parameters/quotaUser'\n      - $ref: '#/components/parameters/_.xgafv'\n    post:\n      description: Create a new environment.\n      operationId: composer.projects.locations.environments.create\n      parameters:\n        - in: path\n          name: projectsId\n          required: true\n          schema:\n            type: string\n        - in: path\n          name: locationsId\n          required: true\n          schema:\n            type: string\n      requestBody:\n        content:\n          application/json:\n            schema:\n              $ref: '#/components/schemas/Environment'\n      responses:\n        '200':\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/Operation'\n          description: Successful response\n      security:\n        - Oauth2:\n            - https://www.googleapis.com/auth/cloud-platform\n          Oauth2c:\n            - https://www.googleapis.com/auth/cloud-platform\n      tags:\n        - environments\n  /v1/projects/{projectsId}/locations/{locationsId}/environments/{environmentsId}:\n    delete:\n      description: Delete an environment.\n      operationId: composer.projects.locations.environments.delete\n      parameters:\n        - in: path\n          name: projectsId\n          required: true\n          schema:\n            type: string\n        - in: path\n          name: locationsId\n          required: true\n          schema:\n            type: string\n        - in: path\n          name: environmentsId\n          required: true\n          schema:\n            type: string\n      responses:\n        '200':\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/Operation'\n          description: Successful response\n      security:\n        - Oauth2:\n            - https://www.googleapis.com/auth/cloud-platform\n          Oauth2c:\n            - https://www.googleapis.com/auth/cloud-platform\n      tags:\n        - environments\n    get:\n      description: Get an existing environment.\n      operationId: composer.projects.locations.environments.get\n      parameters:\n        - in: path\n          name: projectsId\n          required: true\n          schema:\n            type: string\n        - in: path\n          name: locationsId\n          required: true\n          schema:\n            type: string\n        - in: path\n          name: environmentsId\n          required: true\n          schema:\n            type: string\n      responses:\n        '200':\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/Environment'\n          description: Successful response\n      security:\n        - Oauth2:\n            - https://www.googleapis.com/auth/cloud-platform\n          Oauth2c:\n            - https://www.googleapis.com/auth/cloud-platform\n      tags:\n        - environments\n    parameters:\n      - $ref: '#/components/parameters/callback'\n      - $ref: '#/components/parameters/access_token'\n      - $ref: '#/components/parameters/upload_protocol'\n      - $ref: '#/components/parameters/key'\n      - $ref: '#/components/parameters/alt'\n      - $ref: '#/components/parameters/uploadType'\n      - $ref: '#/components/parameters/oauth_token'\n      - $ref: '#/components/parameters/fields'\n      - $ref: '#/components/parameters/prettyPrint'\n      - $ref: '#/components/parameters/quotaUser'\n      - $ref: '#/components/parameters/_.xgafv'\n    patch:\n      description: Update an environment.\n      operationId: composer.projects.locations.environments.patch\n      parameters:\n        - in: path\n          name: projectsId\n          required: true\n          schema:\n            type: string\n        - in: path\n          name: locationsId\n          required: true\n          schema:\n            type: string\n        - in: path\n          name: environmentsId\n          required: true\n          schema:\n            type: string\n        - in: query\n          name: updateMask\n          schema:\n            type: string\n      requestBody:\n        content:\n          application/json:\n            schema:\n              $ref: '#/components/schemas/Environment'\n      responses:\n        '200':\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/Operation'\n          description: Successful response\n      security:\n        - Oauth2:\n            - https://www.googleapis.com/auth/cloud-platform\n          Oauth2c:\n            - https://www.googleapis.com/auth/cloud-platform\n      tags:\n        - environments\n  /v1/projects/{projectsId}/locations/{locationsId}/imageVersions:\n    get:\n      description: List ImageVersions for provided location.\n      operationId: composer.projects.locations.imageVersions.list\n      parameters:\n        - in: path\n          name: projectsId\n          required: true\n          schema:\n            type: string\n        - in: path\n          name: locationsId\n          required: true\n          schema:\n            type: string\n        - in: query\n          name: pageToken\n          schema:\n            type: string\n        - in: query\n          name: includePastReleases\n          schema:\n            type: boolean\n        - in: query\n          name: pageSize\n          schema:\n            type: integer\n      responses:\n        '200':\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/ListImageVersionsResponse'\n          description: Successful response\n      security:\n        - Oauth2:\n            - https://www.googleapis.com/auth/cloud-platform\n          Oauth2c:\n            - https://www.googleapis.com/auth/cloud-platform\n      tags:\n        - image_versions\n    parameters:\n      - $ref: '#/components/parameters/callback'\n      - $ref: '#/components/parameters/access_token'\n      - $ref: '#/components/parameters/upload_protocol'\n      - $ref: '#/components/parameters/key'\n      - $ref: '#/components/parameters/alt'\n      - $ref: '#/components/parameters/uploadType'\n      - $ref: '#/components/parameters/oauth_token'\n      - $ref: '#/components/parameters/fields'\n      - $ref: '#/components/parameters/prettyPrint'\n      - $ref: '#/components/parameters/quotaUser'\n      - $ref: '#/components/parameters/_.xgafv'\n  /v1/projects/{projectsId}/locations/{locationsId}/operations:\n    get:\n      description: 'Lists operations that match the specified filter in the request. If the server doesn''t support this method, it returns `UNIMPLEMENTED`. NOTE: the `name` binding allows API services to override the binding to use different resource name schemes, such as `users/*/operations`. To override the binding, API services can add a binding such as `\"/v1/{name=users/*}/operations\"` to their service configuration. For backwards compatibility, the default name includes the operations collection id, however overriding users must ensure the name binding is the parent resource, without the operations collection id.'\n      operationId: composer.projects.locations.operations.list\n      parameters:\n        - in: path\n          name: projectsId\n          required: true\n          schema:\n            type: string\n        - in: path\n          name: locationsId\n          required: true\n          schema:\n            type: string\n        - in: query\n          name: pageToken\n          schema:\n            type: string\n        - in: query\n          name: filter\n          schema:\n            type: string\n        - in: query\n          name: pageSize\n          schema:\n            type: integer\n      responses:\n        '200':\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/ListOperationsResponse'\n          description: Successful response\n      security:\n        - Oauth2:\n            - https://www.googleapis.com/auth/cloud-platform\n          Oauth2c:\n            - https://www.googleapis.com/auth/cloud-platform\n      tags:\n        - operations\n    parameters:\n      - $ref: '#/components/parameters/callback'\n      - $ref: '#/components/parameters/access_token'\n      - $ref: '#/components/parameters/upload_protocol'\n      - $ref: '#/components/parameters/key'\n      - $ref: '#/components/parameters/alt'\n      - $ref: '#/components/parameters/uploadType'\n      - $ref: '#/components/parameters/oauth_token'\n      - $ref: '#/components/parameters/fields'\n      - $ref: '#/components/parameters/prettyPrint'\n      - $ref: '#/components/parameters/quotaUser'\n      - $ref: '#/components/parameters/_.xgafv'\n  /v1/projects/{projectsId}/locations/{locationsId}/operations/{operationsId}:\n    delete:\n      description: Deletes a long-running operation. This method indicates that the client is no longer interested in the operation result. It does not cancel the operation. If the server doesn't support this method, it returns `google.rpc.Code.UNIMPLEMENTED`.\n      operationId: composer.projects.locations.operations.delete\n      parameters:\n        - in: path\n          name: projectsId\n          required: true\n          schema:\n            type: string\n        - in: path\n          name: locationsId\n          required: true\n          schema:\n            type: string\n        - in: path\n          name: operationsId\n          required: true\n          schema:\n            type: string\n      responses:\n        '200':\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/Empty'\n          description: Successful response\n      security:\n        - Oauth2:\n            - https://www.googleapis.com/auth/cloud-platform\n          Oauth2c:\n            - https://www.googleapis.com/auth/cloud-platform\n      tags:\n        - operations\n    get:\n      description: Gets the latest state of a long-running operation. Clients can use this method to poll the operation result at intervals as recommended by the API service.\n      operationId: composer.projects.locations.operations.get\n      parameters:\n        - in: path\n          name: projectsId\n          required: true\n          schema:\n            type: string\n        - in: path\n          name: locationsId\n          required: true\n          schema:\n            type: string\n        - in: path\n          name: operationsId\n          required: true\n          schema:\n            type: string\n      responses:\n        '200':\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/Operation'\n          description: Successful response\n      security:\n        - Oauth2:\n            - https://www.googleapis.com/auth/cloud-platform\n          Oauth2c:\n            - https://www.googleapis.com/auth/cloud-platform\n      tags:\n        - operations\n    parameters:\n      - $ref: '#/components/parameters/callback'\n      - $ref: '#/components/parameters/access_token'\n      - $ref: '#/components/parameters/upload_protocol'\n      - $ref: '#/components/parameters/key'\n      - $ref: '#/components/parameters/alt'\n      - $ref: '#/components/parameters/uploadType'\n      - $ref: '#/components/parameters/oauth_token'\n      - $ref: '#/components/parameters/fields'\n      - $ref: '#/components/parameters/prettyPrint'\n      - $ref: '#/components/parameters/quotaUser'\n      - $ref: '#/components/parameters/_.xgafv'\nservers:\n  - url: https://composer.googleapis.com\n",
			"canonicalURL": "/github.com/stackql/stackql-provider-registry@fa7896eb5ee6872f9b9bb45ca9439fc11f7cd681/-/blob/providers/src/googleapis.com/v1.0.4/services/composer.yaml",
			"externalURLs": [
				{
					"url": "https://github.com/stackql/stackql-provider-registry/blob/fa7896eb5ee6872f9b9bb45ca9439fc11f7cd681/providers/src/googleapis.com/v1.0.4/services/composer.yaml",
					"serviceKind": "GITHUB"
				}
			]
		}
	},
	"Error": "parse: parse spec: parse components: schemas: \"ListOperationsResponse\": parse schema: property \"operations\": parse schema: parse schema: parse schema: property \"error\": parse schema: parse schema: property \"details\": parse schema: parse schema: parse schema: at 1:37108: unexpected schema type: \"any\""
}