{
	"File": {
		"__typename": "FileMatch",
		"repository": {
			"name": "github.com/zijianhuang/openapiclientgen"
		},
		"file": {
			"name": "sell_recommendation_v1_oas3.yaml",
			"size": 0,
			"path": "Tests/SwagTests/SwagMock/sell_recommendation_v1_oas3.yaml",
			"byteSize": 18594,
			"content": "---\nopenapi: \"3.0.0\"\ninfo:\n  title: \"Recommendation API\"\n  description: \"The \u003cb\u003eRecommendation API\u003c/b\u003e returns information that sellers can\\\n    \\ use to optimize the configuration of their listings on eBay. \u003cbr\u003e\u003cbr\u003eCurrently,\\\n    \\ the API contains a single method, \u003cb\u003efindListingRecommendations\u003c/b\u003e. This method\\\n    \\ provides information that sellers can use to configure Promoted Listings ad\\\n    \\ campaigns to maximize the visibility of their items in the eBay marketplace.\"\n  contact:\n    name: \"eBay Inc,\"\n  license:\n    name: \"eBay API License Agreement\"\n    url: \"https://go.developer.ebay.com/api-license-agreement\"\n  version: \"1.0.0\"\nservers:\n- url: \"https://api.ebay.com{basePath}\"\n  description: \"Production\"\n  variables:\n    basePath:\n      default: \"/sell/recommendation/v1\"\nsecurity:\n- bearerAuth: []\npaths:\n  /find:\n    post:\n      tags:\n      - \"listing_recommendation\"\n      description: \"The find method returns recommendations and information that sellers\\\n        \\ can use to optimize their listing configurations. The response from this\\\n        \\ method includes an array of the seller's listing IDs, where each element\\\n        \\ in the array contains recommendations related to the associated listing\\\n        \\ ID. The AD recommendation type The method currently returns information\\\n        \\ for a single recommendation type (AD) which contains information that sellers\\\n        \\ can use to configure Promoted Listings ad campaigns. AD contains two sets\\\n        \\ of information: The promoteWithAd indicator The promoteWithAd response field\\\n        \\ indicates whether or not eBay recommends you place the associated listing\\\n        \\ in a Promoted Listings ad campaign. The returned value is set to either\\\n        \\ RECOMMENDED or UNDETERMINED, where RECOMMENDED identifies the listings that\\\n        \\ will benefit the most from having them included in an ad campaign. The bid\\\n        \\ percentage Also known as the \u0026quot;ad rate,\u0026quot; the bidPercentage field\\\n        \\ provides the current trending bid percentage of similarly promoted items\\\n        \\ in the marketplace. The ad rate is a user-specified value that indicates\\\n        \\ the level of promotion that eBay applies to the campaign across the marketplace.\\\n        \\ The value is also used to calculate the Promotion Listings fee, which is\\\n        \\ assessed to the seller if a Promoted Listings action results in the sale\\\n        \\ of an item. Configuring the request You can configure a request to review\\\n        \\ all of a seller's currently active listings, or just a subset of them. All\\\n        \\ active listings \u0026ndash; If you leave the request body empty, the request\\\n        \\ targets all the items currently listed by the seller. Here, the response\\\n        \\ is filtered to contain only the items where promoteWithAd equals RECOMMENDED.\\\n        \\ In this case, eBay recommends that all the returned listings should be included\\\n        \\ in a Promoted Listings ad campaign. Selected listing IDs \u0026ndash; If you\\\n        \\ populate the request body with a set of listingIds, the response contains\\\n        \\ data for all the specified listing IDs. In this scenario, the response provides\\\n        \\ you with information on listings where the promoteWithAd can be either RECOMMENDED\\\n        \\ or UNDETERMINED. The paginated response Because the response can contain\\\n        \\ many listing IDs, the findListingRecommendations method paginates the response\\\n        \\ set. You can control size of the returned pages, as well as an offset that\\\n        \\ dictates where to start the pagination, using query parameters in the request.\"\n      operationId: \"findListingRecommendations\"\n      parameters:\n      - name: \"filter\"\n        in: \"query\"\n        description: \"Provide a list of key-value pairs to specify the criteria you\\\n          \\ want to use to filter the response. In the list, separate each filter\\\n          \\ key from its associated value with a colon (\u0026quot;:\u0026quot;). Currently,\\\n          \\ the only supported filter value is recommendationTypes and it supports\\\n          \\ only the (\u0026quot;AD\u0026quot;) type. Follow the recommendationTypes specifier\\\n          \\ with the filter type(s) enclosed in curly braces (\u0026quot;{ }\u0026quot;), and\\\n          \\ separate multiple types with commas. Example: filter=recommendationTypes:{AD}\\\n          \\ Default: recommendationTypes:{AD}\"\n        required: false\n        schema:\n          type: \"string\"\n      - name: \"limit\"\n        in: \"query\"\n        description: \"Use this query parameter to set the maximum number of ads to\\\n          \\ return on a page from the paginated response. Default: 10 Maximum: 500\"\n        required: false\n        schema:\n          type: \"string\"\n      - name: \"offset\"\n        in: \"query\"\n        description: \"Specifies the number of ads to skip in the result set before\\\n          \\ returning the first ad in the paginated response. Combine offset with\\\n          \\ the limit query parameter to control the items returned in the response.\\\n          \\ For example, if you supply an offset of 0 and a limit of 10, the first\\\n          \\ page of the response contains the first 10 items from the complete list\\\n          \\ of items retrieved by the call. If offset is 10 and limit is 20, the first\\\n          \\ page of the response contains items 11-30 from the complete result set.\\\n          \\ Default: 0\"\n        required: false\n        schema:\n          type: \"string\"\n      - name: \"X-EBAY-C-MARKETPLACE-ID\"\n        in: \"header\"\n        description: \"Use this header to specify the eBay marketplace where you list\\\n          \\ the items for which you want to get recommendations.\"\n        required: true\n        schema:\n          type: \"string\"\n      requestBody:\n        content:\n          application/json:\n            schema:\n              $ref: \"#/components/schemas/FindListingRecommendationRequest\"\n        required: false\n      responses:\n        200:\n          description: \"Success\"\n          content:\n            application/json;charset=UTF-8:\n              schema:\n                $ref: \"#/components/schemas/PagedListingRecommendationCollection\"\n        400:\n          description: \"Bad Request\"\n          x-response-codes:\n            errors:\n              145106:\n                domain: \"API_RECOMMENDATION\"\n                category: \"REQUEST\"\n                description: \"Listing ID limit exceeded. You can pass up to a maximum\\\n                  \\ of 500 listing IDs per request.\"\n              145104:\n                domain: \"API_RECOMMENDATION\"\n                category: \"REQUEST\"\n                description: \"The recommendationTypes filter accepts a single value\\\n                  \\ only.\"\n              145105:\n                domain: \"API_RECOMMENDATION\"\n                category: \"REQUEST\"\n                description: \"Invalid listing Ids {listingIds}.\"\n              145102:\n                domain: \"API_RECOMMENDATION\"\n                category: \"REQUEST\"\n                description: \"Invalid value {recommendationTypes} for recommendationTypes\\\n                  \\ filter\"\n              145103:\n                domain: \"API_RECOMMENDATION\"\n                category: \"REQUEST\"\n                description: \"You must specify at least one listing ID.\"\n              145101:\n                domain: \"API_RECOMMENDATION\"\n                category: \"REQUEST\"\n                description: \"The marketplace value {marketplaceId} is not supported.\\\n                  \\ The supported values are: {marketplaceIds}. \"\n        500:\n          description: \"Internal Server Error\"\n          x-response-codes:\n            errors:\n              145000:\n                domain: \"API_RECOMMENDATION\"\n                category: \"APPLICATION\"\n                description: \"Internal error. Please wait a few minutes and try the\\\n                  \\ call again\"\n        204:\n          description: \"No Content\"\n      security:\n      - api_auth:\n        - \"https://api.ebay.com/oauth/api_scope/sell.inventory\"\ncomponents:\n  schemas:\n    Ad:\n      type: \"object\"\n      properties:\n        bidPercentages:\n          type: \"array\"\n          description: \"This field returns information that you can use to configure\\\n            \\ the bidPercentage field in a Promoted Listings campaign. While this\\\n            \\ field returns an array, TRENDING is currently the only supported bid\\\n            \\ percentage type, so the array is populated with just a single element.\\\n            \\ The TRENDING bid percentage is calculated by reviewing the average ad\\\n            \\ rates of other similar promoted listings in the marketplace. Setting\\\n            \\ the bidPercentage of your ad campaign to this rate will help the items\\\n            \\ in the campaign be competitive with other items in the marketplace by\\\n            \\ improving their chances of being displayed more often in the marketplace.\"\n          items:\n            $ref: \"#/components/schemas/BidPercentages\"\n        promoteWithAd:\n          description: \"An enum whose values describe whether or not eBay recommends\\\n            \\ you place the associated listing in a Promoted Listings ad campaign.\\\n            \\ IDs deemed RECOMMENDED by eBay are the listings with the highest potential\\\n            \\ of benefiting from being promoted. The recommendation calculation is\\\n            \\ based on marketplace trends, like buyer demand and the competition in\\\n            \\ the item\u0026rsquo;s category. Note: A promoteWithAd value cannot be calculated\\\n            \\ for listings that are part of Promoted Listings campaigns. Because of\\\n            \\ this, if you call findListingRecommendations with a specific set of\\\n            \\ listing IDs, the promoteWithAd field is not returned for any of the\\\n            \\ listings that are involved in a promotion. However, as long as they\\\n            \\ are eligible, the trending bidPercentage is returned for all specified\\\n            \\ listings, even if they are part of an ad campaign.\"\n          $ref: \"#/components/schemas/PromoteWithAd\"\n      description: \"A complex type that contains recommendations and information on\\\n        \\ how to configure Promoted Listings ad campaigns.\"\n    Basis:\n      type: \"object\"\n      description: \"An enum that describes the different ways, or the basis, by which\\\n        \\ the bid percentage value is calculated. Currently, TRENDING is the only\\\n        \\ valid basis.\"\n      enum:\n      - \"TRENDING\"\n    BidPercentages:\n      type: \"object\"\n      properties:\n        basis:\n          description: \"The basis by which the ad rate is calculated. TRENDING is\\\n            \\ the currently supported value.\"\n          $ref: \"#/components/schemas/Basis\"\n        value:\n          type: \"string\"\n          description: \"The bid percentage data is a single precision value, as calculated\\\n            \\ by the associated basis. A TRENDING value is calculated by taking into\\\n            \\ account the average bid percentages of similar promoted listings in\\\n            \\ the associated marketplace. In Promoted listings ad campaigns, the bid\\\n            \\ percentage (also known as the ad rate) is a user-defined value that\\\n            \\ sets the level that eBay raises the visibility of the listing in the\\\n            \\ marketplace. It is also the rate that is used to calculate the Promoted\\\n            \\ Listings fee. Minimum value: 1.0 \u0026nbsp; Maximum value: 100.0\"\n      description: \"A complex type that returns data related to Promoted Listings\\\n        \\ bid percentages.\"\n    Error:\n      type: \"object\"\n      properties:\n        category:\n          type: \"string\"\n          description: \"Identifies the type of erro.\"\n        domain:\n          type: \"string\"\n          description: \"Name for the primary system where the error occurred. This\\\n            \\ is relevant for application errors.\"\n        errorId:\n          type: \"integer\"\n          description: \"A unique number to identify the error.\"\n          format: \"int32\"\n        inputRefIds:\n          type: \"array\"\n          description: \"An array of request elements most closely associated to the\\\n            \\ error.\"\n          items:\n            type: \"string\"\n        longMessage:\n          type: \"string\"\n          description: \"A more detailed explanation of the error.\"\n        message:\n          type: \"string\"\n          description: \"Information on how to correct the problem, in the end user's\\\n            \\ terms and language where applicable.\"\n        outputRefIds:\n          type: \"array\"\n          description: \"An array of request elements most closely associated to the\\\n            \\ error.\"\n          items:\n            type: \"string\"\n        parameters:\n          type: \"array\"\n          description: \"An array of name/value pairs that describe details the error\\\n            \\ condition. These are useful when multiple errors are returned.\"\n          items:\n            $ref: \"#/components/schemas/ErrorParameter\"\n        subdomain:\n          type: \"string\"\n          description: \"Further helps indicate which subsystem the error is coming\\\n            \\ from. System subcategories include: Initialization, Serialization, Security,\\\n            \\ Monitoring, Rate Limiting, etc.\"\n      description: \"This type defines the fields that can be returned in an error.\"\n    ErrorParameter:\n      type: \"object\"\n      properties:\n        name:\n          type: \"string\"\n          description: \"The object of the error.\"\n        value:\n          type: \"string\"\n          description: \"The value of the object.\"\n    FindListingRecommendationRequest:\n      type: \"object\"\n      properties:\n        listingIds:\n          type: \"array\"\n          description: \"A comma-separated list of listing IDs for which you want Promoted\\\n            \\ Listings ad configuration information. Currently, this method accepts\\\n            \\ only listingId values from the Trading API. Max: 500 listing IDs\"\n          items:\n            type: \"string\"\n      description: \"An list of listing ID values for which you want Promoted Listings\\\n        \\ ad configuration information.\"\n    ListingRecommendation:\n      type: \"object\"\n      properties:\n        listingId:\n          type: \"string\"\n          description: \"An ID that identifies the active listing associated with the\\\n            \\ eBay recommendations.\"\n        marketing:\n          description: \"This return object provides the eBay recommendations and information\\\n            \\ related to the associated listing ID. The container currently returns\\\n            \\ the AD recommendation type, which contains information that sellers\\\n            \\ can use to configure Promoted Listings ad campaigns. This container\\\n            \\ is returned with each ListingRecommendation object, except when: The\\\n            \\ listing ID is not eligible for Promoted Listings The listing ID is currently\\\n            \\ in a Promoted Listings campaign The listing ID is invalid\"\n          $ref: \"#/components/schemas/MarketingRecommendation\"\n      description: \"A complex type that contains the ID of an actively listed item\\\n        \\ and a set of related listing recommendations. The recommendations contain\\\n        \\ information the seller can use to optimize their listing configurations.\"\n    MarketingRecommendation:\n      type: \"object\"\n      properties:\n        ad:\n          description: \"An object that contains Promoted Listings recommendations\\\n            \\ and information related to the associated listing ID.\"\n          $ref: \"#/components/schemas/Ad\"\n        message:\n          type: \"string\"\n          description: \"A message that can conditionally accompany the listing information.\"\n      description: \"A complex type that contains information about how a seller can\\\n        \\ improve their listing configurations. The AD object contains Promoted Listings\\\n        \\ recommendations and information, which the seller can use to improve buyer\\\n        \\ conversions. The response can also contain an optional message about the\\\n        \\ returned data.\"\n    PagedListingRecommendationCollection:\n      type: \"object\"\n      properties:\n        href:\n          type: \"string\"\n          description: \"The URI of the current page of results from the result set.\"\n        limit:\n          type: \"integer\"\n          description: \"The number of items returned on a single page from the result\\\n            \\ set. This value can be set with the limit request parameter.\"\n          format: \"int32\"\n        listingRecommendations:\n          type: \"array\"\n          description: \"Returns a list of listingRecommendations, where each element\\\n            \\ in the list offers recommendations for the associated listing ID.\"\n          items:\n            $ref: \"#/components/schemas/ListingRecommendation\"\n        next:\n          type: \"string\"\n          description: \"The URI for the next page of results. This value is returned\\\n            \\ only if there is an additional page of results in the result set. Max\\\n            \\ length: 2048\"\n        offset:\n          type: \"integer\"\n          description: \"The number of results skipped in the result set before listing\\\n            \\ the first returned result. This value can be set with the offset request\\\n            \\ parameter.\"\n          format: \"int32\"\n        prev:\n          type: \"string\"\n          description: \"The URI for the previous page of results. This value is returned\\\n            \\ only if there is a previous page of results in the result set. Max length:\\\n            \\ 2048\"\n        total:\n          type: \"integer\"\n          description: \"The total number of items in the result set.\"\n          format: \"int32\"\n      description: \"The high-level object used to return a set of Promoted Listings\\\n        \\ ad recommendations.\"\n    PromoteWithAd:\n      type: \"object\"\n      description: \"An enum that describes whether or not eBay recommends placing\\\n        \\ the associated listing in a Promoted Listings ad campaign.\"\n      enum:\n      - \"RECOMMENDED\"\n      - \"UNDETERMINED\"\n  securitySchemes:\n    api_auth:\n      type: \"oauth2\"\n      description: \"The security definitions for this API. Please check individual\\\n        \\ operations for applicable scopes.\"\n      flows:\n        authorizationCode:\n          authorizationUrl: \"https://auth.ebay.com/oauth2/authorize\"\n          tokenUrl: \"https://api.ebay.com/identity/v1/oauth2/token\"\n          scopes:\n            https://api.ebay.com/oauth/api_scope/sell.inventory: \"View and manage\\\n              \\ your inventory and offers\"\n    bearerAuth:\n      type: \"http\"\n      scheme: \"bearer\"\n",
			"canonicalURL": "/github.com/zijianhuang/openapiclientgen@dc7776174e1cb683c39c6493e4b38a0b3ef0a05f/-/blob/Tests/SwagTests/SwagMock/sell_recommendation_v1_oas3.yaml",
			"externalURLs": [
				{
					"url": "https://github.com/zijianhuang/openapiclientgen/blob/dc7776174e1cb683c39c6493e4b38a0b3ef0a05f/Tests/SwagTests/SwagMock/sell_recommendation_v1_oas3.yaml",
					"serviceKind": "GITHUB"
				}
			]
		}
	},
	"Error": "parse: parse spec: parse components: schemas: \"Ad\": parse schema: property \"bidPercentages\": parse schema: item: parse schema: resolve \"#/components/schemas/BidPercentages\": parse schema: property \"basis\": parse schema: resolve \"#/components/schemas/Basis\": parse enum values: parse value \"\\\"TRENDING\\\"\": unexpected type: \"object\""
}