{
	"File": {
		"__typename": "FileMatch",
		"repository": {
			"name": "github.com/restful-ma/thresholds"
		},
		"file": {
			"name": "microsoft.com-cognitiveservices-CustomSearch-1.0-swagger.yaml",
			"size": 0,
			"path": "benchmark-repository/openapi/microsoft.com-cognitiveservices-CustomSearch-1.0-swagger.yaml",
			"byteSize": 31654,
			"content": "openapi: 3.0.0\ninfo:\n  contact:\n    x-twitter: microsoft\n  description: The Bing Custom Search API lets you send a search query to Bing and get back\n    search results customized to meet your custom search definition.\n  title: Custom Search Client\n  version: \"1.0\"\n  x-apisguru-categories:\n    - cloud\n  x-logo:\n    url: https://twitter.com/microsoft/profile_image?size=original\n  x-origin:\n    - format: swagger\n      url: https://raw.githubusercontent.com/Azure/azure-rest-api-specs/master/specification/cognitiveservices/data-plane/CustomWebSearch/stable/v1.0/CustomSearch.json\n      version: \"2.0\"\n  x-providerName: microsoft.com\n  x-serviceName: cognitiveservices-CustomSearch\n  x-tags:\n    - Microsoft\nsecurity:\n  - apiKeyHeader: []\npaths:\n  /search:\n    get:\n      operationId: CustomInstance_Search\n      parameters:\n        - $ref: \"#/components/parameters/x-bingapis-sdk\"\n        - description: The default media type is application/json. To specify that the\n            response use [JSON-LD](http://json-ld.org/), set the Accept header\n            to application/ld+json.\n          in: header\n          name: Accept\n          required: false\n          schema:\n            type: string\n        - description: A comma-delimited list of one or more languages to use for user\n            interface strings. The list is in decreasing order of preference.\n            For additional information, including expected format, see\n            [RFC2616](http://www.w3.org/Protocols/rfc2616/rfc2616-sec14.html).\n            This header and the setLang query parameter are mutually exclusive;\n            do not specify both. If you set this header, you must also specify\n            the cc query parameter. Bing will use the first supported language\n            it finds from the list, and combine that language with the cc\n            parameter value to determine the market to return results for. If\n            the list does not include a supported language, Bing will find the\n            closest language and market that supports the request, and may use\n            an aggregated or default market for the results instead of a\n            specified one. You should use this header and the cc query parameter\n            only if you specify multiple languages; otherwise, you should use\n            the mkt and setLang query parameters. A user interface string is a\n            string that's used as a label in a user interface. There are very\n            few user interface strings in the JSON response objects. Any links\n            in the response objects to Bing.com properties will apply the\n            specified language.\n          in: header\n          name: Accept-Language\n          required: false\n          x-ms-client-name: AcceptLanguage\n          schema:\n            type: string\n        - description: The user agent originating the request. Bing uses the user agent to\n            provide mobile users with an optimized experience. Although\n            optional, you are strongly encouraged to always specify this header.\n            The user-agent should be the same string that any commonly used\n            browser would send. For information about user agents, see [RFC\n            2616](http://www.w3.org/Protocols/rfc2616/rfc2616-sec14.html).\n          in: header\n          name: User-Agent\n          required: false\n          x-ms-client-name: UserAgent\n          schema:\n            type: string\n        - description: \"Bing uses this header to provide users with consistent behavior\n            across Bing API calls. Bing often flights new features and\n            improvements, and it uses the client ID as a key for assigning\n            traffic on different flights. If you do not use the same client ID\n            for a user across multiple requests, then Bing may assign the user\n            to multiple conflicting flights. Being assigned to multiple\n            conflicting flights can lead to an inconsistent user experience. For\n            example, if the second request has a different flight assignment\n            than the first, the experience may be unexpected. Also, Bing can use\n            the client ID to tailor web results to that client ID’s search\n            history, providing a richer experience for the user. Bing also uses\n            this header to help improve result rankings by analyzing the\n            activity generated by a client ID. The relevance improvements help\n            with better quality of results delivered by Bing APIs and in turn\n            enables higher click-through rates for the API consumer. IMPORTANT:\n            Although optional, you should consider this header required.\n            Persisting the client ID across multiple requests for the same end\n            user and device combination enables 1) the API consumer to receive a\n            consistent user experience, and 2) higher click-through rates via\n            better quality of results from the Bing APIs. Each user that uses\n            your application on the device must have a unique, Bing generated\n            client ID. If you do not include this header in the request, Bing\n            generates an ID and returns it in the X-MSEdge-ClientID response\n            header. The only time that you should NOT include this header in a\n            request is the first time the user uses your app on that device. Use\n            the client ID for each Bing API request that your app makes for this\n            user on the device. Persist the client ID. To persist the ID in a\n            browser app, use a persistent HTTP cookie to ensure the ID is used\n            across all sessions. Do not use a session cookie. For other apps\n            such as mobile apps, use the device's persistent storage to persist\n            the ID. The next time the user uses your app on that device, get the\n            client ID that you persisted. Bing responses may or may not include\n            this header. If the response includes this header, capture the\n            client ID and use it for all subsequent Bing requests for the user\n            on that device. If you include the X-MSEdge-ClientID, you must not\n            include cookies in the request.\"\n          in: header\n          name: X-MSEdge-ClientID\n          required: false\n          x-ms-client-name: ClientId\n          schema:\n            type: string\n        - description: The IPv4 or IPv6 address of the client device. The IP address is\n            used to discover the user's location. Bing uses the location\n            information to determine safe search behavior. Although optional,\n            you are encouraged to always specify this header and the\n            X-Search-Location header. Do not obfuscate the address (for example,\n            by changing the last octet to 0). Obfuscating the address results in\n            the location not being anywhere near the device's actual location,\n            which may result in Bing serving erroneous results.\n          in: header\n          name: X-MSEdge-ClientIP\n          required: false\n          x-ms-client-name: ClientIp\n          schema:\n            type: string\n        - description: \"A semicolon-delimited list of key/value pairs that describe the\n            client's geographical location. Bing uses the location information\n            to determine safe search behavior and to return relevant local\n            content. Specify the key/value pair as \u003ckey\u003e:\u003cvalue\u003e. The following\n            are the keys that you use to specify the user's location. lat\n            (required): The latitude of the client's location, in degrees. The\n            latitude must be greater than or equal to -90.0 and less than or\n            equal to +90.0. Negative values indicate southern latitudes and\n            positive values indicate northern latitudes. long (required): The\n            longitude of the client's location, in degrees. The longitude must\n            be greater than or equal to -180.0 and less than or equal to +180.0.\n            Negative values indicate western longitudes and positive values\n            indicate eastern longitudes. re (required): The radius, in meters,\n            which specifies the horizontal accuracy of the coordinates. Pass the\n            value returned by the device's location service. Typical values\n            might be 22m for GPS/Wi-Fi, 380m for cell tower triangulation, and\n            18,000m for reverse IP lookup. ts (optional): The UTC UNIX timestamp\n            of when the client was at the location. (The UNIX timestamp is the\n            number of seconds since January 1, 1970.) head (optional): The\n            client's relative heading or direction of travel. Specify the\n            direction of travel as degrees from 0 through 360, counting\n            clockwise relative to true north. Specify this key only if the sp\n            key is nonzero. sp (optional): The horizontal velocity (speed), in\n            meters per second, that the client device is traveling. alt\n            (optional): The altitude of the client device, in meters. are\n            (optional): The radius, in meters, that specifies the vertical\n            accuracy of the coordinates. Specify this key only if you specify\n            the alt key. Although many of the keys are optional, the more\n            information that you provide, the more accurate the location results\n            are. Although optional, you are encouraged to always specify the\n            user's geographical location. Providing the location is especially\n            important if the client's IP address does not accurately reflect the\n            user's physical location (for example, if the client uses VPN). For\n            optimal results, you should include this header and the\n            X-MSEdge-ClientIP header, but at a minimum, you should include this\n            header.\"\n          in: header\n          name: X-Search-Location\n          required: false\n          x-ms-client-name: Location\n          schema:\n            type: string\n        - description: The identifier for the custom search configuration\n          in: query\n          name: customConfig\n          required: true\n          x-ms-client-name: CustomConfig\n          schema:\n            type: string\n          examples:\n            Successful query:\n              value: 123456\n        - description: A 2-character country code of the country where the results come\n            from. This API supports only the United States market. If you\n            specify this query parameter, it must be set to us. If you set this\n            parameter, you must also specify the Accept-Language header. Bing\n            uses the first supported language it finds from the languages list,\n            and combine that language with the country code that you specify to\n            determine the market to return results for. If the languages list\n            does not include a supported language, Bing finds the closest\n            language and market that supports the request, or it may use an\n            aggregated or default market for the results instead of a specified\n            one. You should use this query parameter and the Accept-Language\n            query parameter only if you specify multiple languages; otherwise,\n            you should use the mkt and setLang query parameters. This parameter\n            and the mkt query parameter are mutually exclusive—do not specify\n            both.\n          in: query\n          name: cc\n          required: false\n          x-ms-client-name: CountryCode\n          schema:\n            type: string\n        - description: The number of search results to return in the response. The default\n            is 10 and the maximum value is 50. The actual number delivered may\n            be less than requested.Use this parameter along with the offset\n            parameter to page results.For example, if your user interface\n            displays 10 search results per page, set count to 10 and offset to 0\n            to get the first page of results. For each subsequent page,\n            increment offset by 10 (for example, 0, 10, 20). It is possible for\n            multiple pages to include some overlap in results.\n          in: query\n          name: count\n          required: false\n          x-ms-client-name: Count\n          schema:\n            type: integer\n            format: int32\n        - description: The market where the results come from. Typically, mkt is the\n            country where the user is making the request from. However, it could\n            be a different country if the user is not located in a country where\n            Bing delivers results. The market must be in the form \u003clanguage\n            code\u003e-\u003ccountry code\u003e. For example, en-US. The string is case\n            insensitive. If known, you are encouraged to always specify the\n            market. Specifying the market helps Bing route the request and\n            return an appropriate and optimal response. If you specify a market\n            that is not listed in Market Codes, Bing uses a best fit market code\n            based on an internal mapping that is subject to change. This\n            parameter and the cc query parameter are mutually exclusive—do not\n            specify both.\n          in: query\n          name: mkt\n          required: false\n          x-ms-client-name: Market\n          schema:\n            type: string\n            default: en-us\n        - description: The zero-based offset that indicates the number of search results to\n            skip before returning results. The default is 0. The offset should\n            be less than (totalEstimatedMatches - count). Use this parameter\n            along with the count parameter to page results. For example, if your\n            user interface displays 10 search results per page, set count to 10\n            and offset to 0 to get the first page of results. For each\n            subsequent page, increment offset by 10 (for example, 0, 10, 20). it\n            is possible for multiple pages to include some overlap in results.\n          in: query\n          name: offset\n          required: false\n          x-ms-client-name: Offset\n          schema:\n            type: integer\n            format: int32\n        - description: \"The user's search query term. The term may not be empty. The term\n            may contain Bing Advanced Operators. For example, to limit results\n            to a specific domain, use the site: operator.\"\n          in: query\n          name: q\n          required: true\n          x-ms-client-name: Query\n          schema:\n            type: string\n          examples:\n            Successful query:\n              value: cortana\n        - description: \"A filter used to filter adult content. Off: Return webpages with\n            adult text, images, or videos. Moderate: Return webpages with adult\n            text, but not adult images or videos. Strict: Do not return webpages\n            with adult text, images, or videos. The default is Moderate. If the\n            request comes from a market that Bing's adult policy requires that\n            safeSearch is set to Strict, Bing ignores the safeSearch value and\n            uses Strict. If you use the site: query operator, there is the\n            chance that the response may contain adult content regardless of\n            what the safeSearch query parameter is set to. Use site: only if you\n            are aware of the content on the site and your scenario supports the\n            possibility of adult content.\"\n          in: query\n          name: safeSearch\n          required: false\n          x-ms-client-name: SafeSearch\n          x-ms-enum:\n            modelAsString: true\n            name: SafeSearch\n          schema:\n            type: string\n            enum:\n              - Off\n              - Moderate\n              - Strict\n        - description: The language to use for user interface strings. Specify the language\n            using the ISO 639-1 2-letter language code. For example, the\n            language code for English is EN. The default is EN (English).\n            Although optional, you should always specify the language.\n            Typically, you set setLang to the same language specified by mkt\n            unless the user wants the user interface strings displayed in a\n            different language. This parameter and the Accept-Language header\n            are mutually exclusive; do not specify both. A user interface string\n            is a string that's used as a label in a user interface. There are\n            few user interface strings in the JSON response objects. Also, any\n            links to Bing.com properties in the response objects apply the\n            specified language.\n          in: query\n          name: setLang\n          required: false\n          x-ms-client-name: SetLang\n          schema:\n            type: string\n        - description: A Boolean value that determines whether display strings should\n            contain decoration markers such as hit highlighting characters. If\n            true, the strings may include markers. The default is false. To\n            specify whether to use Unicode characters or HTML tags as the\n            markers, see the textFormat query parameter.\n          in: query\n          name: textDecorations\n          required: false\n          x-ms-client-name: TextDecorations\n          schema:\n            type: boolean\n        - description: The type of markers to use for text decorations (see the\n            textDecorations query parameter). Possible values are Raw—Use\n            Unicode characters to mark content that needs special formatting.\n            The Unicode characters are in the range E000 through E019. For\n            example, Bing uses E000 and E001 to mark the beginning and end of\n            query terms for hit highlighting. HTML—Use HTML tags to mark content\n            that needs special formatting. For example, use \u003cb\u003e tags to\n            highlight query terms in display strings. The default is Raw. For\n            display strings that contain escapable HTML characters such as \u003c, \u003e,\n            and \u0026, if textFormat is set to HTML, Bing escapes the characters as\n            appropriate (for example, \u003c is escaped to \u0026lt;).\n          in: query\n          name: textFormat\n          required: false\n          x-ms-client-name: TextFormat\n          x-ms-enum:\n            modelAsString: true\n            name: TextFormat\n          schema:\n            type: string\n            enum:\n              - Raw\n              - Html\n      responses:\n        \"200\":\n          description: Success.\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/SearchResponse\"\n              examples:\n                Successful query:\n                  $ref: \"#/components/examples/Successful_query\"\n        default:\n          description: An error has occurred. Check the response type and/or status code\n            for more details.\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/ErrorResponse\"\n      summary: The Custom Search API lets you send a search query to Bing and get back\n        web pages found in your custom view of the web.\n      tags:\n        - CustomSearch\nservers:\n  - url: https://api.cognitive.microsoft.com/bingcustomsearch/v7.0\n  - url: \"{Endpoint}/bingcustomsearch/v7.0\"\n    variables:\n      Endpoint:\n        default: https://api.cognitive.microsoft.com\n        description: 'Supported Cognitive Services endpoints (protocol and hostname, for\n          example: \"https://westus.api.cognitive.microsoft.com\",\n          \"https://api.cognitive.microsoft.com\").'\n        x-ms-parameter-location: client\n        x-ms-skip-url-encoding: true\ncomponents:\n  examples:\n    Successful_query:\n      value:\n        _type: SearchResponse\n        webPages:\n          _type: Web/WebAnswer\n          totalEstimatedMatches: 1\n          value:\n            - _type: WebPage\n              dateLastCrawled: 2017-11-27T14:12:00.0000000Z\n              displayUrl: https://www.microsoft.com/en-us/cortana/skills/all\n              id: https://api.cognitive.microsoft.com/api/v7/#WebPages.0\n              name: Cortana Skills - microsoft.com\n              snippet: “Hey Cortana, ask Akinator to guess who I am thinking of.” “Hey\n                Cortana, ask Akinator to start.” “Hey Cortana, ask Akinator to\n                play a new round.” “Hey ...\n              url: https://www.microsoft.com/en-us/cortana/skills/all\n          webSearchUrl: https://www.bing.com/search?q=cortana\n  parameters:\n    x-bingapis-sdk:\n      description: Activate swagger compliance\n      in: header\n      name: X-BingApis-SDK\n      required: true\n      x-ms-enum:\n        modelAsString: true\n        name: XBingApisSDK\n      x-ms-parameter-location: method\n      schema:\n        type: string\n        enum:\n          - \"true\"\n      examples:\n        Successful query:\n          value: \"true\"\n  securitySchemes:\n    apiKeyHeader:\n      in: header\n      name: Ocp-Apim-Subscription-Key\n      type: apiKey\n  schemas:\n    Answer:\n      allOf:\n        - $ref: \"#/components/schemas/Response\"\n      properties:\n        followUpQueries:\n          items:\n            $ref: \"#/components/schemas/Query\"\n          readOnly: true\n          type: array\n      type: object\n    CreativeWork:\n      allOf:\n        - $ref: \"#/components/schemas/Thing\"\n      properties:\n        provider:\n          description: The source of the creative work.\n          items:\n            $ref: \"#/components/schemas/Thing\"\n          readOnly: true\n          type: array\n        text:\n          readOnly: true\n          type: string\n        thumbnailUrl:\n          description: The URL to a thumbnail of the item.\n          readOnly: true\n          type: string\n      type: object\n    Error:\n      description: Defines the error that occurred.\n      properties:\n        code:\n          default: None\n          description: The error code that identifies the category of error.\n          enum:\n            - None\n            - ServerError\n            - InvalidRequest\n            - RateLimitExceeded\n            - InvalidAuthorization\n            - InsufficientAuthorization\n          type: string\n          x-ms-enum:\n            modelAsString: true\n            name: ErrorCode\n        message:\n          description: A description of the error.\n          type: string\n        moreDetails:\n          description: A description that provides additional information about the error.\n          readOnly: true\n          type: string\n        parameter:\n          description: The parameter in the request that caused the error.\n          readOnly: true\n          type: string\n        subCode:\n          description: The error code that further helps to identify the error.\n          enum:\n            - UnexpectedError\n            - ResourceError\n            - NotImplemented\n            - ParameterMissing\n            - ParameterInvalidValue\n            - HttpNotAllowed\n            - Blocked\n            - AuthorizationMissing\n            - AuthorizationRedundancy\n            - AuthorizationDisabled\n            - AuthorizationExpired\n          readOnly: true\n          type: string\n          x-ms-enum:\n            modelAsString: true\n            name: ErrorSubCode\n        value:\n          description: The parameter's value in the request that was not valid.\n          readOnly: true\n          type: string\n      required:\n        - code\n        - message\n      type: object\n    ErrorResponse:\n      allOf:\n        - $ref: \"#/components/schemas/Response\"\n      description: The top-level response that represents a failed request.\n      properties:\n        errors:\n          description: A list of errors that describe the reasons why the request failed.\n          items:\n            $ref: \"#/components/schemas/Error\"\n          type: array\n      required:\n        - errors\n      type: object\n    Identifiable:\n      allOf:\n        - $ref: \"#/components/schemas/ResponseBase\"\n      description: Defines the identity of a resource.\n      properties:\n        id:\n          description: A String identifier.\n          readOnly: true\n          type: string\n      type: object\n    Query:\n      description: Defines a search query.\n      properties:\n        displayText:\n          description: The display version of the query term. This version of the query\n            term may contain special characters that highlight the search term\n            found in the query string. The string contains the highlighting\n            characters only if the query enabled hit highlighting\n          readOnly: true\n          type: string\n        searchLink:\n          readOnly: true\n          type: string\n        text:\n          description: The query string. Use this string as the query term in a new search\n            request.\n          type: string\n        webSearchUrl:\n          description: The URL that takes the user to the Bing search results page for the\n            query.Only related search results include this field.\n          readOnly: true\n          type: string\n      required:\n        - text\n      type: object\n    QueryContext:\n      description: Defines the query context that Bing used for the request.\n      properties:\n        adultIntent:\n          description: A Boolean value that indicates whether the specified query has adult\n            intent. The value is true if the query has adult intent; otherwise,\n            false.\n          readOnly: true\n          type: boolean\n        alterationOverrideQuery:\n          description: The query string to use to force Bing to use the original string.\n            For example, if the query string is \"saling downwind\", the override\n            query string will be \"+saling downwind\". Remember to encode the\n            query string which results in \"%2Bsaling+downwind\". This field is\n            included only if the original query string contains a spelling\n            mistake.\n          readOnly: true\n          type: string\n        alteredQuery:\n          description: The query string used by Bing to perform the query. Bing uses the\n            altered query string if the original query string contained spelling\n            mistakes. For example, if the query string is \"saling downwind\", the\n            altered query string will be \"sailing downwind\". This field is\n            included only if the original query string contains a spelling\n            mistake.\n          readOnly: true\n          type: string\n        originalQuery:\n          description: The query string as specified in the request.\n          type: string\n      required:\n        - originalQuery\n      type: object\n    Response:\n      allOf:\n        - $ref: \"#/components/schemas/Identifiable\"\n      description: Defines a response. All schemas that could be returned at the root of a\n        response should inherit from this\n      properties:\n        webSearchUrl:\n          description: The URL To Bing's search result for this item.\n          readOnly: true\n          type: string\n      type: object\n    ResponseBase:\n      discriminator:\n        propertyName: _type\n      properties:\n        _type:\n          type: string\n      required:\n        - _type\n      type: object\n    SearchResponse:\n      allOf:\n        - $ref: \"#/components/schemas/Response\"\n      description: Defines the top-level object that the response includes when the request\n        succeeds.\n      properties:\n        queryContext:\n          $ref: \"#/components/schemas/QueryContext\"\n        webPages:\n          $ref: \"#/components/schemas/WebWebAnswer\"\n      type: object\n    SearchResultsAnswer:\n      allOf:\n        - $ref: \"#/components/schemas/Answer\"\n      properties:\n        isFamilyFriendly:\n          readOnly: true\n          type: boolean\n        queryContext:\n          $ref: \"#/components/schemas/QueryContext\"\n        totalEstimatedMatches:\n          description: The estimated number of webpages that are relevant to the query. Use\n            this number along with the count and offset query parameters to page\n            the results.\n          format: int64\n          readOnly: true\n          type: integer\n      type: object\n    Thing:\n      allOf:\n        - $ref: \"#/components/schemas/Response\"\n      properties:\n        bingId:\n          description: An ID that uniquely identifies this item.\n          readOnly: true\n          type: string\n        description:\n          description: A short description of the item.\n          readOnly: true\n          type: string\n        name:\n          description: The name of the thing represented by this object.\n          readOnly: true\n          type: string\n        url:\n          description: The URL to get more information about the thing represented by this\n            object.\n          readOnly: true\n          type: string\n      type: object\n    WebMetaTag:\n      description: Defines a webpage's metadata.\n      properties:\n        content:\n          description: The name of the metadata.\n          readOnly: true\n          type: string\n        name:\n          description: The metadata.\n          readOnly: true\n          type: string\n      type: object\n    WebPage:\n      allOf:\n        - $ref: \"#/components/schemas/CreativeWork\"\n      description: Defines a webpage that is relevant to the query.\n      properties:\n        dateLastCrawled:\n          description: The last time that Bing crawled the webpage. The date is in the\n            form, YYYY-MM-DDTHH:MM:SS. For example, 2015-04-13T05:23:39.\n          readOnly: true\n          type: string\n        deepLinks:\n          description: A list of links to related content that Bing found in the website\n            that contains this webpage. The Webpage object in this context\n            includes only the name, url, urlPingSuffix, and snippet fields.\n          items:\n            $ref: \"#/components/schemas/WebPage\"\n          readOnly: true\n          type: array\n        displayUrl:\n          description: The display URL of the webpage. The URL is meant for display\n            purposes only and is not well formed.\n          readOnly: true\n          type: string\n        searchTags:\n          description: A list of search tags that the webpage owner specified on the\n            webpage. The API returns only indexed search tags. The name field of\n            the MetaTag object contains the indexed search tag. Search tags\n            begin with search.* (for example, search.assetId). The content field\n            contains the tag's value.\n          items:\n            $ref: \"#/components/schemas/WebMetaTag\"\n          readOnly: true\n          type: array\n        snippet:\n          description: A snippet of text from the webpage that describes its contents.\n          readOnly: true\n          type: string\n      type: object\n    WebWebAnswer:\n      allOf:\n        - $ref: \"#/components/schemas/SearchResultsAnswer\"\n      description: Defines a list of relevant webpage links.\n      properties:\n        someResultsRemoved:\n          description: A Boolean value that indicates whether the response excluded some\n            results from the answer. If Bing excluded some results, the value is\n            true.\n          readOnly: true\n          type: boolean\n        value:\n          description: A list of webpages that are relevant to the query.\n          items:\n            $ref: \"#/components/schemas/WebPage\"\n          type: array\n      required:\n        - value\n      type: object\n      x-ms-discriminator-value: Web/WebAnswer\n"
		}
	},
	"Error": "parse: parse spec: paths: /search: get: operation \"CustomInstance_Search\": parameters: parse parameter \"safeSearch\": schema: parse enum values: parse value \"false\": expected type \"string\", got \"bool\""
}