{
	"File": {
		"__typename": "FileMatch",
		"repository": {
			"name": "github.com/stackql/stackql-provider-registry"
		},
		"file": {
			"name": "storagetransfer.yaml",
			"size": 0,
			"path": "providers/src/googleapis.com/v1.0.2/services/storagetransfer.yaml",
			"byteSize": 90468,
			"content": "components:\n  parameters:\n    _.xgafv:\n      description: V1 error format.\n      in: query\n      name: _.xgafv\n      schema:\n        enum:\n          - '1'\n          - '2'\n        type: string\n    access_token:\n      description: OAuth access token.\n      in: query\n      name: access_token\n      schema:\n        type: string\n    alt:\n      description: Data format for response.\n      in: query\n      name: alt\n      schema:\n        enum:\n          - json\n          - media\n          - proto\n        type: string\n    callback:\n      description: JSONP\n      in: query\n      name: callback\n      schema:\n        type: string\n    fields:\n      description: Selector specifying which fields to include in a partial response.\n      in: query\n      name: fields\n      schema:\n        type: string\n    key:\n      description: API key. Your API key identifies your project and provides you with API access, quota, and reports. Required unless you provide an OAuth 2.0 token.\n      in: query\n      name: key\n      schema:\n        type: string\n    oauth_token:\n      description: OAuth 2.0 token for the current user.\n      in: query\n      name: oauth_token\n      schema:\n        type: string\n    prettyPrint:\n      description: Returns response with indentations and line breaks.\n      in: query\n      name: prettyPrint\n      schema:\n        type: boolean\n    quotaUser:\n      description: Available to use for quota purposes for server-side applications. Can be any arbitrary string assigned to a user, but should not exceed 40 characters.\n      in: query\n      name: quotaUser\n      schema:\n        type: string\n    uploadType:\n      description: Legacy upload protocol for media (e.g. \"media\", \"multipart\").\n      in: query\n      name: uploadType\n      schema:\n        type: string\n    upload_protocol:\n      description: Upload protocol for media (e.g. \"raw\", \"multipart\").\n      in: query\n      name: upload_protocol\n      schema:\n        type: string\n  schemas:\n    AgentPool:\n      description: Represents an On-Premises Agent pool.\n      id: AgentPool\n      properties:\n        bandwidthLimit:\n          $ref: '#/components/schemas/BandwidthLimit'\n          description: Specifies the bandwidth limit details. If this field is unspecified, the default value is set as 'No Limit'.\n        displayName:\n          description: Specifies the client-specified AgentPool description.\n          type: string\n        name:\n          description: 'Required. Specifies a unique string that identifies the agent pool. Format: `projects/{project_id}/agentPools/{agent_pool_id}`'\n          type: string\n        state:\n          description: Output only. Specifies the state of the AgentPool.\n          enum:\n            - STATE_UNSPECIFIED\n            - CREATING\n            - CREATED\n            - DELETING\n          enumDescriptions:\n            - Default value. This value is unused.\n            - This is an initialization state. During this stage, the resources such as Pub/Sub topics are allocated for the AgentPool.\n            - Determines that the AgentPool is created for use. At this state, Agents can join the AgentPool and participate in the transfer jobs in that pool.\n            - Determines that the AgentPool deletion has been initiated, and all the resources are scheduled to be cleaned up and freed.\n          readOnly: true\n          type: string\n      type: object\n    AwsAccessKey:\n      description: AWS access key (see [AWS Security Credentials](https://docs.aws.amazon.com/general/latest/gr/aws-security-credentials.html)). For information on our data retention policy for user credentials, see [User credentials](/storage-transfer/docs/data-retention#user-credentials).\n      id: AwsAccessKey\n      properties:\n        accessKeyId:\n          description: Required. AWS access key ID.\n          type: string\n        secretAccessKey:\n          description: Required. AWS secret access key. This field is not returned in RPC responses.\n          type: string\n      type: object\n    AwsS3Data:\n      description: An AwsS3Data resource can be a data source, but not a data sink. In an AwsS3Data resource, an object's name is the S3 object's key name.\n      id: AwsS3Data\n      properties:\n        awsAccessKey:\n          $ref: '#/components/schemas/AwsAccessKey'\n          description: Input only. AWS access key used to sign the API requests to the AWS S3 bucket. Permissions on the bucket must be granted to the access ID of the AWS access key. For information on our data retention policy for user credentials, see [User credentials](/storage-transfer/docs/data-retention#user-credentials).\n        bucketName:\n          description: Required. S3 Bucket name (see [Creating a bucket](https://docs.aws.amazon.com/AmazonS3/latest/dev/create-bucket-get-location-example.html)).\n          type: string\n        path:\n          description: Root path to transfer objects. Must be an empty string or full path name that ends with a '/'. This field is treated as an object prefix. As such, it should generally not begin with a '/'.\n          type: string\n        roleArn:\n          description: The Amazon Resource Name (ARN) of the role to support temporary credentials via `AssumeRoleWithWebIdentity`. For more information about ARNs, see [IAM ARNs](https://docs.aws.amazon.com/IAM/latest/UserGuide/reference_identifiers.html#identifiers-arns). When a role ARN is provided, Transfer Service fetches temporary credentials for the session using a `AssumeRoleWithWebIdentity` call for the provided role using the GoogleServiceAccount for this project.\n          type: string\n      type: object\n    AzureBlobStorageData:\n      description: An AzureBlobStorageData resource can be a data source, but not a data sink. An AzureBlobStorageData resource represents one Azure container. The storage account determines the [Azure endpoint](https://docs.microsoft.com/en-us/azure/storage/common/storage-create-storage-account#storage-account-endpoints). In an AzureBlobStorageData resource, a blobs's name is the [Azure Blob Storage blob's key name](https://docs.microsoft.com/en-us/rest/api/storageservices/naming-and-referencing-containers--blobs--and-metadata#blob-names).\n      id: AzureBlobStorageData\n      properties:\n        azureCredentials:\n          $ref: '#/components/schemas/AzureCredentials'\n          description: Required. Input only. Credentials used to authenticate API requests to Azure. For information on our data retention policy for user credentials, see [User credentials](/storage-transfer/docs/data-retention#user-credentials).\n        container:\n          description: Required. The container to transfer from the Azure Storage account.\n          type: string\n        path:\n          description: Root path to transfer objects. Must be an empty string or full path name that ends with a '/'. This field is treated as an object prefix. As such, it should generally not begin with a '/'.\n          type: string\n        storageAccount:\n          description: Required. The name of the Azure Storage account.\n          type: string\n      type: object\n    AzureCredentials:\n      description: Azure credentials For information on our data retention policy for user credentials, see [User credentials](/storage-transfer/docs/data-retention#user-credentials).\n      id: AzureCredentials\n      properties:\n        sasToken:\n          description: Required. Azure shared access signature (SAS). For more information about SAS, see [Grant limited access to Azure Storage resources using shared access signatures (SAS)](https://docs.microsoft.com/en-us/azure/storage/common/storage-sas-overview).\n          type: string\n      type: object\n    BandwidthLimit:\n      description: Specifies a bandwidth limit for an agent pool.\n      id: BandwidthLimit\n      properties:\n        limitMbps:\n          description: Bandwidth rate in megabytes per second, distributed across all the agents in the pool.\n          format: int64\n          type: string\n      type: object\n    CancelOperationRequest:\n      description: The request message for Operations.CancelOperation.\n      id: CancelOperationRequest\n      properties: {}\n      type: object\n    Date:\n      description: 'Represents a whole or partial calendar date, such as a birthday. The time of day and time zone are either specified elsewhere or are insignificant. The date is relative to the Gregorian Calendar. This can represent one of the following: * A full date, with non-zero year, month, and day values. * A month and day, with a zero year (for example, an anniversary). * A year on its own, with a zero month and a zero day. * A year and month, with a zero day (for example, a credit card expiration date). Related types: * google.type.TimeOfDay * google.type.DateTime * google.protobuf.Timestamp'\n      id: Date\n      properties:\n        day:\n          description: Day of a month. Must be from 1 to 31 and valid for the year and month, or 0 to specify a year by itself or a year and month where the day isn't significant.\n          format: int32\n          type: integer\n        month:\n          description: Month of a year. Must be from 1 to 12, or 0 to specify a year without a month and day.\n          format: int32\n          type: integer\n        year:\n          description: Year of the date. Must be from 1 to 9999, or 0 to specify a date without a year.\n          format: int32\n          type: integer\n      type: object\n    Empty:\n      description: 'A generic empty message that you can re-use to avoid defining duplicated empty messages in your APIs. A typical example is to use it as the request or the response type of an API method. For instance: service Foo { rpc Bar(google.protobuf.Empty) returns (google.protobuf.Empty); }'\n      id: Empty\n      properties: {}\n      type: object\n    ErrorLogEntry:\n      description: An entry describing an error that has occurred.\n      id: ErrorLogEntry\n      properties:\n        errorDetails:\n          description: A list of messages that carry the error details.\n          items:\n            type: string\n          type: array\n        url:\n          description: Required. A URL that refers to the target (a data source, a data sink, or an object) with which the error is associated.\n          type: string\n      type: object\n    ErrorSummary:\n      description: A summary of errors by error code, plus a count and sample error log entries.\n      id: ErrorSummary\n      properties:\n        errorCode:\n          description: Required.\n          enum:\n            - OK\n            - CANCELLED\n            - UNKNOWN\n            - INVALID_ARGUMENT\n            - DEADLINE_EXCEEDED\n            - NOT_FOUND\n            - ALREADY_EXISTS\n            - PERMISSION_DENIED\n            - UNAUTHENTICATED\n            - RESOURCE_EXHAUSTED\n            - FAILED_PRECONDITION\n            - ABORTED\n            - OUT_OF_RANGE\n            - UNIMPLEMENTED\n            - INTERNAL\n            - UNAVAILABLE\n            - DATA_LOSS\n          enumDescriptions:\n            - 'Not an error; returned on success HTTP Mapping: 200 OK'\n            - 'The operation was cancelled, typically by the caller. HTTP Mapping: 499 Client Closed Request'\n            - 'Unknown error. For example, this error may be returned when a `Status` value received from another address space belongs to an error space that is not known in this address space. Also errors raised by APIs that do not return enough error information may be converted to this error. HTTP Mapping: 500 Internal Server Error'\n            - 'The client specified an invalid argument. Note that this differs from `FAILED_PRECONDITION`. `INVALID_ARGUMENT` indicates arguments that are problematic regardless of the state of the system (e.g., a malformed file name). HTTP Mapping: 400 Bad Request'\n            - 'The deadline expired before the operation could complete. For operations that change the state of the system, this error may be returned even if the operation has completed successfully. For example, a successful response from a server could have been delayed long enough for the deadline to expire. HTTP Mapping: 504 Gateway Timeout'\n            - 'Some requested entity (e.g., file or directory) was not found. Note to server developers: if a request is denied for an entire class of users, such as gradual feature rollout or undocumented allowlist, `NOT_FOUND` may be used. If a request is denied for some users within a class of users, such as user-based access control, `PERMISSION_DENIED` must be used. HTTP Mapping: 404 Not Found'\n            - 'The entity that a client attempted to create (e.g., file or directory) already exists. HTTP Mapping: 409 Conflict'\n            - 'The caller does not have permission to execute the specified operation. `PERMISSION_DENIED` must not be used for rejections caused by exhausting some resource (use `RESOURCE_EXHAUSTED` instead for those errors). `PERMISSION_DENIED` must not be used if the caller can not be identified (use `UNAUTHENTICATED` instead for those errors). This error code does not imply the request is valid or the requested entity exists or satisfies other pre-conditions. HTTP Mapping: 403 Forbidden'\n            - 'The request does not have valid authentication credentials for the operation. HTTP Mapping: 401 Unauthorized'\n            - 'Some resource has been exhausted, perhaps a per-user quota, or perhaps the entire file system is out of space. HTTP Mapping: 429 Too Many Requests'\n            - 'The operation was rejected because the system is not in a state required for the operation''s execution. For example, the directory to be deleted is non-empty, an rmdir operation is applied to a non-directory, etc. Service implementors can use the following guidelines to decide between `FAILED_PRECONDITION`, `ABORTED`, and `UNAVAILABLE`: (a) Use `UNAVAILABLE` if the client can retry just the failing call. (b) Use `ABORTED` if the client should retry at a higher level. For example, when a client-specified test-and-set fails, indicating the client should restart a read-modify-write sequence. (c) Use `FAILED_PRECONDITION` if the client should not retry until the system state has been explicitly fixed. For example, if an \"rmdir\" fails because the directory is non-empty, `FAILED_PRECONDITION` should be returned since the client should not retry unless the files are deleted from the directory. HTTP Mapping: 400 Bad Request'\n            - 'The operation was aborted, typically due to a concurrency issue such as a sequencer check failure or transaction abort. See the guidelines above for deciding between `FAILED_PRECONDITION`, `ABORTED`, and `UNAVAILABLE`. HTTP Mapping: 409 Conflict'\n            - 'The operation was attempted past the valid range. E.g., seeking or reading past end-of-file. Unlike `INVALID_ARGUMENT`, this error indicates a problem that may be fixed if the system state changes. For example, a 32-bit file system will generate `INVALID_ARGUMENT` if asked to read at an offset that is not in the range [0,2^32-1], but it will generate `OUT_OF_RANGE` if asked to read from an offset past the current file size. There is a fair bit of overlap between `FAILED_PRECONDITION` and `OUT_OF_RANGE`. We recommend using `OUT_OF_RANGE` (the more specific error) when it applies so that callers who are iterating through a space can easily look for an `OUT_OF_RANGE` error to detect when they are done. HTTP Mapping: 400 Bad Request'\n            - 'The operation is not implemented or is not supported/enabled in this service. HTTP Mapping: 501 Not Implemented'\n            - 'Internal errors. This means that some invariants expected by the underlying system have been broken. This error code is reserved for serious errors. HTTP Mapping: 500 Internal Server Error'\n            - 'The service is currently unavailable. This is most likely a transient condition, which can be corrected by retrying with a backoff. Note that it is not always safe to retry non-idempotent operations. See the guidelines above for deciding between `FAILED_PRECONDITION`, `ABORTED`, and `UNAVAILABLE`. HTTP Mapping: 503 Service Unavailable'\n            - 'Unrecoverable data loss or corruption. HTTP Mapping: 500 Internal Server Error'\n          type: string\n        errorCount:\n          description: Required. Count of this type of error.\n          format: int64\n          type: string\n        errorLogEntries:\n          description: Error samples. At most 5 error log entries are recorded for a given error code for a single transfer operation.\n          items:\n            $ref: '#/components/schemas/ErrorLogEntry'\n          type: array\n      type: object\n    GcsData:\n      description: In a GcsData resource, an object's name is the Cloud Storage object's name and its \"last modification time\" refers to the object's `updated` property of Cloud Storage objects, which changes when the content or the metadata of the object is updated.\n      id: GcsData\n      properties:\n        bucketName:\n          description: Required. Cloud Storage bucket name. Must meet [Bucket Name Requirements](/storage/docs/naming#requirements).\n          type: string\n        path:\n          description: Root path to transfer objects. Must be an empty string or full path name that ends with a '/'. This field is treated as an object prefix. As such, it should generally not begin with a '/'. The root path value must meet [Object Name Requirements](/storage/docs/naming#objectnames).\n          type: string\n      type: object\n    GoogleServiceAccount:\n      description: Google service account\n      id: GoogleServiceAccount\n      properties:\n        accountEmail:\n          description: Email address of the service account.\n          type: string\n        subjectId:\n          description: Unique identifier for the service account.\n          type: string\n      type: object\n    HttpData:\n      description: 'An HttpData resource specifies a list of objects on the web to be transferred over HTTP. The information of the objects to be transferred is contained in a file referenced by a URL. The first line in the file must be `\"TsvHttpData-1.0\"`, which specifies the format of the file. Subsequent lines specify the information of the list of objects, one object per list entry. Each entry has the following tab-delimited fields: * **HTTP URL** — The location of the object. * **Length** — The size of the object in bytes. * **MD5** — The base64-encoded MD5 hash of the object. For an example of a valid TSV file, see [Transferring data from URLs](https://cloud.google.com/storage-transfer/docs/create-url-list). When transferring data based on a URL list, keep the following in mind: * When an object located at `http(s)://hostname:port/` is transferred to a data sink, the name of the object at the data sink is `/`. * If the specified size of an object does not match the actual size of the object fetched, the object is not transferred. * If the specified MD5 does not match the MD5 computed from the transferred bytes, the object transfer fails. * Ensure that each URL you specify is publicly accessible. For example, in Cloud Storage you can [share an object publicly] (/storage/docs/cloud-console#_sharingdata) and get a link to it. * Storage Transfer Service obeys `robots.txt` rules and requires the source HTTP server to support `Range` requests and to return a `Content-Length` header in each response. * ObjectConditions have no effect when filtering objects to transfer.'\n      id: HttpData\n      properties:\n        listUrl:\n          description: Required. The URL that points to the file that stores the object list entries. This file must allow public access. Currently, only URLs with HTTP and HTTPS schemes are supported.\n          type: string\n      type: object\n    ListAgentPoolsResponse:\n      description: Response from ListAgentPools.\n      id: ListAgentPoolsResponse\n      properties:\n        agentPools:\n          description: A list of agent pools.\n          items:\n            $ref: '#/components/schemas/AgentPool'\n          type: array\n        nextPageToken:\n          description: The list next page token.\n          type: string\n      type: object\n    ListOperationsResponse:\n      description: The response message for Operations.ListOperations.\n      id: ListOperationsResponse\n      properties:\n        nextPageToken:\n          description: The standard List next-page token.\n          type: string\n        operations:\n          description: A list of operations that matches the specified filter in the request.\n          items:\n            $ref: '#/components/schemas/Operation'\n          type: array\n      type: object\n    ListTransferJobsResponse:\n      description: Response from ListTransferJobs.\n      id: ListTransferJobsResponse\n      properties:\n        nextPageToken:\n          description: The list next page token.\n          type: string\n        transferJobs:\n          description: A list of transfer jobs.\n          items:\n            $ref: '#/components/schemas/TransferJob'\n          type: array\n      type: object\n    LoggingConfig:\n      description: Specifies the logging behavior for transfer operations. For cloud-to-cloud transfers, logs are sent to Cloud Logging. See [Read transfer logs](https://cloud.google.com/storage-transfer/docs/read-transfer-logs) for details. For transfers to or from a POSIX file system, logs are stored in the Cloud Storage bucket that is the source or sink of the transfer. See [Managing Transfer for on-premises jobs] (https://cloud.google.com/storage-transfer/docs/managing-on-prem-jobs#viewing-logs) for details.\n      id: LoggingConfig\n      properties:\n        enableOnpremGcsTransferLogs:\n          description: For transfers with a PosixFilesystem source, this option enables the Cloud Storage transfer logs for this transfer.\n          type: boolean\n        logActionStates:\n          description: States in which `log_actions` are logged. If empty, no logs are generated. Not supported for transfers with PosixFilesystem data sources; use enable_onprem_gcs_transfer_logs instead.\n          items:\n            enum:\n              - LOGGABLE_ACTION_STATE_UNSPECIFIED\n              - SUCCEEDED\n              - FAILED\n            enumDescriptions:\n              - Default value. This value is unused.\n              - '`LoggableAction` completed successfully. `SUCCEEDED` actions are logged as INFO.'\n              - '`LoggableAction` terminated in an error state. `FAILED` actions are logged as ERROR.'\n            type: string\n          type: array\n        logActions:\n          description: Specifies the actions to be logged. If empty, no logs are generated. Not supported for transfers with PosixFilesystem data sources; use enable_onprem_gcs_transfer_logs instead.\n          items:\n            enum:\n              - LOGGABLE_ACTION_UNSPECIFIED\n              - FIND\n              - DELETE\n              - COPY\n            enumDescriptions:\n              - Default value. This value is unused.\n              - Listing objects in a bucket.\n              - Deleting objects at the source or the destination.\n              - Copying objects to Google Cloud Storage.\n            type: string\n          type: array\n      type: object\n    MetadataOptions:\n      description: Specifies the metadata options for running a transfer.\n      id: MetadataOptions\n      properties:\n        acl:\n          description: Specifies how each object's ACLs should be preserved for transfers between Google Cloud Storage buckets. If unspecified, the default behavior is the same as ACL_DESTINATION_BUCKET_DEFAULT.\n          enum:\n            - ACL_UNSPECIFIED\n            - ACL_DESTINATION_BUCKET_DEFAULT\n            - ACL_PRESERVE\n          enumDescriptions:\n            - ACL behavior is unspecified.\n            - Use the destination bucket's default object ACLS, if applicable.\n            - Preserve the object's original ACLs. This requires the service account to have `storage.objects.getIamPolicy` permission for the source object. [Uniform bucket-level access](https://cloud.google.com/storage/docs/uniform-bucket-level-access) must not be enabled on either the source or destination buckets.\n          type: string\n        gid:\n          description: Specifies how each file's POSIX group ID (GID) attribute should be handled by the transfer. By default, GID is not preserved. Only applicable to transfers involving POSIX file systems, and ignored for other transfers.\n          enum:\n            - GID_UNSPECIFIED\n            - GID_SKIP\n            - GID_NUMBER\n          enumDescriptions:\n            - GID behavior is unspecified.\n            - Do not preserve GID during a transfer job.\n            - Preserve GID during a transfer job.\n          type: string\n        kmsKey:\n          description: Specifies how each object's Cloud KMS customer-managed encryption key (CMEK) is preserved for transfers between Google Cloud Storage buckets. If unspecified, the default behavior is the same as KMS_KEY_DESTINATION_BUCKET_DEFAULT.\n          enum:\n            - KMS_KEY_UNSPECIFIED\n            - KMS_KEY_DESTINATION_BUCKET_DEFAULT\n            - KMS_KEY_PRESERVE\n          enumDescriptions:\n            - KmsKey behavior is unspecified.\n            - Use the destination bucket's default encryption settings.\n            - Preserve the object's original Cloud KMS customer-managed encryption key (CMEK) if present. Objects that do not use a Cloud KMS encryption key will be encrypted using the destination bucket's encryption settings.\n          type: string\n        mode:\n          description: Specifies how each file's mode attribute should be handled by the transfer. By default, mode is not preserved. Only applicable to transfers involving POSIX file systems, and ignored for other transfers.\n          enum:\n            - MODE_UNSPECIFIED\n            - MODE_SKIP\n            - MODE_PRESERVE\n          enumDescriptions:\n            - Mode behavior is unspecified.\n            - Do not preserve mode during a transfer job.\n            - Preserve mode during a transfer job.\n          type: string\n        storageClass:\n          description: Specifies the storage class to set on objects being transferred to Google Cloud Storage buckets. If unspecified, the default behavior is the same as STORAGE_CLASS_DESTINATION_BUCKET_DEFAULT.\n          enum:\n            - STORAGE_CLASS_UNSPECIFIED\n            - STORAGE_CLASS_DESTINATION_BUCKET_DEFAULT\n            - STORAGE_CLASS_PRESERVE\n            - STORAGE_CLASS_STANDARD\n            - STORAGE_CLASS_NEARLINE\n            - STORAGE_CLASS_COLDLINE\n            - STORAGE_CLASS_ARCHIVE\n          enumDescriptions:\n            - Storage class behavior is unspecified.\n            - Use the destination bucket's default storage class.\n            - Preserve the object's original storage class. This is only supported for transfers from Google Cloud Storage buckets.\n            - Set the storage class to STANDARD.\n            - Set the storage class to NEARLINE.\n            - Set the storage class to COLDLINE.\n            - Set the storage class to ARCHIVE.\n          type: string\n        symlink:\n          description: Specifies how symlinks should be handled by the transfer. By default, symlinks are not preserved. Only applicable to transfers involving POSIX file systems, and ignored for other transfers.\n          enum:\n            - SYMLINK_UNSPECIFIED\n            - SYMLINK_SKIP\n            - SYMLINK_PRESERVE\n          enumDescriptions:\n            - Symlink behavior is unspecified.\n            - Do not preserve symlinks during a transfer job.\n            - Preserve symlinks during a transfer job.\n          type: string\n        temporaryHold:\n          description: Specifies how each object's temporary hold status should be preserved for transfers between Google Cloud Storage buckets. If unspecified, the default behavior is the same as TEMPORARY_HOLD_PRESERVE.\n          enum:\n            - TEMPORARY_HOLD_UNSPECIFIED\n            - TEMPORARY_HOLD_SKIP\n            - TEMPORARY_HOLD_PRESERVE\n          enumDescriptions:\n            - Temporary hold behavior is unspecified.\n            - Do not set a temporary hold on the destination object.\n            - Preserve the object's original temporary hold status.\n          type: string\n        timeCreated:\n          description: Specifies how each object's `timeCreated` metadata is preserved for transfers between Google Cloud Storage buckets. If unspecified, the default behavior is the same as TIME_CREATED_SKIP.\n          enum:\n            - TIME_CREATED_UNSPECIFIED\n            - TIME_CREATED_SKIP\n            - TIME_CREATED_PRESERVE_AS_CUSTOM_TIME\n          enumDescriptions:\n            - TimeCreated behavior is unspecified.\n            - Do not preserve the `timeCreated` metadata from the source object.\n            - Preserves the source object's `timeCreated` metadata in the `customTime` field in the destination object. Note that any value stored in the source object's `customTime` field will not be propagated to the destination object.\n          type: string\n        uid:\n          description: Specifies how each file's POSIX user ID (UID) attribute should be handled by the transfer. By default, UID is not preserved. Only applicable to transfers involving POSIX file systems, and ignored for other transfers.\n          enum:\n            - UID_UNSPECIFIED\n            - UID_SKIP\n            - UID_NUMBER\n          enumDescriptions:\n            - UID behavior is unspecified.\n            - Do not preserve UID during a transfer job.\n            - Preserve UID during a transfer job.\n          type: string\n      type: object\n    NotificationConfig:\n      description: 'Specification to configure notifications published to Pub/Sub. Notifications are published to the customer-provided topic using the following `PubsubMessage.attributes`: * `\"eventType\"`: one of the EventType values * `\"payloadFormat\"`: one of the PayloadFormat values * `\"projectId\"`: the project_id of the `TransferOperation` * `\"transferJobName\"`: the transfer_job_name of the `TransferOperation` * `\"transferOperationName\"`: the name of the `TransferOperation` The `PubsubMessage.data` contains a TransferOperation resource formatted according to the specified `PayloadFormat`.'\n      id: NotificationConfig\n      properties:\n        eventTypes:\n          description: Event types for which a notification is desired. If empty, send notifications for all event types.\n          items:\n            enum:\n              - EVENT_TYPE_UNSPECIFIED\n              - TRANSFER_OPERATION_SUCCESS\n              - TRANSFER_OPERATION_FAILED\n              - TRANSFER_OPERATION_ABORTED\n            enumDescriptions:\n              - Illegal value, to avoid allowing a default.\n              - '`TransferOperation` completed with status SUCCESS.'\n              - '`TransferOperation` completed with status FAILED.'\n              - '`TransferOperation` completed with status ABORTED.'\n            type: string\n          type: array\n        payloadFormat:\n          description: Required. The desired format of the notification message payloads.\n          enum:\n            - PAYLOAD_FORMAT_UNSPECIFIED\n            - NONE\n            - JSON\n          enumDescriptions:\n            - Illegal value, to avoid allowing a default.\n            - No payload is included with the notification.\n            - '`TransferOperation` is [formatted as a JSON response](https://developers.google.com/protocol-buffers/docs/proto3#json), in application/json.'\n          type: string\n        pubsubTopic:\n          description: 'Required. The `Topic.name` of the Pub/Sub topic to which to publish notifications. Must be of the format: `projects/{project}/topics/{topic}`. Not matching this format results in an INVALID_ARGUMENT error.'\n          type: string\n      type: object\n    ObjectConditions:\n      description: Conditions that determine which objects are transferred. Applies only to Cloud Data Sources such as S3, Azure, and Cloud Storage. The \"last modification time\" refers to the time of the last change to the object's content or metadata — specifically, this is the `updated` property of Cloud Storage objects, the `LastModified` field of S3 objects, and the `Last-Modified` header of Azure blobs. Transfers with a PosixFilesystem source or destination don't support `ObjectConditions`.\n      id: ObjectConditions\n      properties:\n        excludePrefixes:\n          description: 'If you specify `exclude_prefixes`, Storage Transfer Service uses the items in the `exclude_prefixes` array to determine which objects to exclude from a transfer. Objects must not start with one of the matching `exclude_prefixes` for inclusion in a transfer. The following are requirements of `exclude_prefixes`: * Each exclude-prefix can contain any sequence of Unicode characters, to a max length of 1024 bytes when UTF8-encoded, and must not contain Carriage Return or Line Feed characters. Wildcard matching and regular expression matching are not supported. * Each exclude-prefix must omit the leading slash. For example, to exclude the object `s3://my-aws-bucket/logs/y=2015/requests.gz`, specify the exclude-prefix as `logs/y=2015/requests.gz`. * None of the exclude-prefix values can be empty, if specified. * Each exclude-prefix must exclude a distinct portion of the object namespace. No exclude-prefix may be a prefix of another exclude-prefix. * If include_prefixes is specified, then each exclude-prefix must start with the value of a path explicitly included by `include_prefixes`. The max size of `exclude_prefixes` is 1000. For more information, see [Filtering objects from transfers](/storage-transfer/docs/filtering-objects-from-transfers).'\n          items:\n            type: string\n          type: array\n        includePrefixes:\n          description: 'If you specify `include_prefixes`, Storage Transfer Service uses the items in the `include_prefixes` array to determine which objects to include in a transfer. Objects must start with one of the matching `include_prefixes` for inclusion in the transfer. If exclude_prefixes is specified, objects must not start with any of the `exclude_prefixes` specified for inclusion in the transfer. The following are requirements of `include_prefixes`: * Each include-prefix can contain any sequence of Unicode characters, to a max length of 1024 bytes when UTF8-encoded, and must not contain Carriage Return or Line Feed characters. Wildcard matching and regular expression matching are not supported. * Each include-prefix must omit the leading slash. For example, to include the object `s3://my-aws-bucket/logs/y=2015/requests.gz`, specify the include-prefix as `logs/y=2015/requests.gz`. * None of the include-prefix values can be empty, if specified. * Each include-prefix must include a distinct portion of the object namespace. No include-prefix may be a prefix of another include-prefix. The max size of `include_prefixes` is 1000. For more information, see [Filtering objects from transfers](/storage-transfer/docs/filtering-objects-from-transfers).'\n          items:\n            type: string\n          type: array\n        lastModifiedBefore:\n          description: If specified, only objects with a \"last modification time\" before this timestamp and objects that don't have a \"last modification time\" are transferred.\n          format: google-datetime\n          type: string\n        lastModifiedSince:\n          description: 'If specified, only objects with a \"last modification time\" on or after this timestamp and objects that don''t have a \"last modification time\" are transferred. The `last_modified_since` and `last_modified_before` fields can be used together for chunked data processing. For example, consider a script that processes each day''s worth of data at a time. For that you''d set each of the fields as follows: * `last_modified_since` to the start of the day * `last_modified_before` to the end of the day'\n          format: google-datetime\n          type: string\n        maxTimeElapsedSinceLastModification:\n          description: Ensures that objects are not transferred if a specific maximum time has elapsed since the \"last modification time\". When a TransferOperation begins, objects with a \"last modification time\" are transferred only if the elapsed time between the start_time of the `TransferOperation`and the \"last modification time\" of the object is less than the value of max_time_elapsed_since_last_modification`. Objects that do not have a \"last modification time\" are also transferred.\n          format: google-duration\n          type: string\n        minTimeElapsedSinceLastModification:\n          description: Ensures that objects are not transferred until a specific minimum time has elapsed after the \"last modification time\". When a TransferOperation begins, objects with a \"last modification time\" are transferred only if the elapsed time between the start_time of the `TransferOperation` and the \"last modification time\" of the object is equal to or greater than the value of min_time_elapsed_since_last_modification`. Objects that do not have a \"last modification time\" are also transferred.\n          format: google-duration\n          type: string\n      type: object\n    Operation:\n      description: This resource represents a long-running operation that is the result of a network API call.\n      id: Operation\n      properties:\n        done:\n          description: If the value is `false`, it means the operation is still in progress. If `true`, the operation is completed, and either `error` or `response` is available.\n          type: boolean\n        error:\n          $ref: '#/components/schemas/Status'\n          description: The error result of the operation in case of failure or cancellation.\n        metadata:\n          additionalProperties:\n            description: Properties of the object. Contains field @type with type URL.\n            type: any\n          description: Represents the transfer operation object. To request a TransferOperation object, use transferOperations.get.\n          type: object\n        name:\n          description: The server-assigned unique name. The format of `name` is `transferOperations/some/unique/name`.\n          type: string\n        response:\n          additionalProperties:\n            description: Properties of the object. Contains field @type with type URL.\n            type: any\n          description: The normal response of the operation in case of success. If the original method returns no data on success, such as `Delete`, the response is `google.protobuf.Empty`. If the original method is standard `Get`/`Create`/`Update`, the response should be the resource. For other methods, the response should have the type `XxxResponse`, where `Xxx` is the original method name. For example, if the original method name is `TakeSnapshot()`, the inferred response type is `TakeSnapshotResponse`.\n          type: object\n      type: object\n    PauseTransferOperationRequest:\n      description: Request passed to PauseTransferOperation.\n      id: PauseTransferOperationRequest\n      properties: {}\n      type: object\n    PosixFilesystem:\n      description: A POSIX filesystem resource.\n      id: PosixFilesystem\n      properties:\n        rootDirectory:\n          description: Root directory path to the filesystem.\n          type: string\n      type: object\n    ResumeTransferOperationRequest:\n      description: Request passed to ResumeTransferOperation.\n      id: ResumeTransferOperationRequest\n      properties: {}\n      type: object\n    RunTransferJobRequest:\n      description: Request passed to RunTransferJob.\n      id: RunTransferJobRequest\n      properties:\n        projectId:\n          description: Required. The ID of the Google Cloud project that owns the transfer job.\n          type: string\n      type: object\n    Schedule:\n      description: Transfers can be scheduled to recur or to run just once.\n      id: Schedule\n      properties:\n        endTimeOfDay:\n          $ref: '#/components/schemas/TimeOfDay'\n          description: 'The time in UTC that no further transfer operations are scheduled. Combined with schedule_end_date, `end_time_of_day` specifies the end date and time for starting new transfer operations. This field must be greater than or equal to the timestamp corresponding to the combintation of schedule_start_date and start_time_of_day, and is subject to the following: * If `end_time_of_day` is not set and `schedule_end_date` is set, then a default value of `23:59:59` is used for `end_time_of_day`. * If `end_time_of_day` is set and `schedule_end_date` is not set, then INVALID_ARGUMENT is returned.'\n        repeatInterval:\n          description: Interval between the start of each scheduled TransferOperation. If unspecified, the default value is 24 hours. This value may not be less than 1 hour.\n          format: google-duration\n          type: string\n        scheduleEndDate:\n          $ref: '#/components/schemas/Date'\n          description: 'The last day a transfer runs. Date boundaries are determined relative to UTC time. A job runs once per 24 hours within the following guidelines: * If `schedule_end_date` and schedule_start_date are the same and in the future relative to UTC, the transfer is executed only one time. * If `schedule_end_date` is later than `schedule_start_date` and `schedule_end_date` is in the future relative to UTC, the job runs each day at start_time_of_day through `schedule_end_date`.'\n        scheduleStartDate:\n          $ref: '#/components/schemas/Date'\n          description: Required. The start date of a transfer. Date boundaries are determined relative to UTC time. If `schedule_start_date` and start_time_of_day are in the past relative to the job's creation time, the transfer starts the day after you schedule the transfer request. **Note:** When starting jobs at or near midnight UTC it is possible that a job starts later than expected. For example, if you send an outbound request on June 1 one millisecond prior to midnight UTC and the Storage Transfer Service server receives the request on June 2, then it creates a TransferJob with `schedule_start_date` set to June 2 and a `start_time_of_day` set to midnight UTC. The first scheduled TransferOperation takes place on June 3 at midnight UTC.\n        startTimeOfDay:\n          $ref: '#/components/schemas/TimeOfDay'\n          description: 'The time in UTC that a transfer job is scheduled to run. Transfers may start later than this time. If `start_time_of_day` is not specified: * One-time transfers run immediately. * Recurring transfers run immediately, and each day at midnight UTC, through schedule_end_date. If `start_time_of_day` is specified: * One-time transfers run at the specified time. * Recurring transfers run at the specified time each day, through `schedule_end_date`.'\n      type: object\n    Status:\n      description: 'The `Status` type defines a logical error model that is suitable for different programming environments, including REST APIs and RPC APIs. It is used by [gRPC](https://github.com/grpc). Each `Status` message contains three pieces of data: error code, error message, and error details. You can find out more about this error model and how to work with it in the [API Design Guide](https://cloud.google.com/apis/design/errors).'\n      id: Status\n      properties:\n        code:\n          description: The status code, which should be an enum value of google.rpc.Code.\n          format: int32\n          type: integer\n        details:\n          description: A list of messages that carry the error details. There is a common set of message types for APIs to use.\n          items:\n            additionalProperties:\n              description: Properties of the object. Contains field @type with type URL.\n              type: any\n            type: object\n          type: array\n        message:\n          description: A developer-facing error message, which should be in English. Any user-facing error message should be localized and sent in the google.rpc.Status.details field, or localized by the client.\n          type: string\n      type: object\n    TimeOfDay:\n      description: Represents a time of day. The date and time zone are either not significant or are specified elsewhere. An API may choose to allow leap seconds. Related types are google.type.Date and `google.protobuf.Timestamp`.\n      id: TimeOfDay\n      properties:\n        hours:\n          description: Hours of day in 24 hour format. Should be from 0 to 23. An API may choose to allow the value \"24:00:00\" for scenarios like business closing time.\n          format: int32\n          type: integer\n        minutes:\n          description: Minutes of hour of day. Must be from 0 to 59.\n          format: int32\n          type: integer\n        nanos:\n          description: Fractions of seconds in nanoseconds. Must be from 0 to 999,999,999.\n          format: int32\n          type: integer\n        seconds:\n          description: Seconds of minutes of the time. Must normally be from 0 to 59. An API may allow the value 60 if it allows leap-seconds.\n          format: int32\n          type: integer\n      type: object\n    TransferCounters:\n      description: A collection of counters that report the progress of a transfer operation.\n      id: TransferCounters\n      properties:\n        bytesCopiedToSink:\n          description: Bytes that are copied to the data sink.\n          format: int64\n          type: string\n        bytesDeletedFromSink:\n          description: Bytes that are deleted from the data sink.\n          format: int64\n          type: string\n        bytesDeletedFromSource:\n          description: Bytes that are deleted from the data source.\n          format: int64\n          type: string\n        bytesFailedToDeleteFromSink:\n          description: Bytes that failed to be deleted from the data sink.\n          format: int64\n          type: string\n        bytesFoundFromSource:\n          description: Bytes found in the data source that are scheduled to be transferred, excluding any that are filtered based on object conditions or skipped due to sync.\n          format: int64\n          type: string\n        bytesFoundOnlyFromSink:\n          description: Bytes found only in the data sink that are scheduled to be deleted.\n          format: int64\n          type: string\n        bytesFromSourceFailed:\n          description: Bytes in the data source that failed to be transferred or that failed to be deleted after being transferred.\n          format: int64\n          type: string\n        bytesFromSourceSkippedBySync:\n          description: Bytes in the data source that are not transferred because they already exist in the data sink.\n          format: int64\n          type: string\n        directoriesFailedToListFromSource:\n          description: For transfers involving PosixFilesystem only. Number of listing failures for each directory found at the source. Potential failures when listing a directory include permission failure or block failure. If listing a directory fails, no files in the directory are transferred.\n          format: int64\n          type: string\n        directoriesFoundFromSource:\n          description: For transfers involving PosixFilesystem only. Number of directories found while listing. For example, if the root directory of the transfer is `base/` and there are two other directories, `a/` and `b/` under this directory, the count after listing `base/`, `base/a/` and `base/b/` is 3.\n          format: int64\n          type: string\n        directoriesSuccessfullyListedFromSource:\n          description: For transfers involving PosixFilesystem only. Number of successful listings for each directory found at the source.\n          format: int64\n          type: string\n        intermediateObjectsCleanedUp:\n          description: Number of successfully cleaned up intermediate objects.\n          format: int64\n          type: string\n        intermediateObjectsFailedCleanedUp:\n          description: Number of intermediate objects failed cleaned up.\n          format: int64\n          type: string\n        objectsCopiedToSink:\n          description: Objects that are copied to the data sink.\n          format: int64\n          type: string\n        objectsDeletedFromSink:\n          description: Objects that are deleted from the data sink.\n          format: int64\n          type: string\n        objectsDeletedFromSource:\n          description: Objects that are deleted from the data source.\n          format: int64\n          type: string\n        objectsFailedToDeleteFromSink:\n          description: Objects that failed to be deleted from the data sink.\n          format: int64\n          type: string\n        objectsFoundFromSource:\n          description: Objects found in the data source that are scheduled to be transferred, excluding any that are filtered based on object conditions or skipped due to sync.\n          format: int64\n          type: string\n        objectsFoundOnlyFromSink:\n          description: Objects found only in the data sink that are scheduled to be deleted.\n          format: int64\n          type: string\n        objectsFromSourceFailed:\n          description: Objects in the data source that failed to be transferred or that failed to be deleted after being transferred.\n          format: int64\n          type: string\n        objectsFromSourceSkippedBySync:\n          description: Objects in the data source that are not transferred because they already exist in the data sink.\n          format: int64\n          type: string\n      type: object\n    TransferJob:\n      description: This resource represents the configuration of a transfer job that runs periodically.\n      id: TransferJob\n      properties:\n        creationTime:\n          description: Output only. The time that the transfer job was created.\n          format: google-datetime\n          readOnly: true\n          type: string\n        deletionTime:\n          description: Output only. The time that the transfer job was deleted.\n          format: google-datetime\n          readOnly: true\n          type: string\n        description:\n          description: A description provided by the user for the job. Its max length is 1024 bytes when Unicode-encoded.\n          type: string\n        lastModificationTime:\n          description: Output only. The time that the transfer job was last modified.\n          format: google-datetime\n          readOnly: true\n          type: string\n        latestOperationName:\n          description: The name of the most recently started TransferOperation of this JobConfig. Present if a TransferOperation has been created for this JobConfig.\n          type: string\n        loggingConfig:\n          $ref: '#/components/schemas/LoggingConfig'\n          description: Logging configuration.\n        name:\n          description: 'A unique name (within the transfer project) assigned when the job is created. If this field is empty in a CreateTransferJobRequest, Storage Transfer Service assigns a unique name. Otherwise, the specified name is used as the unique name for this job. If the specified name is in use by a job, the creation request fails with an ALREADY_EXISTS error. This name must start with `\"transferJobs/\"` prefix and end with a letter or a number, and should be no more than 128 characters. For transfers involving PosixFilesystem, this name must start with `transferJobs/OPI` specifically. For all other transfer types, this name must not start with `transferJobs/OPI`. Non-PosixFilesystem example: `\"transferJobs/^(?!OPI)[A-Za-z0-9-._~]*[A-Za-z0-9]$\"` PosixFilesystem example: `\"transferJobs/OPI^[A-Za-z0-9-._~]*[A-Za-z0-9]$\"` Applications must not rely on the enforcement of naming requirements involving OPI. Invalid job names fail with an INVALID_ARGUMENT error.'\n          type: string\n        notificationConfig:\n          $ref: '#/components/schemas/NotificationConfig'\n          description: Notification configuration. This is not supported for transfers involving PosixFilesystem.\n        projectId:\n          description: The ID of the Google Cloud project that owns the job.\n          type: string\n        schedule:\n          $ref: '#/components/schemas/Schedule'\n          description: Specifies schedule for the transfer job. This is an optional field. When the field is not set, the job never executes a transfer, unless you invoke RunTransferJob or update the job to have a non-empty schedule.\n        status:\n          description: Status of the job. This value MUST be specified for `CreateTransferJobRequests`. **Note:** The effect of the new job status takes place during a subsequent job run. For example, if you change the job status from ENABLED to DISABLED, and an operation spawned by the transfer is running, the status change would not affect the current operation.\n          enum:\n            - STATUS_UNSPECIFIED\n            - ENABLED\n            - DISABLED\n            - DELETED\n          enumDescriptions:\n            - Zero is an illegal value.\n            - New transfers are performed based on the schedule.\n            - New transfers are not scheduled.\n            - This is a soft delete state. After a transfer job is set to this state, the job and all the transfer executions are subject to garbage collection. Transfer jobs become eligible for garbage collection 30 days after their status is set to `DELETED`.\n          type: string\n        transferSpec:\n          $ref: '#/components/schemas/TransferSpec'\n          description: Transfer specification.\n      type: object\n    TransferManifest:\n      description: Specifies where the manifest is located.\n      id: TransferManifest\n      properties:\n        location:\n          description: Specifies the path to the manifest in Cloud Storage. The Google-managed service account for the transfer must have `storage.objects.get` permission for this object. An example path is `gs://bucket_name/path/manifest.csv`.\n          type: string\n      type: object\n    TransferOperation:\n      description: A description of the execution of a transfer.\n      id: TransferOperation\n      properties:\n        counters:\n          $ref: '#/components/schemas/TransferCounters'\n          description: Information about the progress of the transfer operation.\n        endTime:\n          description: End time of this transfer execution.\n          format: google-datetime\n          type: string\n        errorBreakdowns:\n          description: Summarizes errors encountered with sample error log entries.\n          items:\n            $ref: '#/components/schemas/ErrorSummary'\n          type: array\n        name:\n          description: A globally unique ID assigned by the system.\n          type: string\n        notificationConfig:\n          $ref: '#/components/schemas/NotificationConfig'\n          description: Notification configuration.\n        projectId:\n          description: The ID of the Google Cloud project that owns the operation.\n          type: string\n        startTime:\n          description: Start time of this transfer execution.\n          format: google-datetime\n          type: string\n        status:\n          description: Status of the transfer operation.\n          enum:\n            - STATUS_UNSPECIFIED\n            - IN_PROGRESS\n            - PAUSED\n            - SUCCESS\n            - FAILED\n            - ABORTED\n            - QUEUED\n          enumDescriptions:\n            - Zero is an illegal value.\n            - In progress.\n            - Paused.\n            - Completed successfully.\n            - Terminated due to an unrecoverable failure.\n            - Aborted by the user.\n            - Temporarily delayed by the system. No user action is required.\n          type: string\n        transferJobName:\n          description: The name of the transfer job that triggers this transfer operation.\n          type: string\n        transferSpec:\n          $ref: '#/components/schemas/TransferSpec'\n          description: Transfer specification.\n      type: object\n    TransferOptions:\n      description: TransferOptions define the actions to be performed on objects in a transfer.\n      id: TransferOptions\n      properties:\n        deleteObjectsFromSourceAfterTransfer:\n          description: Whether objects should be deleted from the source after they are transferred to the sink. **Note:** This option and delete_objects_unique_in_sink are mutually exclusive.\n          type: boolean\n        deleteObjectsUniqueInSink:\n          description: Whether objects that exist only in the sink should be deleted. **Note:** This option and delete_objects_from_source_after_transfer are mutually exclusive.\n          type: boolean\n        metadataOptions:\n          $ref: '#/components/schemas/MetadataOptions'\n          description: Represents the selected metadata options for a transfer job. This feature is in Preview.\n        overwriteObjectsAlreadyExistingInSink:\n          description: When to overwrite objects that already exist in the sink. The default is that only objects that are different from the source are ovewritten. If true, all objects in the sink whose name matches an object in the source are overwritten with the source object.\n          type: boolean\n        overwriteWhen:\n          description: When to overwrite objects that already exist in the sink. If not set, overwrite behavior is determined by overwrite_objects_already_existing_in_sink.\n          enum:\n            - OVERWRITE_WHEN_UNSPECIFIED\n            - DIFFERENT\n            - NEVER\n            - ALWAYS\n          enumDescriptions:\n            - Overwrite behavior is unspecified.\n            - Overwrites destination objects with the source objects, only if the objects have the same name but different HTTP ETags or checksum values.\n            - Never overwrites a destination object if a source object has the same name. In this case, the source object is not transferred.\n            - Always overwrite the destination object with the source object, even if the HTTP Etags or checksum values are the same.\n          type: string\n      type: object\n    TransferSpec:\n      description: Configuration for running a transfer.\n      id: TransferSpec\n      properties:\n        awsS3DataSource:\n          $ref: '#/components/schemas/AwsS3Data'\n          description: An AWS S3 data source.\n        azureBlobStorageDataSource:\n          $ref: '#/components/schemas/AzureBlobStorageData'\n          description: An Azure Blob Storage data source.\n        gcsDataSink:\n          $ref: '#/components/schemas/GcsData'\n          description: A Cloud Storage data sink.\n        gcsDataSource:\n          $ref: '#/components/schemas/GcsData'\n          description: A Cloud Storage data source.\n        gcsIntermediateDataLocation:\n          $ref: '#/components/schemas/GcsData'\n          description: Cloud Storage intermediate data location.\n        httpDataSource:\n          $ref: '#/components/schemas/HttpData'\n          description: An HTTP URL data source.\n        objectConditions:\n          $ref: '#/components/schemas/ObjectConditions'\n          description: Only objects that satisfy these object conditions are included in the set of data source and data sink objects. Object conditions based on objects' \"last modification time\" do not exclude objects in a data sink.\n        posixDataSink:\n          $ref: '#/components/schemas/PosixFilesystem'\n          description: A POSIX Filesystem data sink.\n        posixDataSource:\n          $ref: '#/components/schemas/PosixFilesystem'\n          description: A POSIX Filesystem data source.\n        sinkAgentPoolName:\n          description: Specifies the agent pool name associated with the posix data sink. When unspecified, the default name is used.\n          type: string\n        sourceAgentPoolName:\n          description: Specifies the agent pool name associated with the posix data source. When unspecified, the default name is used.\n          type: string\n        transferManifest:\n          $ref: '#/components/schemas/TransferManifest'\n          description: A manifest file provides a list of objects to be transferred from the data source. This field points to the location of the manifest file. Otherwise, the entire source bucket is used. ObjectConditions still apply.\n        transferOptions:\n          $ref: '#/components/schemas/TransferOptions'\n          description: If the option delete_objects_unique_in_sink is `true` and time-based object conditions such as 'last modification time' are specified, the request fails with an INVALID_ARGUMENT error.\n      type: object\n    UpdateTransferJobRequest:\n      description: Request passed to UpdateTransferJob.\n      id: UpdateTransferJobRequest\n      properties:\n        projectId:\n          description: Required. The ID of the Google Cloud project that owns the job.\n          type: string\n        transferJob:\n          $ref: '#/components/schemas/TransferJob'\n          description: 'Required. The job to update. `transferJob` is expected to specify one or more of five fields: description, transfer_spec, notification_config, logging_config, and status. An `UpdateTransferJobRequest` that specifies other fields are rejected with the error INVALID_ARGUMENT. Updating a job status to DELETED requires `storagetransfer.jobs.delete` permissions.'\n        updateTransferJobFieldMask:\n          description: 'The field mask of the fields in `transferJob` that are to be updated in this request. Fields in `transferJob` that can be updated are: description, transfer_spec, notification_config, logging_config, and status. To update the `transfer_spec` of the job, a complete transfer specification must be provided. An incomplete specification missing any required fields is rejected with the error INVALID_ARGUMENT.'\n          format: google-fieldmask\n          type: string\n      type: object\n  securitySchemes:\n    Oauth2:\n      description: Oauth 2.0 implicit authentication\n      flows:\n        implicit:\n          authorizationUrl: https://accounts.google.com/o/oauth2/auth\n          scopes:\n            https://www.googleapis.com/auth/cloud-platform: See, edit, configure, and delete your Google Cloud data and see the email address for your Google Account.\n      type: oauth2\n    Oauth2c:\n      description: Oauth 2.0 authorization code authentication\n      flows:\n        authorizationCode:\n          authorizationUrl: https://accounts.google.com/o/oauth2/auth\n          scopes:\n            https://www.googleapis.com/auth/cloud-platform: See, edit, configure, and delete your Google Cloud data and see the email address for your Google Account.\n          tokenUrl: https://accounts.google.com/o/oauth2/token\n      type: oauth2\n  x-stackQL-resources:\n    google_service_accounts:\n      id: google.storagetransfer.google_service_accounts\n      name: google_service_accounts\n      title: Google_service_accounts\n      methods:\n        googleServiceAccounts_get:\n          operation:\n            $ref: '#/paths/~1v1~1googleServiceAccounts~1{projectId}/get'\n          response:\n            mediaType: application/json\n            openAPIDocKey: '200'\n      sqlVerbs:\n        select:\n          - $ref: '#/components/x-stackQL-resources/google_service_accounts/methods/googleServiceAccounts_get'\n        insert: []\n        update: []\n        delete: []\n    agent_pools:\n      id: google.storagetransfer.agent_pools\n      name: agent_pools\n      title: Agent_pools\n      methods:\n        projects_agentPools_list:\n          operation:\n            $ref: '#/paths/~1v1~1projects~1{projectsId}~1agentPools/get'\n          response:\n            mediaType: application/json\n            openAPIDocKey: '200'\n            objectKey: agentPools\n        projects_agentPools_create:\n          operation:\n            $ref: '#/paths/~1v1~1projects~1{projectsId}~1agentPools/post'\n          response:\n            mediaType: application/json\n            openAPIDocKey: '200'\n        projects_agentPools_delete:\n          operation:\n            $ref: '#/paths/~1v1~1projects~1{projectsId}~1agentPools~1{agentPoolsId}/delete'\n          response:\n            mediaType: application/json\n            openAPIDocKey: '200'\n        projects_agentPools_get:\n          operation:\n            $ref: '#/paths/~1v1~1projects~1{projectsId}~1agentPools~1{agentPoolsId}/get'\n          response:\n            mediaType: application/json\n            openAPIDocKey: '200'\n        projects_agentPools_patch:\n          operation:\n            $ref: '#/paths/~1v1~1projects~1{projectsId}~1agentPools~1{agentPoolsId}/patch'\n          response:\n            mediaType: application/json\n            openAPIDocKey: '200'\n      sqlVerbs:\n        select:\n          - $ref: '#/components/x-stackQL-resources/agent_pools/methods/projects_agentPools_get'\n          - $ref: '#/components/x-stackQL-resources/agent_pools/methods/projects_agentPools_list'\n        insert:\n          - $ref: '#/components/x-stackQL-resources/agent_pools/methods/projects_agentPools_create'\n        update: []\n        delete:\n          - $ref: '#/components/x-stackQL-resources/agent_pools/methods/projects_agentPools_delete'\n    transfer_jobs:\n      id: google.storagetransfer.transfer_jobs\n      name: transfer_jobs\n      title: Transfer_jobs\n      methods:\n        transferJobs_list:\n          operation:\n            $ref: '#/paths/~1v1~1transferJobs/get'\n          response:\n            mediaType: application/json\n            openAPIDocKey: '200'\n            objectKey: transferJobs\n        transferJobs_create:\n          operation:\n            $ref: '#/paths/~1v1~1transferJobs/post'\n          response:\n            mediaType: application/json\n            openAPIDocKey: '200'\n        transferJobs_get:\n          operation:\n            $ref: '#/paths/~1v1~1transferJobs~1{transferJobsId}/get'\n          response:\n            mediaType: application/json\n            openAPIDocKey: '200'\n        transferJobs_patch:\n          operation:\n            $ref: '#/paths/~1v1~1transferJobs~1{transferJobsId}/patch'\n          response:\n            mediaType: application/json\n            openAPIDocKey: '200'\n        transferJobs_run:\n          operation:\n            $ref: '#/paths/~1v1~1transferJobs~1{transferJobsId}:run/post'\n          response:\n            mediaType: application/json\n            openAPIDocKey: '200'\n      sqlVerbs:\n        select:\n          - $ref: '#/components/x-stackQL-resources/transfer_jobs/methods/transferJobs_get'\n          - $ref: '#/components/x-stackQL-resources/transfer_jobs/methods/transferJobs_list'\n        insert:\n          - $ref: '#/components/x-stackQL-resources/transfer_jobs/methods/transferJobs_create'\n        update: []\n        delete: []\n    transfer_operations:\n      id: google.storagetransfer.transfer_operations\n      name: transfer_operations\n      title: Transfer_operations\n      methods:\n        transferOperations_list:\n          operation:\n            $ref: '#/paths/~1v1~1transferOperations/get'\n          response:\n            mediaType: application/json\n            openAPIDocKey: '200'\n            objectKey: operations\n        transferOperations_get:\n          operation:\n            $ref: '#/paths/~1v1~1transferOperations~1{transferOperationsId}/get'\n          response:\n            mediaType: application/json\n            openAPIDocKey: '200'\n        transferOperations_cancel:\n          operation:\n            $ref: '#/paths/~1v1~1transferOperations~1{transferOperationsId}:cancel/post'\n          response:\n            mediaType: application/json\n            openAPIDocKey: '200'\n        transferOperations_pause:\n          operation:\n            $ref: '#/paths/~1v1~1transferOperations~1{transferOperationsId}:pause/post'\n          response:\n            mediaType: application/json\n            openAPIDocKey: '200'\n        transferOperations_resume:\n          operation:\n            $ref: '#/paths/~1v1~1transferOperations~1{transferOperationsId}:resume/post'\n          response:\n            mediaType: application/json\n            openAPIDocKey: '200'\n      sqlVerbs:\n        select:\n          - $ref: '#/components/x-stackQL-resources/transfer_operations/methods/transferOperations_get'\n          - $ref: '#/components/x-stackQL-resources/transfer_operations/methods/transferOperations_list'\n        insert: []\n        update: []\n        delete: []\nexternalDocs:\n  url: https://cloud.google.com/storage-transfer/docs\ninfo:\n  description: 'Transfers data from external data sources to a Google Cloud Storage bucket or between Google Cloud Storage buckets. '\n  title: Storage Transfer API\n  version: v1\nopenapi: 3.1.0\npaths:\n  /v1/googleServiceAccounts/{projectId}:\n    get:\n      description: Returns the Google service account that is used by Storage Transfer Service to access buckets in the project where transfers run or in other projects. Each Google service account is associated with one Google Cloud project. Users should add this service account to the Google Cloud Storage bucket ACLs to grant access to Storage Transfer Service. This service account is created and owned by Storage Transfer Service and can only be used by Storage Transfer Service.\n      operationId: storagetransfer.googleServiceAccounts.get\n      parameters:\n        - in: path\n          name: projectId\n          required: true\n          schema:\n            type: string\n      responses:\n        '200':\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/GoogleServiceAccount'\n          description: Successful response\n      security:\n        - Oauth2:\n            - https://www.googleapis.com/auth/cloud-platform\n          Oauth2c:\n            - https://www.googleapis.com/auth/cloud-platform\n      tags:\n        - google_service_accounts\n    parameters:\n      - $ref: '#/components/parameters/callback'\n      - $ref: '#/components/parameters/quotaUser'\n      - $ref: '#/components/parameters/_.xgafv'\n      - $ref: '#/components/parameters/alt'\n      - $ref: '#/components/parameters/key'\n      - $ref: '#/components/parameters/upload_protocol'\n      - $ref: '#/components/parameters/oauth_token'\n      - $ref: '#/components/parameters/fields'\n      - $ref: '#/components/parameters/access_token'\n      - $ref: '#/components/parameters/prettyPrint'\n      - $ref: '#/components/parameters/uploadType'\n  /v1/projects/{projectsId}/agentPools:\n    get:\n      description: Lists agent pools.\n      operationId: storagetransfer.projects.agentPools.list\n      parameters:\n        - in: path\n          name: projectsId\n          required: true\n          schema:\n            type: string\n        - in: query\n          name: pageSize\n          schema:\n            type: integer\n        - in: query\n          name: pageToken\n          schema:\n            type: string\n        - in: query\n          name: filter\n          schema:\n            type: string\n      responses:\n        '200':\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/ListAgentPoolsResponse'\n          description: Successful response\n      security:\n        - Oauth2:\n            - https://www.googleapis.com/auth/cloud-platform\n          Oauth2c:\n            - https://www.googleapis.com/auth/cloud-platform\n      tags:\n        - agent_pools\n    parameters:\n      - $ref: '#/components/parameters/callback'\n      - $ref: '#/components/parameters/quotaUser'\n      - $ref: '#/components/parameters/_.xgafv'\n      - $ref: '#/components/parameters/alt'\n      - $ref: '#/components/parameters/key'\n      - $ref: '#/components/parameters/upload_protocol'\n      - $ref: '#/components/parameters/oauth_token'\n      - $ref: '#/components/parameters/fields'\n      - $ref: '#/components/parameters/access_token'\n      - $ref: '#/components/parameters/prettyPrint'\n      - $ref: '#/components/parameters/uploadType'\n    post:\n      description: Creates an agent pool resource.\n      operationId: storagetransfer.projects.agentPools.create\n      parameters:\n        - in: path\n          name: projectsId\n          required: true\n          schema:\n            type: string\n        - in: query\n          name: agentPoolId\n          schema:\n            type: string\n      requestBody:\n        content:\n          application/json:\n            schema:\n              $ref: '#/components/schemas/AgentPool'\n      responses:\n        '200':\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/AgentPool'\n          description: Successful response\n      security:\n        - Oauth2:\n            - https://www.googleapis.com/auth/cloud-platform\n          Oauth2c:\n            - https://www.googleapis.com/auth/cloud-platform\n      tags:\n        - agent_pools\n  /v1/projects/{projectsId}/agentPools/{agentPoolsId}:\n    delete:\n      description: Deletes an agent pool.\n      operationId: storagetransfer.projects.agentPools.delete\n      parameters:\n        - in: path\n          name: projectsId\n          required: true\n          schema:\n            type: string\n        - in: path\n          name: agentPoolsId\n          required: true\n          schema:\n            type: string\n      responses:\n        '200':\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/Empty'\n          description: Successful response\n      security:\n        - Oauth2:\n            - https://www.googleapis.com/auth/cloud-platform\n          Oauth2c:\n            - https://www.googleapis.com/auth/cloud-platform\n      tags:\n        - agent_pools\n    get:\n      description: Gets an agent pool.\n      operationId: storagetransfer.projects.agentPools.get\n      parameters:\n        - in: path\n          name: projectsId\n          required: true\n          schema:\n            type: string\n        - in: path\n          name: agentPoolsId\n          required: true\n          schema:\n            type: string\n      responses:\n        '200':\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/AgentPool'\n          description: Successful response\n      security:\n        - Oauth2:\n            - https://www.googleapis.com/auth/cloud-platform\n          Oauth2c:\n            - https://www.googleapis.com/auth/cloud-platform\n      tags:\n        - agent_pools\n    parameters:\n      - $ref: '#/components/parameters/callback'\n      - $ref: '#/components/parameters/quotaUser'\n      - $ref: '#/components/parameters/_.xgafv'\n      - $ref: '#/components/parameters/alt'\n      - $ref: '#/components/parameters/key'\n      - $ref: '#/components/parameters/upload_protocol'\n      - $ref: '#/components/parameters/oauth_token'\n      - $ref: '#/components/parameters/fields'\n      - $ref: '#/components/parameters/access_token'\n      - $ref: '#/components/parameters/prettyPrint'\n      - $ref: '#/components/parameters/uploadType'\n    patch:\n      description: Updates an existing agent pool resource.\n      operationId: storagetransfer.projects.agentPools.patch\n      parameters:\n        - in: path\n          name: projectsId\n          required: true\n          schema:\n            type: string\n        - in: path\n          name: agentPoolsId\n          required: true\n          schema:\n            type: string\n        - in: query\n          name: updateMask\n          schema:\n            type: string\n      requestBody:\n        content:\n          application/json:\n            schema:\n              $ref: '#/components/schemas/AgentPool'\n      responses:\n        '200':\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/AgentPool'\n          description: Successful response\n      security:\n        - Oauth2:\n            - https://www.googleapis.com/auth/cloud-platform\n          Oauth2c:\n            - https://www.googleapis.com/auth/cloud-platform\n      tags:\n        - agent_pools\n  /v1/transferJobs:\n    get:\n      description: Lists transfer jobs.\n      operationId: storagetransfer.transferJobs.list\n      parameters:\n        - in: query\n          name: filter\n          required: true\n          schema:\n            type: string\n        - in: query\n          name: pageToken\n          schema:\n            type: string\n        - in: query\n          name: pageSize\n          schema:\n            type: integer\n      responses:\n        '200':\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/ListTransferJobsResponse'\n          description: Successful response\n      security:\n        - Oauth2:\n            - https://www.googleapis.com/auth/cloud-platform\n          Oauth2c:\n            - https://www.googleapis.com/auth/cloud-platform\n      tags:\n        - transfer_jobs\n    parameters:\n      - $ref: '#/components/parameters/callback'\n      - $ref: '#/components/parameters/quotaUser'\n      - $ref: '#/components/parameters/_.xgafv'\n      - $ref: '#/components/parameters/alt'\n      - $ref: '#/components/parameters/key'\n      - $ref: '#/components/parameters/upload_protocol'\n      - $ref: '#/components/parameters/oauth_token'\n      - $ref: '#/components/parameters/fields'\n      - $ref: '#/components/parameters/access_token'\n      - $ref: '#/components/parameters/prettyPrint'\n      - $ref: '#/components/parameters/uploadType'\n    post:\n      description: Creates a transfer job that runs periodically.\n      operationId: storagetransfer.transferJobs.create\n      parameters: []\n      requestBody:\n        content:\n          application/json:\n            schema:\n              $ref: '#/components/schemas/TransferJob'\n      responses:\n        '200':\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/TransferJob'\n          description: Successful response\n      security:\n        - Oauth2:\n            - https://www.googleapis.com/auth/cloud-platform\n          Oauth2c:\n            - https://www.googleapis.com/auth/cloud-platform\n      tags:\n        - transfer_jobs\n  /v1/transferJobs/{transferJobsId}:\n    get:\n      description: Gets a transfer job.\n      operationId: storagetransfer.transferJobs.get\n      parameters:\n        - in: path\n          name: transferJobsId\n          required: true\n          schema:\n            type: string\n        - in: query\n          name: projectId\n          required: true\n          schema:\n            type: string\n      responses:\n        '200':\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/TransferJob'\n          description: Successful response\n      security:\n        - Oauth2:\n            - https://www.googleapis.com/auth/cloud-platform\n          Oauth2c:\n            - https://www.googleapis.com/auth/cloud-platform\n      tags:\n        - transfer_jobs\n    parameters:\n      - $ref: '#/components/parameters/callback'\n      - $ref: '#/components/parameters/quotaUser'\n      - $ref: '#/components/parameters/_.xgafv'\n      - $ref: '#/components/parameters/alt'\n      - $ref: '#/components/parameters/key'\n      - $ref: '#/components/parameters/upload_protocol'\n      - $ref: '#/components/parameters/oauth_token'\n      - $ref: '#/components/parameters/fields'\n      - $ref: '#/components/parameters/access_token'\n      - $ref: '#/components/parameters/prettyPrint'\n      - $ref: '#/components/parameters/uploadType'\n    patch:\n      description: Updates a transfer job. Updating a job's transfer spec does not affect transfer operations that are running already. **Note:** The job's status field can be modified using this RPC (for example, to set a job's status to DELETED, DISABLED, or ENABLED).\n      operationId: storagetransfer.transferJobs.patch\n      parameters:\n        - in: path\n          name: transferJobsId\n          required: true\n          schema:\n            type: string\n      requestBody:\n        content:\n          application/json:\n            schema:\n              $ref: '#/components/schemas/UpdateTransferJobRequest'\n      responses:\n        '200':\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/TransferJob'\n          description: Successful response\n      security:\n        - Oauth2:\n            - https://www.googleapis.com/auth/cloud-platform\n          Oauth2c:\n            - https://www.googleapis.com/auth/cloud-platform\n      tags:\n        - transfer_jobs\n  /v1/transferJobs/{transferJobsId}:run:\n    parameters:\n      - $ref: '#/components/parameters/callback'\n      - $ref: '#/components/parameters/quotaUser'\n      - $ref: '#/components/parameters/_.xgafv'\n      - $ref: '#/components/parameters/alt'\n      - $ref: '#/components/parameters/key'\n      - $ref: '#/components/parameters/upload_protocol'\n      - $ref: '#/components/parameters/oauth_token'\n      - $ref: '#/components/parameters/fields'\n      - $ref: '#/components/parameters/access_token'\n      - $ref: '#/components/parameters/prettyPrint'\n      - $ref: '#/components/parameters/uploadType'\n    post:\n      description: Attempts to start a new TransferOperation for the current TransferJob. A TransferJob has a maximum of one active TransferOperation. If this method is called while a TransferOperation is active, an error will be returned.\n      operationId: storagetransfer.transferJobs.run\n      parameters:\n        - in: path\n          name: transferJobsId:run\n          required: true\n          schema:\n            type: string\n      requestBody:\n        content:\n          application/json:\n            schema:\n              $ref: '#/components/schemas/RunTransferJobRequest'\n      responses:\n        '200':\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/Operation'\n          description: Successful response\n      security:\n        - Oauth2:\n            - https://www.googleapis.com/auth/cloud-platform\n          Oauth2c:\n            - https://www.googleapis.com/auth/cloud-platform\n      tags:\n        - transfer_jobs\n  /v1/transferOperations:\n    get:\n      description: Lists transfer operations. Operations are ordered by their creation time in reverse chronological order.\n      operationId: storagetransfer.transferOperations.list\n      parameters:\n        - in: query\n          name: filter\n          required: true\n          schema:\n            type: string\n        - in: query\n          name: pageSize\n          schema:\n            type: integer\n        - in: query\n          name: pageToken\n          schema:\n            type: string\n      responses:\n        '200':\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/ListOperationsResponse'\n          description: Successful response\n      security:\n        - Oauth2:\n            - https://www.googleapis.com/auth/cloud-platform\n          Oauth2c:\n            - https://www.googleapis.com/auth/cloud-platform\n      tags:\n        - transfer_operations\n    parameters:\n      - $ref: '#/components/parameters/callback'\n      - $ref: '#/components/parameters/quotaUser'\n      - $ref: '#/components/parameters/_.xgafv'\n      - $ref: '#/components/parameters/alt'\n      - $ref: '#/components/parameters/key'\n      - $ref: '#/components/parameters/upload_protocol'\n      - $ref: '#/components/parameters/oauth_token'\n      - $ref: '#/components/parameters/fields'\n      - $ref: '#/components/parameters/access_token'\n      - $ref: '#/components/parameters/prettyPrint'\n      - $ref: '#/components/parameters/uploadType'\n  /v1/transferOperations/{transferOperationsId}:\n    get:\n      description: Gets the latest state of a long-running operation. Clients can use this method to poll the operation result at intervals as recommended by the API service.\n      operationId: storagetransfer.transferOperations.get\n      parameters:\n        - in: path\n          name: transferOperationsId\n          required: true\n          schema:\n            type: string\n      responses:\n        '200':\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/Operation'\n          description: Successful response\n      security:\n        - Oauth2:\n            - https://www.googleapis.com/auth/cloud-platform\n          Oauth2c:\n            - https://www.googleapis.com/auth/cloud-platform\n      tags:\n        - transfer_operations\n    parameters:\n      - $ref: '#/components/parameters/callback'\n      - $ref: '#/components/parameters/quotaUser'\n      - $ref: '#/components/parameters/_.xgafv'\n      - $ref: '#/components/parameters/alt'\n      - $ref: '#/components/parameters/key'\n      - $ref: '#/components/parameters/upload_protocol'\n      - $ref: '#/components/parameters/oauth_token'\n      - $ref: '#/components/parameters/fields'\n      - $ref: '#/components/parameters/access_token'\n      - $ref: '#/components/parameters/prettyPrint'\n      - $ref: '#/components/parameters/uploadType'\n  /v1/transferOperations/{transferOperationsId}:cancel:\n    parameters:\n      - $ref: '#/components/parameters/callback'\n      - $ref: '#/components/parameters/quotaUser'\n      - $ref: '#/components/parameters/_.xgafv'\n      - $ref: '#/components/parameters/alt'\n      - $ref: '#/components/parameters/key'\n      - $ref: '#/components/parameters/upload_protocol'\n      - $ref: '#/components/parameters/oauth_token'\n      - $ref: '#/components/parameters/fields'\n      - $ref: '#/components/parameters/access_token'\n      - $ref: '#/components/parameters/prettyPrint'\n      - $ref: '#/components/parameters/uploadType'\n    post:\n      description: Cancels a transfer. Use the transferOperations.get method to check if the cancellation succeeded or if the operation completed despite the `cancel` request. When you cancel an operation, the currently running transfer is interrupted. For recurring transfer jobs, the next instance of the transfer job will still run. For example, if your job is configured to run every day at 1pm and you cancel Monday's operation at 1:05pm, Monday's transfer will stop. However, a transfer job will still be attempted on Tuesday. This applies only to currently running operations. If an operation is not currently running, `cancel` does nothing. *Caution:* Canceling a transfer job can leave your data in an unknown state. We recommend that you restore the state at both the destination and the source after the `cancel` request completes so that your data is in a consistent state. When you cancel a job, the next job computes a delta of files and may repair any inconsistent state. For instance, if you run a job every day, and today's job found 10 new files and transferred five files before you canceled the job, tomorrow's transfer operation will compute a new delta with the five files that were not copied today plus any new files discovered tomorrow.\n      operationId: storagetransfer.transferOperations.cancel\n      parameters:\n        - in: path\n          name: transferOperationsId:cancel\n          required: true\n          schema:\n            type: string\n      requestBody:\n        content:\n          application/json:\n            schema:\n              $ref: '#/components/schemas/CancelOperationRequest'\n      responses:\n        '200':\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/Empty'\n          description: Successful response\n      security:\n        - Oauth2:\n            - https://www.googleapis.com/auth/cloud-platform\n          Oauth2c:\n            - https://www.googleapis.com/auth/cloud-platform\n      tags:\n        - transfer_operations\n  /v1/transferOperations/{transferOperationsId}:pause:\n    parameters:\n      - $ref: '#/components/parameters/callback'\n      - $ref: '#/components/parameters/quotaUser'\n      - $ref: '#/components/parameters/_.xgafv'\n      - $ref: '#/components/parameters/alt'\n      - $ref: '#/components/parameters/key'\n      - $ref: '#/components/parameters/upload_protocol'\n      - $ref: '#/components/parameters/oauth_token'\n      - $ref: '#/components/parameters/fields'\n      - $ref: '#/components/parameters/access_token'\n      - $ref: '#/components/parameters/prettyPrint'\n      - $ref: '#/components/parameters/uploadType'\n    post:\n      description: Pauses a transfer operation.\n      operationId: storagetransfer.transferOperations.pause\n      parameters:\n        - in: path\n          name: transferOperationsId:pause\n          required: true\n          schema:\n            type: string\n      requestBody:\n        content:\n          application/json:\n            schema:\n              $ref: '#/components/schemas/PauseTransferOperationRequest'\n      responses:\n        '200':\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/Empty'\n          description: Successful response\n      security:\n        - Oauth2:\n            - https://www.googleapis.com/auth/cloud-platform\n          Oauth2c:\n            - https://www.googleapis.com/auth/cloud-platform\n      tags:\n        - transfer_operations\n  /v1/transferOperations/{transferOperationsId}:resume:\n    parameters:\n      - $ref: '#/components/parameters/callback'\n      - $ref: '#/components/parameters/quotaUser'\n      - $ref: '#/components/parameters/_.xgafv'\n      - $ref: '#/components/parameters/alt'\n      - $ref: '#/components/parameters/key'\n      - $ref: '#/components/parameters/upload_protocol'\n      - $ref: '#/components/parameters/oauth_token'\n      - $ref: '#/components/parameters/fields'\n      - $ref: '#/components/parameters/access_token'\n      - $ref: '#/components/parameters/prettyPrint'\n      - $ref: '#/components/parameters/uploadType'\n    post:\n      description: Resumes a transfer operation that is paused.\n      operationId: storagetransfer.transferOperations.resume\n      parameters:\n        - in: path\n          name: transferOperationsId:resume\n          required: true\n          schema:\n            type: string\n      requestBody:\n        content:\n          application/json:\n            schema:\n              $ref: '#/components/schemas/ResumeTransferOperationRequest'\n      responses:\n        '200':\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/Empty'\n          description: Successful response\n      security:\n        - Oauth2:\n            - https://www.googleapis.com/auth/cloud-platform\n          Oauth2c:\n            - https://www.googleapis.com/auth/cloud-platform\n      tags:\n        - transfer_operations\nservers:\n  - url: https://storagetransfer.googleapis.com\n",
			"canonicalURL": "/github.com/stackql/stackql-provider-registry@fa7896eb5ee6872f9b9bb45ca9439fc11f7cd681/-/blob/providers/src/googleapis.com/v1.0.2/services/storagetransfer.yaml",
			"externalURLs": [
				{
					"url": "https://github.com/stackql/stackql-provider-registry/blob/fa7896eb5ee6872f9b9bb45ca9439fc11f7cd681/providers/src/googleapis.com/v1.0.2/services/storagetransfer.yaml",
					"serviceKind": "GITHUB"
				}
			]
		}
	},
	"Error": "parse: parse spec: parse components: schemas: \"Operation\": parse schema: property \"error\": parse schema: parse schema: property \"details\": parse schema: parse schema: parse schema: at 1:39526: unexpected schema type: \"any\""
}