{
	"File": {
		"__typename": "FileMatch",
		"repository": {
			"name": "github.com/smart-data-models/dataModel.EnergyCIM"
		},
		"file": {
			"name": "swagger.yaml",
			"size": 0,
			"path": "LoadMotor/swagger.yaml",
			"byteSize": 3066,
			"content": "---\n# Copyleft (c) 2021 Contributors to Smart Data Models initiative\n# \n\n\ncomponents:\n  schemas: \n    LoadMotor: \n      $ref: \"https://smart-data-models.github.io/dataModel.EnergyCIM/LoadMotor/model.yaml#/LoadMotor\"\ninfo:\n  description:  |\n    Adapted from CIM data models. Aggregate induction motor load. This model  is used to represent a fraction of an ordinary load as induction motor load.  It allows load that is treated as ordinary constant power in power flow analysis to be represented by an induction motor in dynamic simulation.  If  = 0. or  = , or  = 0.,  only one cage is represented. Magnetic saturation is not modelled. Either a 'one-cage' or 'two-cage' model of the induction machine can be modelled. Magnetic saturation is not modelled.  This model is intended for representation of aggregations of many motors dispersed through a load represented at a high voltage bus but where there is no information on the characteristics of individual motors.  This model treats a fraction of the constant power part of a load as a motor. During initialisation, the initial power drawn by the motor is set equal to  times the constant  part of the static load.  The remainder of the load is left as static load.  The reactive power demand of the motor is calculated during initialisation as a function of voltage at the load bus. This reactive power demand may be less than or greater than the constant  component of the load.  If the motor's reactive demand is greater than the constant  component of the load, the model inserts a shunt capacitor at the terminal of the motor to bring its reactive demand down to equal the constant  reactive load.   If a motor model and a static load model are both present for a load, the motor  is assumed to be subtracted from the power flow constant  load before the static load model is applied.  The remainder of the load, if any, is then represented by the static load model.\n  title: LoadMotor\n  version: \"1.0.0\"\nopenapi: \"3.0.0\"\n\npaths: \n  /ngsi-ld/v1/entities: \n    get: \n      description: \"Retrieve a set of entities which matches a specific query from an NGSI-LD system\"\n      parameters: \n        - \n          in: query\n          name: type\n          required: true\n          schema: \n            enum: \n              - LoadMotor\n            type: string\n      responses: \n        ? \"200\"\n        : \n          content: \n            application/ld+json: \n              examples: \n                keyvalues: \n                  summary: \"Key-Values Pairs\"\n                  value: \n                    - \n                      $ref: \"https://smart-data-models.github.io/dataModel.EnergyCIM/LoadMotor/examples/example.json\"\n                normalized: \n                  summary: \"Normalized NGSI-LD\"\n                  value: \n                    - \n                      $ref: \"https://smart-data-models.github.io/dataModel.EnergyCIM/LoadMotor/examples/example-normalized.jsonld\"\n          description: OK\n      tags: \n        - ngsi-ld\ntags: \n  - \n    description: \"NGSI-LD Linked-data Format\"\n    name: ngsi-ld\n"
		}
	},
	"Error": "parse: parse spec: parse components: schemas: \"LoadMotor\": parse schema: resolve \"https://smart-data-models.github.io/dataModel.EnergyCIM/LoadMotor/model.yaml#/LoadMotor\": external \"https://smart-data-models.github.io/dataModel.EnergyCIM/LoadMotor/model.yaml\": https: do: Get \"https://smart-data-models.github.io/dataModel.EnergyCIM/LoadMotor/model.yaml\": host \"smart-data-models.github.io\" is not allowed"
}