{
	"File": {
		"__typename": "FileMatch",
		"repository": {
			"name": "github.com/restful-ma/thresholds"
		},
		"file": {
			"name": "microsoft.com-cognitiveservices-NewsSearch-1.0-swagger.yaml",
			"size": 0,
			"path": "benchmark-repository/openapi/microsoft.com-cognitiveservices-NewsSearch-1.0-swagger.yaml",
			"byteSize": 89555,
			"content": "openapi: 3.0.0\ninfo:\n  contact:\n    x-twitter: microsoft\n  description: The News Search API lets you send a search query to Bing and get back a list\n    of news that are relevant to the search query. This section provides\n    technical details about the query parameters and headers that you use to\n    request news and the JSON response objects that contain them. For examples\n    that show how to make requests, see [Searching the web for\n    news](https://docs.microsoft.com/en-us/azure/cognitive-services/bing-news-search/search-the-web).\n  title: News Search Client\n  version: \"1.0\"\n  x-apisguru-categories:\n    - cloud\n  x-logo:\n    url: https://twitter.com/microsoft/profile_image?size=original\n  x-origin:\n    - format: swagger\n      url: https://raw.githubusercontent.com/Azure/azure-rest-api-specs/master/specification/cognitiveservices/data-plane/NewsSearch/stable/v1.0/NewsSearch.json\n      version: \"2.0\"\n  x-providerName: microsoft.com\n  x-serviceName: cognitiveservices-NewsSearch\n  x-tags:\n    - Microsoft\nsecurity:\n  - apiKeyHeader: []\npaths:\n  /news:\n    get:\n      operationId: News_Category\n      parameters:\n        - $ref: \"#/components/parameters/x-bingapis-sdk\"\n        - description: The default media type is application/json. To specify that the\n            response use [JSON-LD](http://json-ld.org/), set the Accept header\n            to application/ld+json.\n          in: header\n          name: Accept\n          required: false\n          schema:\n            type: string\n          examples:\n            Successful query:\n              value: application/json\n        - description: A comma-delimited list of one or more languages to use for user\n            interface strings. The list is in decreasing order of preference.\n            For additional information, including expected format, see\n            [RFC2616](http://www.w3.org/Protocols/rfc2616/rfc2616-sec14.html).\n            This header and the\n            [setLang](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/bing-news-api-v7-reference#setlang)\n            query parameter are mutually exclusive; do not specify both. If you\n            set this header, you must also specify the\n            [cc](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/bing-news-api-v7-reference#cc)\n            query parameter. To determine the market to return results for, Bing\n            uses the first supported language it finds from the list and\n            combines it with the cc parameter value. If the list does not\n            include a supported language, Bing finds the closest language and\n            market that supports the request or it uses an aggregated or default\n            market for the results. To determine the market that Bing used, see\n            the BingAPIs-Market header. Use this header and the cc query\n            parameter only if you specify multiple languages. Otherwise, use the\n            [mkt](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/bing-news-api-v7-reference#mkt)\n            and\n            [setLang](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/bing-news-api-v7-reference#setlang)\n            query parameters. A user interface string is a string that's used as\n            a label in a user interface. There are few user interface strings in\n            the JSON response objects. Any links to Bing.com properties in the\n            response objects apply the specified language.\n          in: header\n          name: Accept-Language\n          required: false\n          x-ms-client-name: AcceptLanguage\n          schema:\n            type: string\n        - description: \"The user agent originating the request. Bing uses the user agent to\n            provide mobile users with an optimized experience. Although\n            optional, you are encouraged to always specify this header. The\n            user-agent should be the same string that any commonly used browser\n            sends. For information about user agents, see [RFC\n            2616](http://www.w3.org/Protocols/rfc2616/rfc2616-sec14.html). The\n            following are examples of user-agent strings. Windows Phone:\n            Mozilla/5.0 (compatible; MSIE 10.0; Windows Phone 8.0; Trident/6.0;\n            IEMobile/10.0; ARM; Touch; NOKIA; Lumia 822). Android: Mozilla / 5.0\n            (Linux; U; Android 2.3.5; en - us; SCH - I500 Build / GINGERBREAD)\n            AppleWebKit / 533.1 (KHTML; like Gecko) Version / 4.0 Mobile Safari\n            / 533.1. iPhone: Mozilla / 5.0 (iPhone; CPU iPhone OS 6_1 like Mac\n            OS X) AppleWebKit / 536.26 (KHTML; like Gecko) Mobile / 10B142\n            iPhone4; 1 BingWeb / 3.03.1428.20120423. PC: Mozilla / 5.0 (Windows\n            NT 6.3; WOW64; Trident / 7.0; Touch; rv:11.0) like Gecko. iPad:\n            Mozilla / 5.0 (iPad; CPU OS 7_0 like Mac OS X) AppleWebKit /\n            537.51.1 (KHTML, like Gecko) Version / 7.0 Mobile / 11A465 Safari /\n            9537.53\"\n          in: header\n          name: User-Agent\n          required: false\n          x-ms-client-name: UserAgent\n          schema:\n            type: string\n          examples:\n            Successful query:\n              value: \"{User Agent}\"\n        - description: \"Bing uses this header to provide users with consistent behavior\n            across Bing API calls. Bing often flights new features and\n            improvements, and it uses the client ID as a key for assigning\n            traffic on different flights. If you do not use the same client ID\n            for a user across multiple requests, then Bing may assign the user\n            to multiple conflicting flights. Being assigned to multiple\n            conflicting flights can lead to an inconsistent user experience. For\n            example, if the second request has a different flight assignment\n            than the first, the experience may be unexpected. Also, Bing can use\n            the client ID to tailor web results to that client ID’s search\n            history, providing a richer experience for the user. Bing also uses\n            this header to help improve result rankings by analyzing the\n            activity generated by a client ID. The relevance improvements help\n            with better quality of results delivered by Bing APIs and in turn\n            enables higher click-through rates for the API consumer. IMPORTANT:\n            Although optional, you should consider this header required.\n            Persisting the client ID across multiple requests for the same end\n            user and device combination enables 1) the API consumer to receive a\n            consistent user experience, and 2) higher click-through rates via\n            better quality of results from the Bing APIs. Each user that uses\n            your application on the device must have a unique, Bing generated\n            client ID. If you do not include this header in the request, Bing\n            generates an ID and returns it in the X-MSEdge-ClientID response\n            header. The only time that you should NOT include this header in a\n            request is the first time the user uses your app on that device. Use\n            the client ID for each Bing API request that your app makes for this\n            user on the device. Persist the client ID. To persist the ID in a\n            browser app, use a persistent HTTP cookie to ensure the ID is used\n            across all sessions. Do not use a session cookie. For other apps\n            such as mobile apps, use the device's persistent storage to persist\n            the ID. The next time the user uses your app on that device, get the\n            client ID that you persisted. Bing responses may or may not include\n            this header. If the response includes this header, capture the\n            client ID and use it for all subsequent Bing requests for the user\n            on that device. If you include the X-MSEdge-ClientID, you must not\n            include cookies in the request.\"\n          in: header\n          name: X-MSEdge-ClientID\n          required: false\n          x-ms-client-name: ClientId\n          schema:\n            type: string\n          examples:\n            Successful query:\n              value: \"{Client ID}\"\n        - description: The IPv4 or IPv6 address of the client device. The IP address is\n            used to discover the user's location. Bing uses the location\n            information to determine safe search behavior. Although optional,\n            you are encouraged to always specify this header and the\n            X-Search-Location header. Do not obfuscate the address (for example,\n            by changing the last octet to 0). Obfuscating the address results in\n            the location not being anywhere near the device's actual location,\n            which may result in Bing serving erroneous results.\n          in: header\n          name: X-MSEdge-ClientIP\n          required: false\n          x-ms-client-name: ClientIp\n          schema:\n            type: string\n        - description: \"A semicolon-delimited list of key/value pairs that describe the\n            client's geographical location. Bing uses the location information\n            to determine safe search behavior and to return relevant local\n            content. Specify the key/value pair as \u003ckey\u003e:\u003cvalue\u003e. The following\n            are the keys that you use to specify the user's location. lat\n            (required): The latitude of the client's location, in degrees. The\n            latitude must be greater than or equal to -90.0 and less than or\n            equal to +90.0. Negative values indicate southern latitudes and\n            positive values indicate northern latitudes. long (required): The\n            longitude of the client's location, in degrees. The longitude must\n            be greater than or equal to -180.0 and less than or equal to +180.0.\n            Negative values indicate western longitudes and positive values\n            indicate eastern longitudes. re (required): The radius, in meters,\n            which specifies the horizontal accuracy of the coordinates. Pass the\n            value returned by the device's location service. Typical values\n            might be 22m for GPS/Wi-Fi, 380m for cell tower triangulation, and\n            18,000m for reverse IP lookup. ts (optional): The UTC UNIX timestamp\n            of when the client was at the location. (The UNIX timestamp is the\n            number of seconds since January 1, 1970.) head (optional): The\n            client's relative heading or direction of travel. Specify the\n            direction of travel as degrees from 0 through 360, counting\n            clockwise relative to true north. Specify this key only if the sp\n            key is nonzero. sp (optional): The horizontal velocity (speed), in\n            meters per second, that the client device is traveling. alt\n            (optional): The altitude of the client device, in meters. are\n            (optional): The radius, in meters, that specifies the vertical\n            accuracy of the coordinates. Specify this key only if you specify\n            the alt key. Although many of the keys are optional, the more\n            information that you provide, the more accurate the location results\n            are. Although optional, you are encouraged to always specify the\n            user's geographical location. Providing the location is especially\n            important if the client's IP address does not accurately reflect the\n            user's physical location (for example, if the client uses VPN). For\n            optimal results, you should include this header and the\n            X-MSEdge-ClientIP header, but at a minimum, you should include this\n            header.\"\n          in: header\n          name: X-Search-Location\n          required: false\n          x-ms-client-name: Location\n          schema:\n            type: string\n        - description: A 2-character country code of the country where the results come\n            from. This API supports only the United States market. If you\n            specify this query parameter, it must be set to us. If you set this\n            parameter, you must also specify the Accept-Language header. Bing\n            uses the first supported language it finds from the languages list,\n            and combine that language with the country code that you specify to\n            determine the market to return results for. If the languages list\n            does not include a supported language, Bing finds the closest\n            language and market that supports the request, or it may use an\n            aggregated or default market for the results instead of a specified\n            one. You should use this query parameter and the Accept-Language\n            query parameter only if you specify multiple languages; otherwise,\n            you should use the mkt and setLang query parameters. This parameter\n            and the mkt query parameter are mutually exclusive—do not specify\n            both.\n          in: query\n          name: cc\n          required: false\n          x-ms-client-name: CountryCode\n          schema:\n            type: string\n          examples:\n            Successful query:\n              value: US\n        - description: \"The category of articles to return. For example, Sports articles or\n            Entertainment articles. For a list of possible categories, see [News\n            Categories by\n            Market](https://docs.microsoft.com/en-us/rest/api/cognitiveservices\\\n            /bing-news-api-v7-reference#categories-by-market). Use this\n            parameter only with News Category API. If you do not specify this\n            parameter, the response includes both: Headline articles typically\n            published in the last 24 hours from any category and articles from\n            each parent category (up to four articles). If the article is a\n            headline, the article's headline field is set to true. By default,\n            the response includes up to 12 headline articles. To specify the\n            number of headline articles to return, set the\n            [headlineCount](https://docs.microsoft.com/en-us/rest/api/cognitive\\\n            services/bing-news-api-v7-reference#headlineCount) query parameter.\"\n          in: query\n          name: category\n          required: false\n          x-ms-client-name: Category\n          schema:\n            type: string\n          examples:\n            Successful query:\n              value: sports\n        - description: The number of news articles to return in the response. The actual\n            number delivered may be less than requested. The default is 10 and\n            the maximum value is 100. The actual number delivered may be less\n            than requested.You may use this parameter along with the offset\n            parameter to page results. For example, if your user interface\n            displays 20 articles per page, set count to 20 and offset to 0 to\n            get the first page of results. For each subsequent page, increment\n            offset by 20 (for example, 0, 20, 40). It is possible for multiple\n            pages to include some overlap in results. If you do not specify the\n            [category](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/bing-news-api-v7-reference#category)\n            parameter, Bing ignores this parameter.\n          in: query\n          name: count\n          required: false\n          x-ms-client-name: Count\n          schema:\n            type: integer\n            format: int32\n        - description: The number of headline articles to return in the response. The\n            default is 12. Specify this parameter only if you do not specify the\n            [category](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/bing-news-api-v7-reference#category)\n            parameter.\n          in: query\n          name: headlineCount\n          required: false\n          x-ms-client-name: HeadlineCount\n          schema:\n            type: integer\n            format: int32\n        - description: \"The market where the results come from. Typically, mkt is the\n            country where the user is making the request from. However, it could\n            be a different country if the user is not located in a country where\n            Bing delivers results. The market must be in the form \u003clanguage\n            code\u003e-\u003ccountry code\u003e. For example, en-US. The string is case\n            insensitive. For a list of possible market values, see [Market\n            Codes](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/\\\n            bing-news-api-v7-reference#market-codes). NOTE: If known, you are\n            encouraged to always specify the market. Specifying the market helps\n            Bing route the request and return an appropriate and optimal\n            response. If you specify a market that is not listed in [Market\n            Codes](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/\\\n            bing-news-api-v7-reference#market-codes), Bing uses a best fit\n            market code based on an internal mapping that is subject to change.\n            This parameter and the\n            [cc](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/bi\\\n            ng-news-api-v7-reference#cc) query parameter are mutually\n            exclusive—do not specify both.\"\n          in: query\n          name: mkt\n          required: false\n          x-ms-client-name: Market\n          schema:\n            type: string\n          examples:\n            Successful query:\n              value: en-us\n        - description: The zero-based offset that indicates the number of news to skip\n            before returning news. The default is 0. The offset should be less\n            than\n            ([totalEstimatedMatches](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/bing-news-api-v7-reference#news-totalmatches)\n            - count). Use this parameter along with the count parameter to page\n            results. For example, if your user interface displays 20 news per\n            page, set count to 20 and offset to 0 to get the first page of\n            results. For each subsequent page, increment offset by 20 (for\n            example, 0, 20, 40). It is possible for multiple pages to include\n            some overlap in results. If you do not specify the\n            [category](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/bing-news-api-v7-reference#category)\n            parameter, Bing ignores this parameter.\n          in: query\n          name: offset\n          required: false\n          x-ms-client-name: Offset\n          schema:\n            type: integer\n            format: int32\n        - description: A Boolean value that determines whether the image's contentUrl\n            contains a URL that points to a thumbnail of the original article's\n            image or the image itself. If the article includes an image, and\n            this parameter is set to true, the image's contentUrl property\n            contains a URL that you may use to download the original image from\n            the publisher's website. Otherwise, if this parameter is false, the\n            image's contentUrl and thumbnailUrl URLs both point to the same\n            thumbnail image. Use this parameter only with the News Search API or\n            News Category API. Trending Topics API ignore this parameter.\n          in: query\n          name: originalImg\n          required: false\n          x-ms-client-name: OriginalImage\n          schema:\n            type: boolean\n        - description: \"Filter news for adult content. The following are the possible\n            filter values. Off: Return news articles with adult text, images, or\n            videos. Moderate: Return news articles with adult text but not adult\n            images or videos. Strict: Do not return news articles with adult\n            text, images, or videos. If the request comes from a market that\n            Bing's adult policy requires that safeSearch is set to Strict, Bing\n            ignores the safeSearch value and uses Strict. If you use the site:\n            query operator, there is the chance that the response may contain\n            adult content regardless of what the safeSearch query parameter is\n            set to. Use site: only if you are aware of the content on the site\n            and your scenario supports the possibility of adult content.\"\n          in: query\n          name: safeSearch\n          required: false\n          x-ms-client-name: SafeSearch\n          x-ms-enum:\n            modelAsString: true\n            name: SafeSearch\n          schema:\n            type: string\n            enum:\n              - Off\n              - Moderate\n              - Strict\n        - description: The language to use for user interface strings. Specify the language\n            using the ISO 639-1 2-letter language code. For example, the\n            language code for English is EN. The default is EN (English).\n            Although optional, you should always specify the language.\n            Typically, you set setLang to the same language specified by mkt\n            unless the user wants the user interface strings displayed in a\n            different language. This parameter and the\n            [Accept-Language](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/bing-news-api-v7-reference#acceptlanguage)\n            header are mutually exclusive; do not specify both. A user interface\n            string is a string that's used as a label in a user interface. There\n            are few user interface strings in the JSON response objects. Also,\n            any links to Bing.com properties in the response objects apply the\n            specified language.\n          in: query\n          name: setLang\n          required: false\n          x-ms-client-name: SetLang\n          schema:\n            type: string\n          examples:\n            Successful query:\n              value: en\n        - description: A Boolean value that determines whether display strings contain\n            decoration markers such as hit highlighting characters. If true, the\n            strings may include markers. The default is false. To specify\n            whether to use Unicode characters or HTML tags as the markers, see\n            the\n            [textFormat](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/bing-news-api-v7-reference#textformat)\n            query parameter. For information about hit highlighting, see [Hit\n            Highlighting](https://docs.microsoft.com/azure/cognitive-services/bing-news-search/hit-highlighting).\n          in: query\n          name: textDecorations\n          required: false\n          x-ms-client-name: TextDecorations\n          schema:\n            type: boolean\n        - description: The type of markers to use for text decorations (see the\n            textDecorations query parameter). Possible values are Raw—Use\n            Unicode characters to mark content that needs special formatting.\n            The Unicode characters are in the range E000 through E019. For\n            example, Bing uses E000 and E001 to mark the beginning and end of\n            query terms for hit highlighting. HTML—Use HTML tags to mark content\n            that needs special formatting. For example, use \u003cb\u003e tags to\n            highlight query terms in display strings. The default is Raw. For\n            display strings that contain escapable HTML characters such as \u003c, \u003e,\n            and \u0026, if textFormat is set to HTML, Bing escapes the characters as\n            appropriate (for example, \u003c is escaped to \u0026lt;).\n          in: query\n          name: textFormat\n          required: false\n          x-ms-client-name: TextFormat\n          x-ms-enum:\n            modelAsString: true\n            name: TextFormat\n          schema:\n            type: string\n            enum:\n              - Raw\n              - Html\n      responses:\n        \"200\":\n          description: Success.\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/News\"\n              examples:\n                Successful query:\n                  $ref: \"#/components/examples/Successful_query\"\n        default:\n          description: An error has occurred. Check the response type and/or status code\n            for more details.\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/ErrorResponse\"\n      summary: The News Category API lets you search on Bing and get back a list of top\n        news articles by category. This section provides technical details about\n        the query parameters and headers that you use to request news and the\n        JSON response objects that contain them.  For examples that show how to\n        make requests, see [Searching the web for\n        news](https://docs.microsoft.com/en-us/azure/cognitive-services/bing-news-search/search-the-web).\n      tags:\n        - NewsCategory\n  /news/search:\n    get:\n      operationId: News_Search\n      parameters:\n        - $ref: \"#/components/parameters/x-bingapis-sdk\"\n        - description: The default media type is application/json. To specify that the\n            response use [JSON-LD](http://json-ld.org/), set the Accept header\n            to application/ld+json.\n          in: header\n          name: Accept\n          required: false\n          schema:\n            type: string\n          examples:\n            Successful query:\n              value: application/json\n        - description: A comma-delimited list of one or more languages to use for user\n            interface strings. The list is in decreasing order of preference.\n            For additional information, including expected format, see\n            [RFC2616](http://www.w3.org/Protocols/rfc2616/rfc2616-sec14.html).\n            This header and the\n            [setLang](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/bing-news-api-v7-reference#setlang)\n            query parameter are mutually exclusive; do not specify both. If you\n            set this header, you must also specify the\n            [cc](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/bing-news-api-v7-reference#cc)\n            query parameter. To determine the market to return results for, Bing\n            uses the first supported language it finds from the list and\n            combines it with the cc parameter value. If the list does not\n            include a supported language, Bing finds the closest language and\n            market that supports the request or it uses an aggregated or default\n            market for the results. To determine the market that Bing used, see\n            the BingAPIs-Market header. Use this header and the cc query\n            parameter only if you specify multiple languages. Otherwise, use the\n            [mkt](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/bing-news-api-v7-reference#mkt)\n            and\n            [setLang](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/bing-news-api-v7-reference#setlang)\n            query parameters. A user interface string is a string that's used as\n            a label in a user interface. There are few user interface strings in\n            the JSON response objects. Any links to Bing.com properties in the\n            response objects apply the specified language.\n          in: header\n          name: Accept-Language\n          required: false\n          x-ms-client-name: AcceptLanguage\n          schema:\n            type: string\n        - description: \"The user agent originating the request. Bing uses the user agent to\n            provide mobile users with an optimized experience. Although\n            optional, you are encouraged to always specify this header. The\n            user-agent should be the same string that any commonly used browser\n            sends. For information about user agents, see [RFC\n            2616](http://www.w3.org/Protocols/rfc2616/rfc2616-sec14.html). The\n            following are examples of user-agent strings. Windows Phone:\n            Mozilla/5.0 (compatible; MSIE 10.0; Windows Phone 8.0; Trident/6.0;\n            IEMobile/10.0; ARM; Touch; NOKIA; Lumia 822). Android: Mozilla / 5.0\n            (Linux; U; Android 2.3.5; en - us; SCH - I500 Build / GINGERBREAD)\n            AppleWebKit / 533.1 (KHTML; like Gecko) Version / 4.0 Mobile Safari\n            / 533.1. iPhone: Mozilla / 5.0 (iPhone; CPU iPhone OS 6_1 like Mac\n            OS X) AppleWebKit / 536.26 (KHTML; like Gecko) Mobile / 10B142\n            iPhone4; 1 BingWeb / 3.03.1428.20120423. PC: Mozilla / 5.0 (Windows\n            NT 6.3; WOW64; Trident / 7.0; Touch; rv:11.0) like Gecko. iPad:\n            Mozilla / 5.0 (iPad; CPU OS 7_0 like Mac OS X) AppleWebKit /\n            537.51.1 (KHTML, like Gecko) Version / 7.0 Mobile / 11A465 Safari /\n            9537.53\"\n          in: header\n          name: User-Agent\n          required: false\n          x-ms-client-name: UserAgent\n          schema:\n            type: string\n          examples:\n            Successful query:\n              value: \"{User Agent}\"\n        - description: \"Bing uses this header to provide users with consistent behavior\n            across Bing API calls. Bing often flights new features and\n            improvements, and it uses the client ID as a key for assigning\n            traffic on different flights. If you do not use the same client ID\n            for a user across multiple requests, then Bing may assign the user\n            to multiple conflicting flights. Being assigned to multiple\n            conflicting flights can lead to an inconsistent user experience. For\n            example, if the second request has a different flight assignment\n            than the first, the experience may be unexpected. Also, Bing can use\n            the client ID to tailor web results to that client ID’s search\n            history, providing a richer experience for the user. Bing also uses\n            this header to help improve result rankings by analyzing the\n            activity generated by a client ID. The relevance improvements help\n            with better quality of results delivered by Bing APIs and in turn\n            enables higher click-through rates for the API consumer. IMPORTANT:\n            Although optional, you should consider this header required.\n            Persisting the client ID across multiple requests for the same end\n            user and device combination enables 1) the API consumer to receive a\n            consistent user experience, and 2) higher click-through rates via\n            better quality of results from the Bing APIs. Each user that uses\n            your application on the device must have a unique, Bing generated\n            client ID. If you do not include this header in the request, Bing\n            generates an ID and returns it in the X-MSEdge-ClientID response\n            header. The only time that you should NOT include this header in a\n            request is the first time the user uses your app on that device. Use\n            the client ID for each Bing API request that your app makes for this\n            user on the device. Persist the client ID. To persist the ID in a\n            browser app, use a persistent HTTP cookie to ensure the ID is used\n            across all sessions. Do not use a session cookie. For other apps\n            such as mobile apps, use the device's persistent storage to persist\n            the ID. The next time the user uses your app on that device, get the\n            client ID that you persisted. Bing responses may or may not include\n            this header. If the response includes this header, capture the\n            client ID and use it for all subsequent Bing requests for the user\n            on that device. If you include the X-MSEdge-ClientID, you must not\n            include cookies in the request.\"\n          in: header\n          name: X-MSEdge-ClientID\n          required: false\n          x-ms-client-name: ClientId\n          schema:\n            type: string\n          examples:\n            Successful query:\n              value: \"{Client ID}\"\n        - description: The IPv4 or IPv6 address of the client device. The IP address is\n            used to discover the user's location. Bing uses the location\n            information to determine safe search behavior. Although optional,\n            you are encouraged to always specify this header and the\n            X-Search-Location header. Do not obfuscate the address (for example,\n            by changing the last octet to 0). Obfuscating the address results in\n            the location not being anywhere near the device's actual location,\n            which may result in Bing serving erroneous results.\n          in: header\n          name: X-MSEdge-ClientIP\n          required: false\n          x-ms-client-name: ClientIp\n          schema:\n            type: string\n        - description: \"A semicolon-delimited list of key/value pairs that describe the\n            client's geographical location. Bing uses the location information\n            to determine safe search behavior and to return relevant local\n            content. Specify the key/value pair as \u003ckey\u003e:\u003cvalue\u003e. The following\n            are the keys that you use to specify the user's location. lat\n            (required): The latitude of the client's location, in degrees. The\n            latitude must be greater than or equal to -90.0 and less than or\n            equal to +90.0. Negative values indicate southern latitudes and\n            positive values indicate northern latitudes. long (required): The\n            longitude of the client's location, in degrees. The longitude must\n            be greater than or equal to -180.0 and less than or equal to +180.0.\n            Negative values indicate western longitudes and positive values\n            indicate eastern longitudes. re (required): The radius, in meters,\n            which specifies the horizontal accuracy of the coordinates. Pass the\n            value returned by the device's location service. Typical values\n            might be 22m for GPS/Wi-Fi, 380m for cell tower triangulation, and\n            18,000m for reverse IP lookup. ts (optional): The UTC UNIX timestamp\n            of when the client was at the location. (The UNIX timestamp is the\n            number of seconds since January 1, 1970.) head (optional): The\n            client's relative heading or direction of travel. Specify the\n            direction of travel as degrees from 0 through 360, counting\n            clockwise relative to true north. Specify this key only if the sp\n            key is nonzero. sp (optional): The horizontal velocity (speed), in\n            meters per second, that the client device is traveling. alt\n            (optional): The altitude of the client device, in meters. are\n            (optional): The radius, in meters, that specifies the vertical\n            accuracy of the coordinates. Specify this key only if you specify\n            the alt key. Although many of the keys are optional, the more\n            information that you provide, the more accurate the location results\n            are. Although optional, you are encouraged to always specify the\n            user's geographical location. Providing the location is especially\n            important if the client's IP address does not accurately reflect the\n            user's physical location (for example, if the client uses VPN). For\n            optimal results, you should include this header and the\n            X-MSEdge-ClientIP header, but at a minimum, you should include this\n            header.\"\n          in: header\n          name: X-Search-Location\n          required: false\n          x-ms-client-name: Location\n          schema:\n            type: string\n        - description: A 2-character country code of the country where the results come\n            from. This API supports only the United States market. If you\n            specify this query parameter, it must be set to us. If you set this\n            parameter, you must also specify the Accept-Language header. Bing\n            uses the first supported language it finds from the languages list,\n            and combine that language with the country code that you specify to\n            determine the market to return results for. If the languages list\n            does not include a supported language, Bing finds the closest\n            language and market that supports the request, or it may use an\n            aggregated or default market for the results instead of a specified\n            one. You should use this query parameter and the Accept-Language\n            query parameter only if you specify multiple languages; otherwise,\n            you should use the mkt and setLang query parameters. This parameter\n            and the mkt query parameter are mutually exclusive—do not specify\n            both.\n          in: query\n          name: cc\n          required: false\n          x-ms-client-name: CountryCode\n          schema:\n            type: string\n          examples:\n            Successful query:\n              value: US\n        - description: The number of news articles to return in the response. The actual\n            number delivered may be less than requested. The default is 10 and\n            the maximum value is 100. The actual number delivered may be less\n            than requested.You may use this parameter along with the offset\n            parameter to page results. For example, if your user interface\n            displays 20 articles per page, set count to 20 and offset to 0 to\n            get the first page of results. For each subsequent page, increment\n            offset by 20 (for example, 0, 20, 40). It is possible for multiple\n            pages to include some overlap in results.\n          in: query\n          name: count\n          required: false\n          x-ms-client-name: Count\n          schema:\n            type: integer\n            format: int32\n        - description: \"Filter news by the date and time that Bing discovered the news. The\n            following are the possible filter values. Day: Return news\n            discovered within the last 24 hours. Week: Return news discovered\n            within the last 7 days. Month: Return news discovered within the\n            last 30 days. Use this parameter only with the News Search API. Do\n            not specify this parameter when calling the News Category API or the\n            Trending Topics API.\"\n          in: query\n          name: freshness\n          required: false\n          x-ms-client-name: Freshness\n          x-ms-enum:\n            modelAsString: true\n            name: Freshness\n          schema:\n            type: string\n            enum:\n              - Day\n              - Week\n              - Month\n        - description: \"The market where the results come from. Typically, mkt is the\n            country where the user is making the request from. However, it could\n            be a different country if the user is not located in a country where\n            Bing delivers results. The market must be in the form \u003clanguage\n            code\u003e-\u003ccountry code\u003e. For example, en-US. The string is case\n            insensitive. For a list of possible market values, see [Market\n            Codes](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/\\\n            bing-news-api-v7-reference#market-codes). NOTE: If known, you are\n            encouraged to always specify the market. Specifying the market helps\n            Bing route the request and return an appropriate and optimal\n            response. If you specify a market that is not listed in [Market\n            Codes](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/\\\n            bing-news-api-v7-reference#market-codes), Bing uses a best fit\n            market code based on an internal mapping that is subject to change.\n            This parameter and the\n            [cc](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/bi\\\n            ng-news-api-v7-reference#cc) query parameter are mutually\n            exclusive—do not specify both.\"\n          in: query\n          name: mkt\n          required: false\n          x-ms-client-name: Market\n          schema:\n            type: string\n          examples:\n            Successful query:\n              value: en-us\n        - description: The zero-based offset that indicates the number of news to skip\n            before returning news. The default is 0. The offset should be less\n            than\n            ([totalEstimatedMatches](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/bing-news-api-v7-reference#news-totalmatches)\n            - count). Use this parameter along with the count parameter to page\n            results. For example, if your user interface displays 20 news per\n            page, set count to 20 and offset to 0 to get the first page of\n            results. For each subsequent page, increment offset by 20 (for\n            example, 0, 20, 40). It is possible for multiple pages to include\n            some overlap in results.\n          in: query\n          name: offset\n          required: false\n          x-ms-client-name: Offset\n          schema:\n            type: integer\n            format: int32\n        - description: A Boolean value that determines whether the image's contentUrl\n            contains a URL that points to a thumbnail of the original article's\n            image or the image itself. If the article includes an image, and\n            this parameter is set to true, the image's contentUrl property\n            contains a URL that you may use to download the original image from\n            the publisher's website. Otherwise, if this parameter is false, the\n            image's contentUrl and thumbnailUrl URLs both point to the same\n            thumbnail image. Use this parameter only with the News Search API.\n            Do not specify this parameter when calling the Trending Topics API\n            or News Category API.\n          in: query\n          name: originalImg\n          required: false\n          x-ms-client-name: OriginalImage\n          schema:\n            type: boolean\n        - description: The user's search query string. The query string cannot be empty.\n            The query string may contain [Bing Advanced\n            Operators](http://msdn.microsoft.com/library/ff795620.aspx). For\n            example, to limit news to a specific domain, use the\n            [site:](http://msdn.microsoft.com/library/ff795613.aspx) operator.\n            Use this parameter only with the News Search API. Do not specify\n            this parameter when calling the Trending Topics API or News Category\n            API.\n          in: query\n          name: q\n          required: true\n          x-ms-client-name: Query\n          schema:\n            type: string\n          examples:\n            Successful query:\n              value: microsoft\n        - description: \"Filter news for adult content. The following are the possible\n            filter values. Off: Return news articles with adult text, images, or\n            videos. Moderate: Return news articles with adult text but not adult\n            images or videos. Strict: Do not return news articles with adult\n            text, images, or videos. If the request comes from a market that\n            Bing's adult policy requires that safeSearch is set to Strict, Bing\n            ignores the safeSearch value and uses Strict. If you use the site:\n            query operator, there is the chance that the response may contain\n            adult content regardless of what the safeSearch query parameter is\n            set to. Use site: only if you are aware of the content on the site\n            and your scenario supports the possibility of adult content.\"\n          in: query\n          name: safeSearch\n          required: false\n          x-ms-client-name: SafeSearch\n          x-ms-enum:\n            modelAsString: true\n            name: SafeSearch\n          schema:\n            type: string\n            enum:\n              - Off\n              - Moderate\n              - Strict\n        - description: The language to use for user interface strings. Specify the language\n            using the ISO 639-1 2-letter language code. For example, the\n            language code for English is EN. The default is EN (English).\n            Although optional, you should always specify the language.\n            Typically, you set setLang to the same language specified by mkt\n            unless the user wants the user interface strings displayed in a\n            different language. This parameter and the\n            [Accept-Language](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/bing-news-api-v7-reference#acceptlanguage)\n            header are mutually exclusive; do not specify both. A user interface\n            string is a string that's used as a label in a user interface. There\n            are few user interface strings in the JSON response objects. Also,\n            any links to Bing.com properties in the response objects apply the\n            specified language.\n          in: query\n          name: setLang\n          required: false\n          x-ms-client-name: SetLang\n          schema:\n            type: string\n          examples:\n            Successful query:\n              value: en\n        - description: \"The order to return the news in. The following are the possible\n            case-insensitive values. Date: If the request is through the News\n            Search API, the response returns news articles sorted by date from\n            the most recent to the oldest. If the request is through the News\n            Trending Topics API, the response returns trending topics sorted by\n            date from the most recent to the oldest.\"\n          in: query\n          name: sortBy\n          required: false\n          x-ms-client-name: SortBy\n          schema:\n            type: string\n        - description: A Boolean value that determines whether display strings contain\n            decoration markers such as hit highlighting characters. If true, the\n            strings may include markers. The default is false. To specify\n            whether to use Unicode characters or HTML tags as the markers, see\n            the\n            [textFormat](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/bing-news-api-v7-reference#textformat)\n            query parameter. For information about hit highlighting, see [Hit\n            Highlighting](https://docs.microsoft.com/azure/cognitive-services/bing-news-search/hit-highlighting).\n          in: query\n          name: textDecorations\n          required: false\n          x-ms-client-name: TextDecorations\n          schema:\n            type: boolean\n        - description: The type of markers to use for text decorations (see the\n            textDecorations query parameter). Possible values are Raw—Use\n            Unicode characters to mark content that needs special formatting.\n            The Unicode characters are in the range E000 through E019. For\n            example, Bing uses E000 and E001 to mark the beginning and end of\n            query terms for hit highlighting. HTML—Use HTML tags to mark content\n            that needs special formatting. For example, use \u003cb\u003e tags to\n            highlight query terms in display strings. The default is Raw. For\n            display strings that contain escapable HTML characters such as \u003c, \u003e,\n            and \u0026, if textFormat is set to HTML, Bing escapes the characters as\n            appropriate (for example, \u003c is escaped to \u0026lt;).\n          in: query\n          name: textFormat\n          required: false\n          x-ms-client-name: TextFormat\n          x-ms-enum:\n            modelAsString: true\n            name: TextFormat\n          schema:\n            type: string\n            enum:\n              - Raw\n              - Html\n      responses:\n        \"200\":\n          description: Success.\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/News\"\n              examples:\n                Successful query:\n                  $ref: \"#/components/examples/Successful_query\"\n        default:\n          description: An error has occurred. Check the response type and/or status code\n            for more details.\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/ErrorResponse\"\n      summary: The News Search API lets you send a search query to Bing and get back a\n        list of news that are relevant to the search query. This section\n        provides technical details about the query parameters and headers that\n        you use to request news and the JSON response objects that contain\n        them.  For examples that show how to make requests, see [Searching the\n        web for\n        news](https://docs.microsoft.com/en-us/azure/cognitive-services/bing-news-search/search-the-web).\n      tags:\n        - NewsSearch\n  /news/trendingtopics:\n    get:\n      operationId: News_Trending\n      parameters:\n        - $ref: \"#/components/parameters/x-bingapis-sdk\"\n        - description: The default media type is application/json. To specify that the\n            response use [JSON-LD](http://json-ld.org/), set the Accept header\n            to application/ld+json.\n          in: header\n          name: Accept\n          required: false\n          schema:\n            type: string\n          examples:\n            Successful query:\n              value: application/json\n        - description: A comma-delimited list of one or more languages to use for user\n            interface strings. The list is in decreasing order of preference.\n            For additional information, including expected format, see\n            [RFC2616](http://www.w3.org/Protocols/rfc2616/rfc2616-sec14.html).\n            This header and the\n            [setLang](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/bing-news-api-v7-reference#setlang)\n            query parameter are mutually exclusive; do not specify both. If you\n            set this header, you must also specify the\n            [cc](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/bing-news-api-v7-reference#cc)\n            query parameter. To determine the market to return results for, Bing\n            uses the first supported language it finds from the list and\n            combines it with the cc parameter value. If the list does not\n            include a supported language, Bing finds the closest language and\n            market that supports the request or it uses an aggregated or default\n            market for the results. To determine the market that Bing used, see\n            the BingAPIs-Market header. Use this header and the cc query\n            parameter only if you specify multiple languages. Otherwise, use the\n            [mkt](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/bing-news-api-v7-reference#mkt)\n            and\n            [setLang](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/bing-news-api-v7-reference#setlang)\n            query parameters. A user interface string is a string that's used as\n            a label in a user interface. There are few user interface strings in\n            the JSON response objects. Any links to Bing.com properties in the\n            response objects apply the specified language.\n          in: header\n          name: Accept-Language\n          required: false\n          x-ms-client-name: AcceptLanguage\n          schema:\n            type: string\n        - description: \"The user agent originating the request. Bing uses the user agent to\n            provide mobile users with an optimized experience. Although\n            optional, you are encouraged to always specify this header. The\n            user-agent should be the same string that any commonly used browser\n            sends. For information about user agents, see [RFC\n            2616](http://www.w3.org/Protocols/rfc2616/rfc2616-sec14.html). The\n            following are examples of user-agent strings. Windows Phone:\n            Mozilla/5.0 (compatible; MSIE 10.0; Windows Phone 8.0; Trident/6.0;\n            IEMobile/10.0; ARM; Touch; NOKIA; Lumia 822). Android: Mozilla / 5.0\n            (Linux; U; Android 2.3.5; en - us; SCH - I500 Build / GINGERBREAD)\n            AppleWebKit / 533.1 (KHTML; like Gecko) Version / 4.0 Mobile Safari\n            / 533.1. iPhone: Mozilla / 5.0 (iPhone; CPU iPhone OS 6_1 like Mac\n            OS X) AppleWebKit / 536.26 (KHTML; like Gecko) Mobile / 10B142\n            iPhone4; 1 BingWeb / 3.03.1428.20120423. PC: Mozilla / 5.0 (Windows\n            NT 6.3; WOW64; Trident / 7.0; Touch; rv:11.0) like Gecko. iPad:\n            Mozilla / 5.0 (iPad; CPU OS 7_0 like Mac OS X) AppleWebKit /\n            537.51.1 (KHTML, like Gecko) Version / 7.0 Mobile / 11A465 Safari /\n            9537.53\"\n          in: header\n          name: User-Agent\n          required: false\n          x-ms-client-name: UserAgent\n          schema:\n            type: string\n          examples:\n            Successful query:\n              value: \"{User Agent}\"\n        - description: \"Bing uses this header to provide users with consistent behavior\n            across Bing API calls. Bing often flights new features and\n            improvements, and it uses the client ID as a key for assigning\n            traffic on different flights. If you do not use the same client ID\n            for a user across multiple requests, then Bing may assign the user\n            to multiple conflicting flights. Being assigned to multiple\n            conflicting flights can lead to an inconsistent user experience. For\n            example, if the second request has a different flight assignment\n            than the first, the experience may be unexpected. Also, Bing can use\n            the client ID to tailor web results to that client ID’s search\n            history, providing a richer experience for the user. Bing also uses\n            this header to help improve result rankings by analyzing the\n            activity generated by a client ID. The relevance improvements help\n            with better quality of results delivered by Bing APIs and in turn\n            enables higher click-through rates for the API consumer. IMPORTANT:\n            Although optional, you should consider this header required.\n            Persisting the client ID across multiple requests for the same end\n            user and device combination enables 1) the API consumer to receive a\n            consistent user experience, and 2) higher click-through rates via\n            better quality of results from the Bing APIs. Each user that uses\n            your application on the device must have a unique, Bing generated\n            client ID. If you do not include this header in the request, Bing\n            generates an ID and returns it in the X-MSEdge-ClientID response\n            header. The only time that you should NOT include this header in a\n            request is the first time the user uses your app on that device. Use\n            the client ID for each Bing API request that your app makes for this\n            user on the device. Persist the client ID. To persist the ID in a\n            browser app, use a persistent HTTP cookie to ensure the ID is used\n            across all sessions. Do not use a session cookie. For other apps\n            such as mobile apps, use the device's persistent storage to persist\n            the ID. The next time the user uses your app on that device, get the\n            client ID that you persisted. Bing responses may or may not include\n            this header. If the response includes this header, capture the\n            client ID and use it for all subsequent Bing requests for the user\n            on that device. If you include the X-MSEdge-ClientID, you must not\n            include cookies in the request.\"\n          in: header\n          name: X-MSEdge-ClientID\n          required: false\n          x-ms-client-name: ClientId\n          schema:\n            type: string\n          examples:\n            Successful query:\n              value: \"{Client ID}\"\n        - description: The IPv4 or IPv6 address of the client device. The IP address is\n            used to discover the user's location. Bing uses the location\n            information to determine safe search behavior. Although optional,\n            you are encouraged to always specify this header and the\n            X-Search-Location header. Do not obfuscate the address (for example,\n            by changing the last octet to 0). Obfuscating the address results in\n            the location not being anywhere near the device's actual location,\n            which may result in Bing serving erroneous results.\n          in: header\n          name: X-MSEdge-ClientIP\n          required: false\n          x-ms-client-name: ClientIp\n          schema:\n            type: string\n        - description: \"A semicolon-delimited list of key/value pairs that describe the\n            client's geographical location. Bing uses the location information\n            to determine safe search behavior and to return relevant local\n            content. Specify the key/value pair as \u003ckey\u003e:\u003cvalue\u003e. The following\n            are the keys that you use to specify the user's location. lat\n            (required): The latitude of the client's location, in degrees. The\n            latitude must be greater than or equal to -90.0 and less than or\n            equal to +90.0. Negative values indicate southern latitudes and\n            positive values indicate northern latitudes. long (required): The\n            longitude of the client's location, in degrees. The longitude must\n            be greater than or equal to -180.0 and less than or equal to +180.0.\n            Negative values indicate western longitudes and positive values\n            indicate eastern longitudes. re (required): The radius, in meters,\n            which specifies the horizontal accuracy of the coordinates. Pass the\n            value returned by the device's location service. Typical values\n            might be 22m for GPS/Wi-Fi, 380m for cell tower triangulation, and\n            18,000m for reverse IP lookup. ts (optional): The UTC UNIX timestamp\n            of when the client was at the location. (The UNIX timestamp is the\n            number of seconds since January 1, 1970.) head (optional): The\n            client's relative heading or direction of travel. Specify the\n            direction of travel as degrees from 0 through 360, counting\n            clockwise relative to true north. Specify this key only if the sp\n            key is nonzero. sp (optional): The horizontal velocity (speed), in\n            meters per second, that the client device is traveling. alt\n            (optional): The altitude of the client device, in meters. are\n            (optional): The radius, in meters, that specifies the vertical\n            accuracy of the coordinates. Specify this key only if you specify\n            the alt key. Although many of the keys are optional, the more\n            information that you provide, the more accurate the location results\n            are. Although optional, you are encouraged to always specify the\n            user's geographical location. Providing the location is especially\n            important if the client's IP address does not accurately reflect the\n            user's physical location (for example, if the client uses VPN). For\n            optimal results, you should include this header and the\n            X-MSEdge-ClientIP header, but at a minimum, you should include this\n            header.\"\n          in: header\n          name: X-Search-Location\n          required: false\n          x-ms-client-name: Location\n          schema:\n            type: string\n        - description: A 2-character country code of the country where the results come\n            from. This API supports only the United States market. If you\n            specify this query parameter, it must be set to us. If you set this\n            parameter, you must also specify the Accept-Language header. Bing\n            uses the first supported language it finds from the languages list,\n            and combine that language with the country code that you specify to\n            determine the market to return results for. If the languages list\n            does not include a supported language, Bing finds the closest\n            language and market that supports the request, or it may use an\n            aggregated or default market for the results instead of a specified\n            one. You should use this query parameter and the Accept-Language\n            query parameter only if you specify multiple languages; otherwise,\n            you should use the mkt and setLang query parameters. This parameter\n            and the mkt query parameter are mutually exclusive—do not specify\n            both.\n          in: query\n          name: cc\n          required: false\n          x-ms-client-name: CountryCode\n          schema:\n            type: string\n          examples:\n            Successful query:\n              value: US\n        - description: The number of news articles to return in the response. The actual\n            number delivered may be less than requested. The default is 10 and\n            the maximum value is 100. The actual number delivered may be less\n            than requested.You may use this parameter along with the offset\n            parameter to page results. For example, if your user interface\n            displays 20 articles per page, set count to 20 and offset to 0 to\n            get the first page of results. For each subsequent page, increment\n            offset by 20 (for example, 0, 20, 40). It is possible for multiple\n            pages to include some overlap in results.\n          in: query\n          name: count\n          required: false\n          x-ms-client-name: Count\n          schema:\n            type: integer\n            format: int32\n        - description: \"The market where the results come from. Typically, mkt is the\n            country where the user is making the request from. However, it could\n            be a different country if the user is not located in a country where\n            Bing delivers results. The market must be in the form \u003clanguage\n            code\u003e-\u003ccountry code\u003e. For example, en-US. The string is case\n            insensitive. For a list of possible market values, see [Market\n            Codes](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/\\\n            bing-news-api-v7-reference#market-codes). NOTE: If known, you are\n            encouraged to always specify the market. Specifying the market helps\n            Bing route the request and return an appropriate and optimal\n            response. If you specify a market that is not listed in [Market\n            Codes](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/\\\n            bing-news-api-v7-reference#market-codes), Bing uses a best fit\n            market code based on an internal mapping that is subject to change.\n            This parameter and the\n            [cc](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/bi\\\n            ng-news-api-v7-reference#cc) query parameter are mutually\n            exclusive—do not specify both.\"\n          in: query\n          name: mkt\n          required: false\n          x-ms-client-name: Market\n          schema:\n            type: string\n          examples:\n            Successful query:\n              value: en-us\n        - description: The zero-based offset that indicates the number of news to skip\n            before returning news. The default is 0. The offset should be less\n            than\n            ([totalEstimatedMatches](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/bing-news-api-v7-reference#news-totalmatches)\n            - count). Use this parameter along with the count parameter to page\n            results. For example, if your user interface displays 20 news per\n            page, set count to 20 and offset to 0 to get the first page of\n            results. For each subsequent page, increment offset by 20 (for\n            example, 0, 20, 40). It is possible for multiple pages to include\n            some overlap in results.\n          in: query\n          name: offset\n          required: false\n          x-ms-client-name: Offset\n          schema:\n            type: integer\n            format: int32\n        - description: \"Filter news for adult content. The following are the possible\n            filter values. Off: Return news articles with adult text, images, or\n            videos. Moderate: Return news articles with adult text but not adult\n            images or videos. Strict: Do not return news articles with adult\n            text, images, or videos. If the request comes from a market that\n            Bing's adult policy requires that safeSearch is set to Strict, Bing\n            ignores the safeSearch value and uses Strict. If you use the site:\n            query operator, there is the chance that the response may contain\n            adult content regardless of what the safeSearch query parameter is\n            set to. Use site: only if you are aware of the content on the site\n            and your scenario supports the possibility of adult content.\"\n          in: query\n          name: safeSearch\n          required: false\n          x-ms-client-name: SafeSearch\n          x-ms-enum:\n            modelAsString: true\n            name: SafeSearch\n          schema:\n            type: string\n            enum:\n              - Off\n              - Moderate\n              - Strict\n        - description: The language to use for user interface strings. Specify the language\n            using the ISO 639-1 2-letter language code. For example, the\n            language code for English is EN. The default is EN (English).\n            Although optional, you should always specify the language.\n            Typically, you set setLang to the same language specified by mkt\n            unless the user wants the user interface strings displayed in a\n            different language. This parameter and the\n            [Accept-Language](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/bing-news-api-v7-reference#acceptlanguage)\n            header are mutually exclusive; do not specify both. A user interface\n            string is a string that's used as a label in a user interface. There\n            are few user interface strings in the JSON response objects. Also,\n            any links to Bing.com properties in the response objects apply the\n            specified language.\n          in: query\n          name: setLang\n          required: false\n          x-ms-client-name: SetLang\n          schema:\n            type: string\n          examples:\n            Successful query:\n              value: en\n        - description: The Unix epoch time (Unix timestamp) that Bing uses to select the\n            trending topics. Bing returns trending topics that it discovered on\n            or after the specified date and time, not the date the topic was\n            published. To use this parameter, also specify the sortBy parameter.\n            Use this parameter only with the News Trending Topics API. Do not\n            specify this parameter when calling the News Search API or News\n            Category API.\n          in: query\n          name: since\n          required: false\n          x-ms-client-name: Since\n          schema:\n            type: integer\n            format: int64\n        - description: \"The order to return the news in. The following are the possible\n            case-insensitive values. Date: If the request is through the News\n            Search API, the response returns news articles sorted by date from\n            the most recent to the oldest. If the request is through the News\n            Trending Topics API, the response returns trending topics sorted by\n            date from the most recent to the oldest.\"\n          in: query\n          name: sortBy\n          required: false\n          x-ms-client-name: SortBy\n          schema:\n            type: string\n        - description: A Boolean value that determines whether display strings contain\n            decoration markers such as hit highlighting characters. If true, the\n            strings may include markers. The default is false. To specify\n            whether to use Unicode characters or HTML tags as the markers, see\n            the\n            [textFormat](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/bing-news-api-v7-reference#textformat)\n            query parameter. For information about hit highlighting, see [Hit\n            Highlighting](https://docs.microsoft.com/azure/cognitive-services/bing-news-search/hit-highlighting).\n          in: query\n          name: textDecorations\n          required: false\n          x-ms-client-name: TextDecorations\n          schema:\n            type: boolean\n        - description: The type of markers to use for text decorations (see the\n            textDecorations query parameter). Possible values are Raw—Use\n            Unicode characters to mark content that needs special formatting.\n            The Unicode characters are in the range E000 through E019. For\n            example, Bing uses E000 and E001 to mark the beginning and end of\n            query terms for hit highlighting. HTML—Use HTML tags to mark content\n            that needs special formatting. For example, use \u003cb\u003e tags to\n            highlight query terms in display strings. The default is Raw. For\n            display strings that contain escapable HTML characters such as \u003c, \u003e,\n            and \u0026, if textFormat is set to HTML, Bing escapes the characters as\n            appropriate (for example, \u003c is escaped to \u0026lt;).\n          in: query\n          name: textFormat\n          required: false\n          x-ms-client-name: TextFormat\n          x-ms-enum:\n            modelAsString: true\n            name: TextFormat\n          schema:\n            type: string\n            enum:\n              - Raw\n              - Html\n      responses:\n        \"200\":\n          description: Success.\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/TrendingTopics\"\n              examples:\n                Successful query:\n                  $ref: \"#/components/examples/Successful_query\"\n        default:\n          description: An error has occurred. Check the response type and/or status code\n            for more details.\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/ErrorResponse\"\n      summary: The News Trending Topics API lets you search on Bing and get back a list\n        of trending news topics that are currently trending on Bing. This\n        section provides technical details about the query parameters and\n        headers that you use to request news and the JSON response objects that\n        contain them.  For examples that show how to make requests, see\n        [Searching the web for\n        news](https://docs.microsoft.com/en-us/azure/cognitive-services/bing-news-search/search-the-web).\n      tags:\n        - NewsTrendingTopics\nservers:\n  - url: https://api.cognitive.microsoft.com/bing/v7.0\n  - url: \"{Endpoint}/bing/v7.0\"\n    variables:\n      Endpoint:\n        default: https://api.cognitive.microsoft.com\n        description: 'Supported Cognitive Services endpoints (protocol and hostname, for\n          example: \"https://westus.api.cognitive.microsoft.com\",\n          \"https://api.cognitive.microsoft.com\").'\n        x-ms-parameter-location: client\n        x-ms-skip-url-encoding: true\ncomponents:\n  examples:\n    Successful_query:\n      value:\n        _type: TrendingTopics\n        value:\n          - _type: News/Topic\n            image:\n              _type: ImageObject\n              provider:\n                - _type: Organization\n                  name: © Leon Neal/AFP/Getty Images\n              url: https://www.bing.com/th?id=OPN.RTNews_ffDPbGlga7auVKMCVRmYdA\u0026c=7\u0026rs=2\u0026qlt=80\u0026pcl=f9f9f9\u0026pid=News\n            isBreakingNews: false\n            name: 1st fatal overdose?\n            newsSearchUrl: https://www.bing.com/news/search?q=First+marijuana+overdose\u0026form=TNSA02\u0026filters=tnTID%3a%22DF2B2270-F7AB-4b6d-B6C2-E6705CAC121F%22+tnVersion%3a%222214682%22+Segment%3a%22popularnow.carousel%22+tnCol%3a%220%22+tnScenario%3a%22TrendingTopicsAPI%22+tnOrder%3a%229b3211c9-158e-4564-8899-6f758d123e84%22\n            query:\n              text: First marijuana overdose\n            webSearchUrl: https://www.bing.com/search?q=First+marijuana+overdose\u0026form=TNSA01\u0026filters=tnTID%3a%22DF2B2270-F7AB-4b6d-B6C2-E6705CAC121F%22+tnVersion%3a%222214682%22+Segment%3a%22popularnow.carousel%22+tnCol%3a%220%22+tnScenario%3a%22TrendingTopicsAPI%22+tnOrder%3a%229b3211c9-158e-4564-8899-6f758d123e84%22\n          - _type: News/Topic\n            image:\n              _type: ImageObject\n              provider:\n                - _type: Organization\n                  name: © Ilya S. Savenok/FEHSF/Getty Images\n              url: https://www.bing.com/th?id=OPN.RTNews_gDx8xMp4ozOfAPvxuddEdw\u0026c=7\u0026rs=2\u0026qlt=80\u0026pcl=f9f9f9\u0026pid=News\n            isBreakingNews: false\n            name: Suffers cardiac event\n            newsSearchUrl: https://www.bing.com/news/search?q=Tom+Ridge\u0026form=TNSA02\u0026filters=tnTID%3a%22211EE3BA-A994-4533-864F-D1AA669AADE4%22+tnVersion%3a%222214682%22+Segment%3a%22popularnow.carousel%22+tnCol%3a%221%22+tnScenario%3a%22TrendingTopicsAPI%22+tnOrder%3a%229b3211c9-158e-4564-8899-6f758d123e84%22\n            query:\n              text: Tom Ridge\n            webSearchUrl: https://www.bing.com/search?q=Tom+Ridge\u0026form=TNSA01\u0026filters=tnTID%3a%22211EE3BA-A994-4533-864F-D1AA669AADE4%22+tnVersion%3a%222214682%22+Segment%3a%22popularnow.carousel%22+tnCol%3a%221%22+tnScenario%3a%22TrendingTopicsAPI%22+tnOrder%3a%229b3211c9-158e-4564-8899-6f758d123e84%22\n          - _type: News/Topic\n            image:\n              _type: ImageObject\n              provider:\n                - _type: Organization\n                  name: © AP Photo\n              url: https://www.bing.com/th?id=OPN.RTNews_TY9fYHZVSzGqcqECHNgpyQ\u0026c=7\u0026rs=2\u0026qlt=80\u0026pcl=f9f9f9\u0026pid=News\n            isBreakingNews: false\n            name: Manson still alive\n            newsSearchUrl: https://www.bing.com/news/search?q=Charles+Manson+Bakersfield+still+alive\u0026form=TNSA02\u0026filters=tnTID%3a%22A2638A2E-154F-41d0-A306-6B20062D4494%22+tnVersion%3a%222214682%22+Segment%3a%22popularnow.carousel%22+tnCol%3a%222%22+tnScenario%3a%22TrendingTopicsAPI%22+tnOrder%3a%229b3211c9-158e-4564-8899-6f758d123e84%22\n            query:\n              text: Charles Manson Bakersfield still alive\n            webSearchUrl: https://www.bing.com/search?q=Charles+Manson+Bakersfield+still+alive\u0026form=TNSA01\u0026filters=tnTID%3a%22A2638A2E-154F-41d0-A306-6B20062D4494%22+tnVersion%3a%222214682%22+Segment%3a%22popularnow.carousel%22+tnCol%3a%222%22+tnScenario%3a%22TrendingTopicsAPI%22+tnOrder%3a%229b3211c9-158e-4564-8899-6f758d123e84%22\n          - _type: News/Topic\n            image:\n              _type: ImageObject\n              provider:\n                - _type: Organization\n                  name: © Carlo Allegri/Reuters\n              url: https://www.bing.com/th?id=OPN.RTNews_Vy3FSPV-k2W269NnPf7i5Q\u0026c=7\u0026rs=2\u0026qlt=80\u0026pcl=f9f9f9\u0026pid=News\n            isBreakingNews: false\n            name: Kochs backing sale\n            newsSearchUrl: https://www.bing.com/news/search?q=Koch+Brothers\u0026form=TNSA02\u0026filters=tnTID%3a%22178FD502-59BD-4a17-89D3-49CF96025DF0%22+tnVersion%3a%222214682%22+Segment%3a%22popularnow.carousel%22+tnCol%3a%223%22+tnScenario%3a%22TrendingTopicsAPI%22+tnOrder%3a%229b3211c9-158e-4564-8899-6f758d123e84%22\n            query:\n              text: Koch Brothers\n            webSearchUrl: https://www.bing.com/search?q=Koch+Brothers\u0026form=TNSA01\u0026filters=tnTID%3a%22178FD502-59BD-4a17-89D3-49CF96025DF0%22+tnVersion%3a%222214682%22+Segment%3a%22popularnow.carousel%22+tnCol%3a%223%22+tnScenario%3a%22TrendingTopicsAPI%22+tnOrder%3a%229b3211c9-158e-4564-8899-6f758d123e84%22\n          - _type: News/Topic\n            image:\n              _type: ImageObject\n              provider:\n                - _type: Organization\n                  name: © AP\n              url: https://www.bing.com/th?id=OPN.RTNews_hE_gEJxcXVPPkBRYdra44A\u0026c=7\u0026rs=2\u0026qlt=80\u0026pcl=f9f9f9\u0026pid=News\n            isBreakingNews: false\n            name: Democratic mega-donor\n            newsSearchUrl: https://www.bing.com/news/search?q=Steve+Mostyn\u0026form=TNSA02\u0026filters=tnTID%3a%22B105C6CD-6361-47fc-B063-7C35458B7D41%22+tnVersion%3a%222214682%22+Segment%3a%22popularnow.carousel%22+tnCol%3a%224%22+tnScenario%3a%22TrendingTopicsAPI%22+tnOrder%3a%229b3211c9-158e-4564-8899-6f758d123e84%22\n            query:\n              text: Steve Mostyn\n            webSearchUrl: https://www.bing.com/search?q=Steve+Mostyn\u0026form=TNSA01\u0026filters=tnTID%3a%22B105C6CD-6361-47fc-B063-7C35458B7D41%22+tnVersion%3a%222214682%22+Segment%3a%22popularnow.carousel%22+tnCol%3a%224%22+tnScenario%3a%22TrendingTopicsAPI%22+tnOrder%3a%229b3211c9-158e-4564-8899-6f758d123e84%22\n  parameters:\n    x-bingapis-sdk:\n      description: Activate swagger compliance\n      in: header\n      name: X-BingApis-SDK\n      required: true\n      x-ms-enum:\n        modelAsString: true\n        name: XBingApisSDK\n      x-ms-parameter-location: method\n      schema:\n        type: string\n        enum:\n          - \"true\"\n      examples:\n        Successful query:\n          value: \"true\"\n  securitySchemes:\n    apiKeyHeader:\n      in: header\n      name: Ocp-Apim-Subscription-Key\n      type: apiKey\n  schemas:\n    Answer:\n      allOf:\n        - $ref: \"#/components/schemas/Response\"\n      description: Defines an answer.\n      properties:\n        followUpQueries:\n          items:\n            $ref: \"#/components/schemas/Query\"\n          readOnly: true\n          type: array\n      type: object\n    Article:\n      allOf:\n        - $ref: \"#/components/schemas/CreativeWork\"\n      properties:\n        wordCount:\n          description: The number of words in the text of the Article.\n          format: int32\n          readOnly: true\n          type: integer\n      type: object\n    CreativeWork:\n      allOf:\n        - $ref: \"#/components/schemas/Thing\"\n      description: The most generic kind of creative work, including books, movies,\n        photographs, software programs, etc.\n      properties:\n        datePublished:\n          description: The date on which the CreativeWork was published.\n          readOnly: true\n          type: string\n        provider:\n          description: The source of the creative work.\n          items:\n            $ref: \"#/components/schemas/Thing\"\n          readOnly: true\n          type: array\n        thumbnailUrl:\n          description: The URL to a thumbnail of the item.\n          readOnly: true\n          type: string\n        video:\n          $ref: \"#/components/schemas/VideoObject\"\n      type: object\n    Error:\n      description: Defines the error that occurred.\n      properties:\n        code:\n          default: None\n          description: The error code that identifies the category of error.\n          enum:\n            - None\n            - ServerError\n            - InvalidRequest\n            - RateLimitExceeded\n            - InvalidAuthorization\n            - InsufficientAuthorization\n          type: string\n          x-ms-enum:\n            modelAsString: true\n            name: ErrorCode\n        message:\n          description: A description of the error.\n          type: string\n        moreDetails:\n          description: A description that provides additional information about the error.\n          readOnly: true\n          type: string\n        parameter:\n          description: The parameter in the request that caused the error.\n          readOnly: true\n          type: string\n        subCode:\n          description: The error code that further helps to identify the error.\n          enum:\n            - UnexpectedError\n            - ResourceError\n            - NotImplemented\n            - ParameterMissing\n            - ParameterInvalidValue\n            - HttpNotAllowed\n            - Blocked\n            - AuthorizationMissing\n            - AuthorizationRedundancy\n            - AuthorizationDisabled\n            - AuthorizationExpired\n          readOnly: true\n          type: string\n          x-ms-enum:\n            modelAsString: true\n            name: ErrorSubCode\n        value:\n          description: The parameter's value in the request that was not valid.\n          readOnly: true\n          type: string\n      required:\n        - code\n        - message\n      type: object\n    ErrorResponse:\n      allOf:\n        - $ref: \"#/components/schemas/Response\"\n      description: The top-level response that represents a failed request.\n      properties:\n        errors:\n          description: A list of errors that describe the reasons why the request failed.\n          items:\n            $ref: \"#/components/schemas/Error\"\n          type: array\n      required:\n        - errors\n      type: object\n    Identifiable:\n      allOf:\n        - $ref: \"#/components/schemas/ResponseBase\"\n      description: Defines the identity of a resource.\n      properties:\n        id:\n          description: A String identifier.\n          readOnly: true\n          type: string\n      type: object\n    ImageObject:\n      allOf:\n        - $ref: \"#/components/schemas/MediaObject\"\n      description: Defines an image\n      properties:\n        thumbnail:\n          $ref: \"#/components/schemas/ImageObject\"\n      type: object\n    MediaObject:\n      allOf:\n        - $ref: \"#/components/schemas/CreativeWork\"\n      description: Defines a media object.\n      properties:\n        contentUrl:\n          description: Original URL to retrieve the source (file) for the media object (e.g\n            the source URL for the image).\n          readOnly: true\n          type: string\n        height:\n          description: The height of the source media object, in pixels.\n          format: int32\n          readOnly: true\n          type: integer\n        width:\n          description: The width of the source media object, in pixels.\n          format: int32\n          readOnly: true\n          type: integer\n      type: object\n    News:\n      allOf:\n        - $ref: \"#/components/schemas/SearchResultsAnswer\"\n      description: Defines a news answer.\n      properties:\n        location:\n          description: Location of local news\n          readOnly: true\n          type: string\n        value:\n          description: An array of NewsArticle objects that contain information about news\n            articles that are relevant to the query. If there are no results to\n            return for the request, the array is empty.\n          items:\n            $ref: \"#/components/schemas/NewsArticle\"\n          type: array\n      required:\n        - value\n      type: object\n    NewsArticle:\n      allOf:\n        - $ref: \"#/components/schemas/Article\"\n      description: Defines a news article.\n      properties:\n        category:\n          description: The news category that the article belongs to. For example, Sports.\n            If the news category cannot be determined, the article does not\n            include this field.\n          readOnly: true\n          type: string\n        clusteredArticles:\n          description: A list of related news articles.\n          items:\n            $ref: \"#/components/schemas/NewsArticle\"\n          readOnly: true\n          type: array\n        headline:\n          description: A Boolean value that indicates whether the news article is a\n            headline. If true, the article is a headline. The article includes\n            this field only for news categories requests that do not specify the\n            category query parameter.\n          readOnly: true\n          type: boolean\n      type: object\n    NewsTopic:\n      allOf:\n        - $ref: \"#/components/schemas/Thing\"\n      properties:\n        isBreakingNews:\n          description: A Boolean value that indicates whether the topic is considered\n            breaking news. If the topic is considered breaking news, the value\n            is true.\n          readOnly: true\n          type: boolean\n        newsSearchUrl:\n          description: The URL to the Bing News search results for the search query term\n          readOnly: true\n          type: string\n        query:\n          $ref: \"#/components/schemas/Query\"\n      type: object\n      x-ms-discriminator-value: News/Topic\n    Organization:\n      allOf:\n        - $ref: \"#/components/schemas/Thing\"\n      description: Defines an organization.\n      properties: {}\n      type: object\n    Query:\n      description: Defines a search query.\n      properties:\n        displayText:\n          description: The display version of the query term. This version of the query\n            term may contain special characters that highlight the search term\n            found in the query string. The string contains the highlighting\n            characters only if the query enabled hit highlighting\n          readOnly: true\n          type: string\n        searchLink:\n          description: The URL that you use to get the results of the related search.\n            Before using the URL, you must append query parameters as\n            appropriate and include the Ocp-Apim-Subscription-Key header. Use\n            this URL if you're displaying the results in your own user\n            interface. Otherwise, use the webSearchUrl URL.\n          readOnly: true\n          type: string\n        text:\n          description: The query string. Use this string as the query term in a new search\n            request.\n          type: string\n        thumbnail:\n          $ref: \"#/components/schemas/ImageObject\"\n        webSearchUrl:\n          description: The URL that takes the user to the Bing search results page for the\n            query.Only related search results include this field.\n          readOnly: true\n          type: string\n      required:\n        - text\n      type: object\n    Response:\n      allOf:\n        - $ref: \"#/components/schemas/Identifiable\"\n      description: Defines a response. All schemas that could be returned at the root of a\n        response should inherit from this\n      properties:\n        webSearchUrl:\n          description: The URL To Bing's search result for this item.\n          readOnly: true\n          type: string\n      type: object\n    ResponseBase:\n      description: Response base\n      discriminator:\n        propertyName: _type\n      properties:\n        _type:\n          type: string\n      required:\n        - _type\n      type: object\n    SearchResultsAnswer:\n      allOf:\n        - $ref: \"#/components/schemas/Answer\"\n      description: Defines a search result answer.\n      properties:\n        totalEstimatedMatches:\n          description: The estimated number of webpages that are relevant to the query. Use\n            this number along with the count and offset query parameters to page\n            the results.\n          format: int64\n          readOnly: true\n          type: integer\n      type: object\n    Thing:\n      allOf:\n        - $ref: \"#/components/schemas/Response\"\n      description: Defines a thing.\n      properties:\n        alternateName:\n          description: An alias for the item\n          readOnly: true\n          type: string\n        bingId:\n          description: An ID that uniquely identifies this item.\n          readOnly: true\n          type: string\n        description:\n          description: A short description of the item.\n          readOnly: true\n          type: string\n        image:\n          $ref: \"#/components/schemas/ImageObject\"\n        name:\n          description: The name of the thing represented by this object.\n          readOnly: true\n          type: string\n        url:\n          description: The URL to get more information about the thing represented by this\n            object.\n          readOnly: true\n          type: string\n      type: object\n    TrendingTopics:\n      allOf:\n        - $ref: \"#/components/schemas/Answer\"\n      properties:\n        value:\n          description: A list of trending news topics on Bing\n          items:\n            $ref: \"#/components/schemas/NewsTopic\"\n          type: array\n      required:\n        - value\n      type: object\n    VideoObject:\n      allOf:\n        - $ref: \"#/components/schemas/MediaObject\"\n      description: Defines a video object that is relevant to the query.\n      properties:\n        allowHttpsEmbed:\n          readOnly: true\n          type: boolean\n        allowMobileEmbed:\n          readOnly: true\n          type: boolean\n        embedHtml:\n          readOnly: true\n          type: string\n        isSuperfresh:\n          readOnly: true\n          type: boolean\n        motionThumbnailId:\n          readOnly: true\n          type: string\n        motionThumbnailUrl:\n          readOnly: true\n          type: string\n        thumbnail:\n          $ref: \"#/components/schemas/ImageObject\"\n        videoId:\n          readOnly: true\n          type: string\n        viewCount:\n          format: int32\n          readOnly: true\n          type: integer\n      type: object\n"
		}
	},
	"Error": "parse: parse spec: parse operations: paths: /news/search: get: operation \"News_Search\": parameters: parse parameter \"safeSearch\": schema: parse enum values: parse value \"false\": expected type \"string\", got \"bool\""
}