{
	"File": {
		"__typename": "FileMatch",
		"repository": {
			"name": "github.com/restful-ma/thresholds"
		},
		"file": {
			"name": "microsoft.com-cognitiveservices-AutoSuggest-1.0-swagger.yaml",
			"size": 0,
			"path": "benchmark-repository/openapi/microsoft.com-cognitiveservices-AutoSuggest-1.0-swagger.yaml",
			"byteSize": 31045,
			"content": "openapi: 3.0.0\ninfo:\n  contact:\n    x-twitter: microsoft\n  description: Autosuggest supplies search terms derived from a root text sent to the\n    service.  The terms Autosuggest supplies are related to the root text based\n    on similarity and their frequency or ratings of usefulness in other\n    searches. For examples that show how to use Autosuggest, see [Search using\n    AutoSuggest](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/bing-autosuggest-api-v7-reference).\n  title: AutoSuggest Client\n  version: \"1.0\"\n  x-apisguru-categories:\n    - cloud\n  x-logo:\n    url: https://twitter.com/microsoft/profile_image?size=original\n  x-origin:\n    - format: swagger\n      url: https://raw.githubusercontent.com/Azure/azure-rest-api-specs/master/specification/cognitiveservices/data-plane/AutoSuggest/stable/v1.0/AutoSuggest.json\n      version: \"2.0\"\n  x-providerName: microsoft.com\n  x-serviceName: cognitiveservices-AutoSuggest\n  x-tags:\n    - Microsoft\nsecurity:\n  - apiKeyHeader: []\npaths:\n  /Suggestions:\n    get:\n      operationId: AutoSuggest\n      parameters:\n        - $ref: \"#/components/parameters/x-bingapis-sdk\"\n        - description: The default media type is application/json. To specify that the\n            response use [JSON-LD](http://json-ld.org/), set the Accept header\n            to application/ld+json.\n          in: header\n          name: Accept\n          required: false\n          schema:\n            type: string\n        - description: A comma-delimited list of one or more languages to use for user\n            interface strings. The list is in decreasing order of preference.\n            For additional information, including expected format, see\n            [RFC2616](http://www.w3.org/Protocols/rfc2616/rfc2616-sec14.html).\n            This header and the setLang query parameter are mutually exclusive;\n            do not specify both. If you set this header, you must also specify\n            the\n            [cc](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/bing-autosuggest-api-v7-reference#cc)\n            query parameter. To determine the market to return results for, Bing\n            uses the first supported language it finds from the list and\n            combines it with the cc parameter value. If the list does not\n            include a supported language, Bing finds the closest language and\n            market that supports the request or it uses an aggregated or default\n            market for the results. To determine the market that Bing used, see\n            the BingAPIs-Market header. Use this header and the cc query\n            parameter only if you specify multiple languages. Otherwise, use the\n            [mkt](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/bing-autosuggest-api-v7-reference#mkt)\n            and\n            [setLang](https://docs.microsoft.com/en-us/rest/api/cognitiveservices/bing-autosuggest-api-v7-reference#setlang)\n            query parameters. A user interface string is a string that's used as\n            a label in a user interface. There are few user interface strings in\n            the JSON response objects. Any links to Bing.com properties in the\n            response objects apply the specified language.\n          in: header\n          name: Accept-Language\n          required: false\n          x-ms-client-name: AcceptLanguage\n          schema:\n            type: string\n        - description: \"By default, Bing returns cached content, if available. To prevent\n            Bing from returning cached content, set the Pragma header to\n            no-cache (for example, Pragma: no-cache).\"\n          in: header\n          name: Pragma\n          required: false\n          schema:\n            type: string\n        - description: \"The user agent originating the request. Bing uses the user agent to\n            provide mobile users with an optimized experience. Although\n            optional, you are encouraged to always specify this header. The\n            user-agent should be the same string that any commonly used browser\n            sends. For information about user agents, see [RFC\n            2616](http://www.w3.org/Protocols/rfc2616/rfc2616-sec14.html). The\n            following are examples of user-agent strings. Windows Phone:\n            Mozilla/5.0 (compatible; MSIE 10.0; Windows Phone 8.0; Trident/6.0;\n            IEMobile/10.0; ARM; Touch; NOKIA; Lumia 822). Android: Mozilla / 5.0\n            (Linux; U; Android 2.3.5; en - us; SCH - I500 Build / GINGERBREAD)\n            AppleWebKit / 533.1 (KHTML; like Gecko) Version / 4.0 Mobile Safari\n            / 533.1. iPhone: Mozilla / 5.0 (iPhone; CPU iPhone OS 6_1 like Mac\n            OS X) AppleWebKit / 536.26 (KHTML; like Gecko) Mobile / 10B142\n            iPhone4; 1 BingWeb / 3.03.1428.20120423. PC: Mozilla / 5.0 (Windows\n            NT 6.3; WOW64; Trident / 7.0; Touch; rv:11.0) like Gecko. iPad:\n            Mozilla / 5.0 (iPad; CPU OS 7_0 like Mac OS X) AppleWebKit /\n            537.51.1 (KHTML, like Gecko) Version / 7.0 Mobile / 11A465 Safari /\n            9537.53\"\n          in: header\n          name: User-Agent\n          required: false\n          x-ms-client-name: UserAgent\n          schema:\n            type: string\n        - description: \"Bing uses this header to provide users with consistent behavior\n            across Bing API calls. Bing often flights new features and\n            improvements, and it uses the client ID as a key for assigning\n            traffic on different flights. If you do not use the same client ID\n            for a user across multiple requests, then Bing may assign the user\n            to multiple conflicting flights. Being assigned to multiple\n            conflicting flights can lead to an inconsistent user experience. For\n            example, if the second request has a different flight assignment\n            than the first, the experience may be unexpected. Also, Bing can use\n            the client ID to tailor web results to that client ID’s search\n            history, providing a richer experience for the user. Bing also uses\n            this header to help improve result rankings by analyzing the\n            activity generated by a client ID. The relevance improvements help\n            with better quality of results delivered by Bing APIs and in turn\n            enables higher click-through rates for the API consumer. IMPORTANT:\n            Although optional, you should consider this header required.\n            Persisting the client ID across multiple requests for the same end\n            user and device combination enables 1) the API consumer to receive a\n            consistent user experience, and 2) higher click-through rates via\n            better quality of results from the Bing APIs. Each user that uses\n            your application on the device must have a unique, Bing generated\n            client ID. If you do not include this header in the request, Bing\n            generates an ID and returns it in the X-MSEdge-ClientID response\n            header. The only time that you should NOT include this header in a\n            request is the first time the user uses your app on that device. Use\n            the client ID for each Bing API request that your app makes for this\n            user on the device. Persist the client ID. To persist the ID in a\n            browser app, use a persistent HTTP cookie to ensure the ID is used\n            across all sessions. Do not use a session cookie. For other apps\n            such as mobile apps, use the device's persistent storage to persist\n            the ID. The next time the user uses your app on that device, get the\n            client ID that you persisted. Bing responses may or may not include\n            this header. If the response includes this header, capture the\n            client ID and use it for all subsequent Bing requests for the user\n            on that device. If you include the X-MSEdge-ClientID, you must not\n            include cookies in the request.\"\n          in: header\n          name: X-MSEdge-ClientID\n          required: false\n          x-ms-client-name: ClientId\n          schema:\n            type: string\n        - description: The IPv4 or IPv6 address of the client device. The IP address is\n            used to discover the user's location. Bing uses the location\n            information to determine safe search behavior. Although optional,\n            you are encouraged to always specify this header and the\n            X-Search-Location header. Do not obfuscate the address (for example,\n            by changing the last octet to 0). Obfuscating the address results in\n            the location not being anywhere near the device's actual location,\n            which may result in Bing serving erroneous results.\n          in: header\n          name: X-MSEdge-ClientIP\n          required: false\n          x-ms-client-name: ClientIp\n          schema:\n            type: string\n        - description: \"A semicolon-delimited list of key/value pairs that describe the\n            client's geographical location. Bing uses the location information\n            to determine safe search behavior and to return relevant local\n            content. Specify the key/value pair as \u003ckey\u003e:\u003cvalue\u003e. The following\n            are the keys that you use to specify the user's location. lat\n            (required): The latitude of the client's location, in degrees. The\n            latitude must be greater than or equal to -90.0 and less than or\n            equal to +90.0. Negative values indicate southern latitudes and\n            positive values indicate northern latitudes. long (required): The\n            longitude of the client's location, in degrees. The longitude must\n            be greater than or equal to -180.0 and less than or equal to +180.0.\n            Negative values indicate western longitudes and positive values\n            indicate eastern longitudes. re (required): The radius, in meters,\n            which specifies the horizontal accuracy of the coordinates. Pass the\n            value returned by the device's location service. Typical values\n            might be 22m for GPS/Wi-Fi, 380m for cell tower triangulation, and\n            18,000m for reverse IP lookup. ts (optional): The UTC UNIX timestamp\n            of when the client was at the location. (The UNIX timestamp is the\n            number of seconds since January 1, 1970.) head (optional): The\n            client's relative heading or direction of travel. Specify the\n            direction of travel as degrees from 0 through 360, counting\n            clockwise relative to true north. Specify this key only if the sp\n            key is nonzero. sp (optional): The horizontal velocity (speed), in\n            meters per second, that the client device is traveling. alt\n            (optional): The altitude of the client device, in meters. are\n            (optional): The radius, in meters, that specifies the vertical\n            accuracy of the coordinates. Specify this key only if you specify\n            the alt key. Although many of the keys are optional, the more\n            information that you provide, the more accurate the location results\n            are. Although optional, you are encouraged to always specify the\n            user's geographical location. Providing the location is especially\n            important if the client's IP address does not accurately reflect the\n            user's physical location (for example, if the client uses VPN). For\n            optimal results, you should include this header and the\n            X-MSEdge-ClientIP header, but at a minimum, you should include this\n            header.\"\n          in: header\n          name: X-Search-Location\n          required: false\n          x-ms-client-name: Location\n          schema:\n            type: string\n        - description: A 2-character country code of the country where the results come\n            from. This API supports only the United States market. If you\n            specify this query parameter, it must be set to us. If you set this\n            parameter, you must also specify the Accept-Language header. Bing\n            uses the first supported language it finds from the languages list,\n            and combine that language with the country code that you specify to\n            determine the market to return results for. If the languages list\n            does not include a supported language, Bing finds the closest\n            language and market that supports the request, or it may use an\n            aggregated or default market for the results instead of a specified\n            one. You should use this query parameter and the Accept-Language\n            query parameter only if you specify multiple languages; otherwise,\n            you should use the mkt and setLang query parameters. This parameter\n            and the mkt query parameter are mutually exclusive—do not specify\n            both.\n          in: query\n          name: cc\n          required: false\n          x-ms-client-name: CountryCode\n          schema:\n            type: string\n        - description: The market where the results come from. You are strongly encouraged\n            to always specify the market, if known. Specifying the market helps\n            Bing route the request and return an appropriate and optimal\n            response. This parameter and the cc query parameter are mutually\n            exclusive—do not specify both.\n          in: query\n          name: mkt\n          required: false\n          x-ms-client-name: Market\n          schema:\n            type: string\n            default: en-us\n        - description: The user's search term.\n          in: query\n          name: q\n          required: true\n          x-ms-client-name: Query\n          schema:\n            type: string\n          examples:\n            Successful query:\n              value: a\n        - description: \"Filter suggestions for adult content. The following are the\n            possible filter values. Off: Return suggestions with adult text,\n            images, or videos. Moderate: Return suggestion with adult text but\n            not adult images or videos. Strict: Do not return news articles with\n            adult text, images, or videos. If the request comes from a market\n            that Bing's adult policy requires that safeSearch is set to Strict,\n            Bing ignores the safeSearch value and uses Strict. If you use the\n            site: query operator, there is the chance that the response may\n            contain adult content regardless of what the safeSearch query\n            parameter is set to. Use site: only if you are aware of the content\n            on the site and your scenario supports the possibility of adult\n            content.\"\n          in: query\n          name: safeSearch\n          required: false\n          x-ms-client-name: SafeSearch\n          x-ms-enum:\n            modelAsString: true\n            name: SafeSearch\n          schema:\n            type: string\n            enum:\n              - Off\n              - Moderate\n              - Strict\n        - description: The language to use for user interface strings. Specify the language\n            using the ISO 639-1 2-letter language code. For example, the\n            language code for English is EN. The default is EN (English).\n            Although optional, you should always specify the language.\n            Typically, you set setLang to the same language specified by mkt\n            unless the user wants the user interface strings displayed in a\n            different language. This parameter and the Accept-Language header\n            are mutually exclusive; do not specify both. A user interface string\n            is a string that's used as a label in a user interface. There are\n            few user interface strings in the JSON response objects. Also, any\n            links to Bing.com properties in the response objects apply the\n            specified language.\n          in: query\n          name: setLang\n          required: false\n          x-ms-client-name: SetLang\n          schema:\n            type: string\n        - description: \"The media type to use for the response. The following are the\n            possible case-insensitive values: JSON, JSONLD. The default is JSON.\n            If you specify JSONLD, the response body includes JSON-LD objects\n            that contain the search results.\"\n          in: query\n          name: ResponseFormat\n          required: false\n          style: form\n          explode: false\n          schema:\n            type: array\n            items:\n              enum:\n                - Json\n                - JsonLd\n              type: string\n              x-ms-enum:\n                modelAsString: true\n                name: ResponseFormat\n      responses:\n        \"200\":\n          description: Success.\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/Suggestions\"\n              examples:\n                Successful query:\n                  $ref: \"#/components/examples/Successful_query\"\n        default:\n          description: An error has occurred. Check the response type and/or status code\n            for more details.\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/ErrorResponse\"\n      summary: The AutoSuggest API lets you send a search query to Bing and get back a\n        list of query suggestions. This section provides technical details about\n        the query parameters and headers that you use to request suggestions and\n        the JSON response objects that contain them.\n      tags:\n        - AutoSuggest\nservers:\n  - url: https://api.cognitive.microsoft.com/bing/v7.0\n  - url: \"{Endpoint}/bing/v7.0\"\n    variables:\n      Endpoint:\n        default: https://api.cognitive.microsoft.com\n        description: 'Supported Cognitive Services endpoints (protocol and hostname, for\n          example: \"https://westus.api.cognitive.microsoft.com\",\n          \"https://api.cognitive.microsoft.com\").'\n        x-ms-parameter-location: client\n        x-ms-skip-url-encoding: true\ncomponents:\n  examples:\n    Successful_query:\n      value:\n        _type: Suggestions\n        queryContext:\n          _type: QueryContext\n          originalQuery: a\n        suggestionGroups:\n          - _type: Suggestions/SuggestionGroup\n            name: Web\n            searchSuggestions:\n              - _type: SearchAction\n                displayText: amazon\n                query: amazon\n                searchKind: WebSearch\n                url: https://www.bing.com/search?q=amazon\u0026FORM=USBAPI\n              - _type: SearchAction\n                displayText: alaska airlines\n                query: alaska airlines\n                searchKind: WebSearch\n                url: https://www.bing.com/search?q=alaska+airlines\u0026FORM=USBAPI\n              - _type: SearchAction\n                displayText: aol\n                query: aol\n                searchKind: WebSearch\n                url: https://www.bing.com/search?q=aol\u0026FORM=USBAPI\n              - _type: SearchAction\n                displayText: amazon prime\n                query: amazon prime\n                searchKind: WebSearch\n                url: https://www.bing.com/search?q=amazon+prime\u0026FORM=USBAPI\n              - _type: SearchAction\n                displayText: airbnb\n                query: airbnb\n                searchKind: WebSearch\n                url: https://www.bing.com/search?q=airbnb\u0026FORM=USBAPI\n              - _type: SearchAction\n                displayText: american express\n                query: american express\n                searchKind: WebSearch\n                url: https://www.bing.com/search?q=american+express\u0026FORM=USBAPI\n              - _type: SearchAction\n                displayText: autotrader\n                query: autotrader\n                searchKind: WebSearch\n                url: https://www.bing.com/search?q=autotrader\u0026FORM=USBAPI\n              - _type: SearchAction\n                displayText: autozone\n                query: autozone\n                searchKind: WebSearch\n                url: https://www.bing.com/search?q=autozone\u0026FORM=USBAPI\n  parameters:\n    x-bingapis-sdk:\n      description: Activate swagger compliance\n      in: header\n      name: X-BingApis-SDK\n      required: true\n      x-ms-enum:\n        modelAsString: true\n        name: XBingApisSDK\n      x-ms-parameter-location: method\n      schema:\n        type: string\n        enum:\n          - \"true\"\n      examples:\n        Successful query:\n          value: \"true\"\n  securitySchemes:\n    apiKeyHeader:\n      in: header\n      name: Ocp-Apim-Subscription-Key\n      type: apiKey\n  schemas:\n    Action:\n      allOf:\n        - $ref: \"#/components/schemas/CreativeWork\"\n      properties:\n        displayName:\n          readOnly: true\n          type: string\n        isTopAction:\n          readOnly: true\n          type: boolean\n        result:\n          items:\n            $ref: \"#/components/schemas/Thing\"\n          readOnly: true\n          type: array\n        serviceUrl:\n          readOnly: true\n          type: string\n      type: object\n    Answer:\n      allOf:\n        - $ref: \"#/components/schemas/Response\"\n      description: Defines an answer.\n      properties: {}\n      type: object\n    CreativeWork:\n      allOf:\n        - $ref: \"#/components/schemas/Thing\"\n      description: The most generic kind of creative work, including books, movies,\n        photographs, software programs, etc.\n      properties:\n        about:\n          description: For internal use only.\n          items:\n            $ref: \"#/components/schemas/Thing\"\n          readOnly: true\n          type: array\n        commentCount:\n          format: int32\n          readOnly: true\n          type: integer\n        copyrightHolder:\n          $ref: \"#/components/schemas/Thing\"\n        copyrightYear:\n          format: int32\n          readOnly: true\n          type: integer\n        creator:\n          $ref: \"#/components/schemas/Thing\"\n        disclaimer:\n          readOnly: true\n          type: string\n        discussionUrl:\n          readOnly: true\n          type: string\n        genre:\n          items:\n            type: string\n          readOnly: true\n          type: array\n        headLine:\n          readOnly: true\n          type: string\n        isAccessibleForFree:\n          readOnly: true\n          type: boolean\n        isFamilyFriendly:\n          readOnly: true\n          type: boolean\n        mainEntity:\n          $ref: \"#/components/schemas/Thing\"\n        mentions:\n          description: For internal use only.\n          items:\n            $ref: \"#/components/schemas/Thing\"\n          readOnly: true\n          type: array\n        provider:\n          description: The source of the creative work.\n          items:\n            $ref: \"#/components/schemas/Thing\"\n          readOnly: true\n          type: array\n        text:\n          description: Text content of this creative work\n          readOnly: true\n          type: string\n        thumbnailUrl:\n          description: The URL to a thumbnail of the item.\n          readOnly: true\n          type: string\n      type: object\n    Error:\n      description: Defines the error that occurred.\n      discriminator:\n        propertyName: _type\n      properties:\n        _type:\n          type: string\n        code:\n          default: None\n          description: The error code that identifies the category of error.\n          enum:\n            - None\n            - ServerError\n            - InvalidRequest\n            - RateLimitExceeded\n            - InvalidAuthorization\n            - InsufficientAuthorization\n          type: string\n          x-ms-enum:\n            modelAsString: true\n            name: ErrorCode\n        message:\n          description: A description of the error.\n          type: string\n        moreDetails:\n          description: A description that provides additional information about the error.\n          readOnly: true\n          type: string\n        parameter:\n          description: The parameter in the request that caused the error.\n          readOnly: true\n          type: string\n        value:\n          description: The parameter's value in the request that was not valid.\n          readOnly: true\n          type: string\n      required:\n        - code\n        - message\n        - _type\n      type: object\n    ErrorResponse:\n      allOf:\n        - $ref: \"#/components/schemas/Response\"\n      description: The top-level response that represents a failed request.\n      properties:\n        errors:\n          description: A list of errors that describe the reasons why the request failed.\n          items:\n            $ref: \"#/components/schemas/Error\"\n          type: array\n      required:\n        - errors\n      type: object\n    Identifiable:\n      allOf:\n        - $ref: \"#/components/schemas/ResponseBase\"\n      description: Defines the identity of a resource.\n      properties:\n        id:\n          description: A String identifier.\n          readOnly: true\n          type: string\n      type: object\n    QueryContext:\n      description: Defines the query context that Bing used for the request.\n      discriminator:\n        propertyName: _type\n      properties:\n        _type:\n          type: string\n        adultIntent:\n          description: A Boolean value that indicates whether the specified query has adult\n            intent. The value is true if the query has adult intent; otherwise,\n            false.\n          readOnly: true\n          type: boolean\n        alterationOverrideQuery:\n          description: The query string to use to force Bing to use the original string.\n            For example, if the query string is \"saling downwind\", the override\n            query string will be \"+saling downwind\". Remember to encode the\n            query string which results in \"%2Bsaling+downwind\". This field is\n            included only if the original query string contains a spelling\n            mistake.\n          readOnly: true\n          type: string\n        alteredQuery:\n          description: The query string used by Bing to perform the query. Bing uses the\n            altered query string if the original query string contained spelling\n            mistakes. For example, if the query string is \"saling downwind\", the\n            altered query string will be \"sailing downwind\". This field is\n            included only if the original query string contains a spelling\n            mistake.\n          readOnly: true\n          type: string\n        askUserForLocation:\n          description: A Boolean value that indicates whether Bing requires the user's\n            location to provide accurate results. If you specified the user's\n            location by using the X-MSEdge-ClientIP and X-Search-Location\n            headers, you can ignore this field. For location aware queries, such\n            as \"today's weather\" or \"restaurants near me\" that need the user's\n            location to provide accurate results, this field is set to true. For\n            location aware queries that include the location (for example,\n            \"Seattle weather\"), this field is set to false. This field is also\n            set to false for queries that are not location aware, such as \"best\n            sellers\".\n          readOnly: true\n          type: boolean\n        isTransactional:\n          readOnly: true\n          type: boolean\n        originalQuery:\n          description: The query string as specified in the request.\n          type: string\n      required:\n        - originalQuery\n        - _type\n      type: object\n    Response:\n      allOf:\n        - $ref: \"#/components/schemas/Identifiable\"\n      description: Defines a response. All schemas that could be returned at the root of a\n        response should inherit from this\n      properties:\n        adaptiveCard:\n          readOnly: true\n          type: string\n        immediateAction:\n          items:\n            $ref: \"#/components/schemas/Action\"\n          readOnly: true\n          type: array\n        potentialAction:\n          items:\n            $ref: \"#/components/schemas/Action\"\n          readOnly: true\n          type: array\n        preferredClickthroughUrl:\n          readOnly: true\n          type: string\n        readLink:\n          description: The URL that returns this resource.\n          readOnly: true\n          type: string\n        webSearchUrl:\n          description: The URL To Bing's search result for this item.\n          readOnly: true\n          type: string\n      type: object\n    ResponseBase:\n      description: Response base\n      discriminator:\n        propertyName: _type\n      properties:\n        _type:\n          type: string\n      required:\n        - _type\n      type: object\n    SearchAction:\n      allOf:\n        - $ref: \"#/components/schemas/Action\"\n      properties:\n        displayText:\n          readOnly: true\n          type: string\n        query:\n          readOnly: true\n          type: string\n        searchKind:\n          default: WebSearch\n          enum:\n            - WebSearch\n            - HistorySearch\n            - DocumentSearch\n            - TagSearch\n            - LocationSearch\n            - CustomSearch\n          readOnly: true\n          type: string\n          x-ms-enum:\n            modelAsString: true\n            name: SearchKind\n      type: object\n    SearchResultsAnswer:\n      allOf:\n        - $ref: \"#/components/schemas/Answer\"\n      description: Defines a search result answer.\n      properties:\n        queryContext:\n          $ref: \"#/components/schemas/QueryContext\"\n      type: object\n    Suggestions:\n      allOf:\n        - $ref: \"#/components/schemas/SearchResultsAnswer\"\n      properties:\n        suggestionGroups:\n          items:\n            $ref: \"#/components/schemas/SuggestionsSuggestionGroup\"\n          type: array\n      required:\n        - suggestionGroups\n      type: object\n    SuggestionsSuggestionGroup:\n      discriminator:\n        propertyName: _type\n      properties:\n        _type:\n          type: string\n        name:\n          default: Unknown\n          enum:\n            - Unknown\n            - Web\n            - StoreApps\n            - SearchHistory\n            - PersonalSearchDocuments\n            - PersonalSearchTags\n            - Custom\n          type: string\n          x-ms-enum:\n            modelAsString: true\n            name: ScenarioType\n        searchSuggestions:\n          items:\n            $ref: \"#/components/schemas/SearchAction\"\n          type: array\n      required:\n        - name\n        - searchSuggestions\n        - _type\n      type: object\n      x-ms-discriminator-value: Suggestions/SuggestionGroup\n    Thing:\n      allOf:\n        - $ref: \"#/components/schemas/Response\"\n      description: Defines a thing.\n      properties:\n        url:\n          description: The URL to get more information about the thing represented by this\n            object.\n          readOnly: true\n          type: string\n      type: object\n"
		}
	},
	"Error": "parse: parse spec: parse operations: paths: /Suggestions: get: operation \"AutoSuggest\": parameters: parse parameter \"safeSearch\": schema: parse enum values: parse value \"false\": expected type \"string\", got \"bool\""
}