{
	"File": {
		"__typename": "FileMatch",
		"repository": {
			"name": "github.com/stackql/stackql-provider-registry"
		},
		"file": {
			"name": "cloudtrace.yaml",
			"size": 0,
			"path": "providers/src/googleapis.com/v1.0.1/services/cloudtrace.yaml",
			"byteSize": 25859,
			"content": "components:\n  parameters:\n    _.xgafv:\n      description: V1 error format.\n      in: query\n      name: _.xgafv\n      schema:\n        enum:\n          - '1'\n          - '2'\n        type: string\n    access_token:\n      description: OAuth access token.\n      in: query\n      name: access_token\n      schema:\n        type: string\n    alt:\n      description: Data format for response.\n      in: query\n      name: alt\n      schema:\n        enum:\n          - json\n          - media\n          - proto\n        type: string\n    callback:\n      description: JSONP\n      in: query\n      name: callback\n      schema:\n        type: string\n    fields:\n      description: Selector specifying which fields to include in a partial response.\n      in: query\n      name: fields\n      schema:\n        type: string\n    key:\n      description: API key. Your API key identifies your project and provides you with API access, quota, and reports. Required unless you provide an OAuth 2.0 token.\n      in: query\n      name: key\n      schema:\n        type: string\n    oauth_token:\n      description: OAuth 2.0 token for the current user.\n      in: query\n      name: oauth_token\n      schema:\n        type: string\n    prettyPrint:\n      description: Returns response with indentations and line breaks.\n      in: query\n      name: prettyPrint\n      schema:\n        type: boolean\n    quotaUser:\n      description: Available to use for quota purposes for server-side applications. Can be any arbitrary string assigned to a user, but should not exceed 40 characters.\n      in: query\n      name: quotaUser\n      schema:\n        type: string\n    uploadType:\n      description: Legacy upload protocol for media (e.g. \"media\", \"multipart\").\n      in: query\n      name: uploadType\n      schema:\n        type: string\n    upload_protocol:\n      description: Upload protocol for media (e.g. \"raw\", \"multipart\").\n      in: query\n      name: upload_protocol\n      schema:\n        type: string\n  schemas:\n    Annotation:\n      description: Text annotation with a set of attributes.\n      id: Annotation\n      properties:\n        attributes:\n          $ref: '#/components/schemas/Attributes'\n          description: A set of attributes on the annotation. You can have up to 4 attributes per Annotation.\n        description:\n          $ref: '#/components/schemas/TruncatableString'\n          description: A user-supplied message describing the event. The maximum length for the description is 256 bytes.\n      type: object\n    AttributeValue:\n      description: The allowed types for `[VALUE]` in a `[KEY]:[VALUE]` attribute.\n      id: AttributeValue\n      properties:\n        boolValue:\n          description: A Boolean value represented by `true` or `false`.\n          type: boolean\n        intValue:\n          description: A 64-bit signed integer.\n          format: int64\n          type: string\n        stringValue:\n          $ref: '#/components/schemas/TruncatableString'\n          description: A string up to 256 bytes long.\n      type: object\n    Attributes:\n      description: A set of attributes as key-value pairs.\n      id: Attributes\n      properties:\n        attributeMap:\n          additionalProperties:\n            $ref: '#/components/schemas/AttributeValue'\n          description: 'A set of attributes. Each attribute''s key can be up to 128 bytes long. The value can be a string up to 256 bytes, a signed 64-bit integer, or the boolean values `true` or `false`. For example: \"/instance_id\": { \"string_value\": { \"value\": \"my-instance\" } } \"/http/request_bytes\": { \"int_value\": 300 } \"abc.com/myattribute\": { \"bool_value\": false }'\n          type: object\n        droppedAttributesCount:\n          description: The number of attributes that were discarded. Attributes can be discarded because their keys are too long or because there are too many attributes. If this value is 0 then all attributes are valid.\n          format: int32\n          type: integer\n      type: object\n    BatchWriteSpansRequest:\n      description: The request message for the `BatchWriteSpans` method.\n      id: BatchWriteSpansRequest\n      properties:\n        spans:\n          description: Required. A list of new spans. The span names must not match existing spans, otherwise the results are undefined.\n          items:\n            $ref: '#/components/schemas/Span'\n          type: array\n      type: object\n    Empty:\n      description: 'A generic empty message that you can re-use to avoid defining duplicated empty messages in your APIs. A typical example is to use it as the request or the response type of an API method. For instance: service Foo { rpc Bar(google.protobuf.Empty) returns (google.protobuf.Empty); }'\n      id: Empty\n      properties: {}\n      type: object\n    Link:\n      description: A pointer from the current span to another span in the same trace or in a different trace. For example, this can be used in batching operations, where a single batch handler processes multiple requests from different traces or when the handler receives a request from a different project.\n      id: Link\n      properties:\n        attributes:\n          $ref: '#/components/schemas/Attributes'\n          description: A set of attributes on the link. Up to 32 attributes can be specified per link.\n        spanId:\n          description: The `[SPAN_ID]` for a span within a trace.\n          type: string\n        traceId:\n          description: The `[TRACE_ID]` for a trace within a project.\n          type: string\n        type:\n          description: The relationship of the current span relative to the linked span.\n          enum:\n            - TYPE_UNSPECIFIED\n            - CHILD_LINKED_SPAN\n            - PARENT_LINKED_SPAN\n          enumDescriptions:\n            - The relationship of the two spans is unknown.\n            - The linked span is a child of the current span.\n            - The linked span is a parent of the current span.\n          type: string\n      type: object\n    Links:\n      description: A collection of links, which are references from this span to a span in the same or different trace.\n      id: Links\n      properties:\n        droppedLinksCount:\n          description: The number of dropped links after the maximum size was enforced. If this value is 0, then no links were dropped.\n          format: int32\n          type: integer\n        link:\n          description: A collection of links.\n          items:\n            $ref: '#/components/schemas/Link'\n          type: array\n      type: object\n    MessageEvent:\n      description: An event describing a message sent/received between Spans.\n      id: MessageEvent\n      properties:\n        compressedSizeBytes:\n          description: The number of compressed bytes sent or received. If missing, the compressed size is assumed to be the same size as the uncompressed size.\n          format: int64\n          type: string\n        id:\n          description: An identifier for the MessageEvent's message that can be used to match `SENT` and `RECEIVED` MessageEvents.\n          format: int64\n          type: string\n        type:\n          description: Type of MessageEvent. Indicates whether the message was sent or received.\n          enum:\n            - TYPE_UNSPECIFIED\n            - SENT\n            - RECEIVED\n          enumDescriptions:\n            - Unknown event type.\n            - Indicates a sent message.\n            - Indicates a received message.\n          type: string\n        uncompressedSizeBytes:\n          description: The number of uncompressed bytes sent or received.\n          format: int64\n          type: string\n      type: object\n    Module:\n      description: Binary module.\n      id: Module\n      properties:\n        buildId:\n          $ref: '#/components/schemas/TruncatableString'\n          description: A unique identifier for the module, usually a hash of its contents (up to 128 bytes).\n        module:\n          $ref: '#/components/schemas/TruncatableString'\n          description: 'For example: main binary, kernel modules, and dynamic libraries such as libc.so, sharedlib.so (up to 256 bytes).'\n      type: object\n    Span:\n      description: A span represents a single operation within a trace. Spans can be nested to form a trace tree. Often, a trace contains a root span that describes the end-to-end latency, and one or more subspans for its sub-operations. A trace can also contain multiple root spans, or none at all. Spans do not need to be contiguous—there might be gaps or overlaps between spans in a trace.\n      id: Span\n      properties:\n        attributes:\n          $ref: '#/components/schemas/Attributes'\n          description: A set of attributes on the span. You can have up to 32 attributes per span.\n        childSpanCount:\n          description: Optional. The number of child spans that were generated while this span was active. If set, allows implementation to detect missing child spans.\n          format: int32\n          type: integer\n        displayName:\n          $ref: '#/components/schemas/TruncatableString'\n          description: Required. A description of the span's operation (up to 128 bytes). Cloud Trace displays the description in the Cloud console. For example, the display name can be a qualified method name or a file name and a line number where the operation is called. A best practice is to use the same display name within an application and at the same call point. This makes it easier to correlate spans in different traces.\n        endTime:\n          description: Required. The end time of the span. On the client side, this is the time kept by the local machine where the span execution ends. On the server side, this is the time when the server application handler stops running.\n          format: google-datetime\n          type: string\n        links:\n          $ref: '#/components/schemas/Links'\n          description: Links associated with the span. You can have up to 128 links per Span.\n        name:\n          description: 'Required. The resource name of the span in the following format: * `projects/[PROJECT_ID]/traces/[TRACE_ID]/spans/[SPAN_ID]` `[TRACE_ID]` is a unique identifier for a trace within a project; it is a 32-character hexadecimal encoding of a 16-byte array. It should not be zero. `[SPAN_ID]` is a unique identifier for a span within a trace; it is a 16-character hexadecimal encoding of an 8-byte array. It should not be zero. .'\n          type: string\n        parentSpanId:\n          description: The `[SPAN_ID]` of this span's parent span. If this is a root span, then this field must be empty.\n          type: string\n        sameProcessAsParentSpan:\n          description: Optional. Set this parameter to indicate whether this span is in the same process as its parent. If you do not set this parameter, Trace is unable to take advantage of this helpful information.\n          type: boolean\n        spanId:\n          description: Required. The `[SPAN_ID]` portion of the span's resource name.\n          type: string\n        spanKind:\n          description: Optional. Distinguishes between spans generated in a particular context. For example, two spans with the same name may be distinguished using `CLIENT` (caller) and `SERVER` (callee) to identify an RPC call.\n          enum:\n            - SPAN_KIND_UNSPECIFIED\n            - INTERNAL\n            - SERVER\n            - CLIENT\n            - PRODUCER\n            - CONSUMER\n          enumDescriptions:\n            - Unspecified. Do NOT use as default. Implementations MAY assume SpanKind.INTERNAL to be default.\n            - Indicates that the span is used internally. Default value.\n            - Indicates that the span covers server-side handling of an RPC or other remote network request.\n            - Indicates that the span covers the client-side wrapper around an RPC or other remote request.\n            - Indicates that the span describes producer sending a message to a broker. Unlike client and server, there is no direct critical path latency relationship between producer and consumer spans (e.g. publishing a message to a pubsub service).\n            - Indicates that the span describes consumer receiving a message from a broker. Unlike client and server, there is no direct critical path latency relationship between producer and consumer spans (e.g. receiving a message from a pubsub service subscription).\n          type: string\n        stackTrace:\n          $ref: '#/components/schemas/StackTrace'\n          description: Stack trace captured at the start of the span.\n        startTime:\n          description: Required. The start time of the span. On the client side, this is the time kept by the local machine where the span execution starts. On the server side, this is the time when the server's application handler starts running.\n          format: google-datetime\n          type: string\n        status:\n          $ref: '#/components/schemas/Status'\n          description: Optional. The final status for this span.\n        timeEvents:\n          $ref: '#/components/schemas/TimeEvents'\n          description: A set of time events. You can have up to 32 annotations and 128 message events per span.\n      type: object\n    StackFrame:\n      description: Represents a single stack frame in a stack trace.\n      id: StackFrame\n      properties:\n        columnNumber:\n          description: The column number where the function call appears, if available. This is important in JavaScript because of its anonymous functions.\n          format: int64\n          type: string\n        fileName:\n          $ref: '#/components/schemas/TruncatableString'\n          description: The name of the source file where the function call appears (up to 256 bytes).\n        functionName:\n          $ref: '#/components/schemas/TruncatableString'\n          description: The fully-qualified name that uniquely identifies the function or method that is active in this frame (up to 1024 bytes).\n        lineNumber:\n          description: The line number in `file_name` where the function call appears.\n          format: int64\n          type: string\n        loadModule:\n          $ref: '#/components/schemas/Module'\n          description: The binary module from where the code was loaded.\n        originalFunctionName:\n          $ref: '#/components/schemas/TruncatableString'\n          description: An un-mangled function name, if `function_name` is [mangled](http://www.avabodh.com/cxxin/namemangling.html). The name can be fully-qualified (up to 1024 bytes).\n        sourceVersion:\n          $ref: '#/components/schemas/TruncatableString'\n          description: The version of the deployed source code (up to 128 bytes).\n      type: object\n    StackFrames:\n      description: A collection of stack frames, which can be truncated.\n      id: StackFrames\n      properties:\n        droppedFramesCount:\n          description: The number of stack frames that were dropped because there were too many stack frames. If this value is 0, then no stack frames were dropped.\n          format: int32\n          type: integer\n        frame:\n          description: Stack frames in this call stack.\n          items:\n            $ref: '#/components/schemas/StackFrame'\n          type: array\n      type: object\n    StackTrace:\n      description: A call stack appearing in a trace.\n      id: StackTrace\n      properties:\n        stackFrames:\n          $ref: '#/components/schemas/StackFrames'\n          description: Stack frames in this stack trace. A maximum of 128 frames are allowed.\n        stackTraceHashId:\n          description: The hash ID is used to conserve network bandwidth for duplicate stack traces within a single trace. Often multiple spans will have identical stack traces. The first occurrence of a stack trace should contain both the `stackFrame` content and a value in `stackTraceHashId`. Subsequent spans within the same request can refer to that stack trace by only setting `stackTraceHashId`.\n          format: int64\n          type: string\n      type: object\n    Status:\n      description: 'The `Status` type defines a logical error model that is suitable for different programming environments, including REST APIs and RPC APIs. It is used by [gRPC](https://github.com/grpc). Each `Status` message contains three pieces of data: error code, error message, and error details. You can find out more about this error model and how to work with it in the [API Design Guide](https://cloud.google.com/apis/design/errors).'\n      id: Status\n      properties:\n        code:\n          description: The status code, which should be an enum value of google.rpc.Code.\n          format: int32\n          type: integer\n        details:\n          description: A list of messages that carry the error details. There is a common set of message types for APIs to use.\n          items:\n            additionalProperties:\n              description: Properties of the object. Contains field @type with type URL.\n              type: any\n            type: object\n          type: array\n        message:\n          description: A developer-facing error message, which should be in English. Any user-facing error message should be localized and sent in the google.rpc.Status.details field, or localized by the client.\n          type: string\n      type: object\n    TimeEvent:\n      description: A time-stamped annotation or message event in the Span.\n      id: TimeEvent\n      properties:\n        annotation:\n          $ref: '#/components/schemas/Annotation'\n          description: Text annotation with a set of attributes.\n        messageEvent:\n          $ref: '#/components/schemas/MessageEvent'\n          description: An event describing a message sent/received between Spans.\n        time:\n          description: The timestamp indicating the time the event occurred.\n          format: google-datetime\n          type: string\n      type: object\n    TimeEvents:\n      description: A collection of `TimeEvent`s. A `TimeEvent` is a time-stamped annotation on the span, consisting of either user-supplied key:value pairs, or details of a message sent/received between Spans.\n      id: TimeEvents\n      properties:\n        droppedAnnotationsCount:\n          description: The number of dropped annotations in all the included time events. If the value is 0, then no annotations were dropped.\n          format: int32\n          type: integer\n        droppedMessageEventsCount:\n          description: The number of dropped message events in all the included time events. If the value is 0, then no message events were dropped.\n          format: int32\n          type: integer\n        timeEvent:\n          description: A collection of `TimeEvent`s.\n          items:\n            $ref: '#/components/schemas/TimeEvent'\n          type: array\n      type: object\n    TruncatableString:\n      description: Represents a string that might be shortened to a specified length.\n      id: TruncatableString\n      properties:\n        truncatedByteCount:\n          description: The number of bytes removed from the original string. If this value is 0, then the string was not shortened.\n          format: int32\n          type: integer\n        value:\n          description: The shortened string. For example, if the original string is 500 bytes long and the limit of the string is 128 bytes, then `value` contains the first 128 bytes of the 500-byte string. Truncation always happens on a UTF8 character boundary. If there are multi-byte characters in the string, then the length of the shortened string might be less than the size limit.\n          type: string\n      type: object\n  securitySchemes:\n    Oauth2:\n      description: Oauth 2.0 implicit authentication\n      flows:\n        implicit:\n          authorizationUrl: https://accounts.google.com/o/oauth2/auth\n          scopes:\n            https://www.googleapis.com/auth/cloud-platform: See, edit, configure, and delete your Google Cloud data and see the email address for your Google Account.\n            https://www.googleapis.com/auth/trace.append: Write Trace data for a project or application\n      type: oauth2\n    Oauth2c:\n      description: Oauth 2.0 authorization code authentication\n      flows:\n        authorizationCode:\n          authorizationUrl: https://accounts.google.com/o/oauth2/auth\n          scopes:\n            https://www.googleapis.com/auth/cloud-platform: See, edit, configure, and delete your Google Cloud data and see the email address for your Google Account.\n            https://www.googleapis.com/auth/trace.append: Write Trace data for a project or application\n          tokenUrl: https://accounts.google.com/o/oauth2/token\n      type: oauth2\n  x-stackQL-resources:\n    spans_span:\n      id: google.cloudtrace.spans_span\n      name: spans_span\n      title: Spans_span\n      methods:\n        projects_traces_spans_createSpan:\n          operation:\n            $ref: '#/paths/~1v2~1projects~1{projectsId}~1traces~1{tracesId}~1spans~1{spansId}/post'\n          response:\n            mediaType: application/json\n            openAPIDocKey: '200'\n      sqlVerbs:\n        select: []\n        insert:\n          - $ref: '#/components/x-stackQL-resources/spans_span/methods/projects_traces_spans_createSpan'\n        update: []\n        delete: []\n    traces:\n      id: google.cloudtrace.traces\n      name: traces\n      title: Traces\n      methods:\n        projects_traces_batchWrite:\n          operation:\n            $ref: '#/paths/~1v2~1projects~1{projectsId}~1traces:batchWrite/post'\n          response:\n            mediaType: application/json\n            openAPIDocKey: '200'\n      sqlVerbs:\n        select: []\n        insert: []\n        update: []\n        delete: []\nexternalDocs:\n  url: https://cloud.google.com/trace\ninfo:\n  description: 'Sends application trace data to Cloud Trace for viewing. Trace data is collected for all App Engine applications by default. Trace data from other applications can be provided using this API. This library is used to interact with the Cloud Trace API directly. If you are looking to instrument your application for Cloud Trace, we recommend using OpenTelemetry. '\n  title: Cloud Trace API\n  version: v2\nopenapi: 3.1.0\npaths:\n  /v2/projects/{projectsId}/traces/{tracesId}/spans/{spansId}:\n    parameters:\n      - $ref: '#/components/parameters/upload_protocol'\n      - $ref: '#/components/parameters/callback'\n      - $ref: '#/components/parameters/fields'\n      - $ref: '#/components/parameters/uploadType'\n      - $ref: '#/components/parameters/key'\n      - $ref: '#/components/parameters/oauth_token'\n      - $ref: '#/components/parameters/_.xgafv'\n      - $ref: '#/components/parameters/prettyPrint'\n      - $ref: '#/components/parameters/alt'\n      - $ref: '#/components/parameters/quotaUser'\n      - $ref: '#/components/parameters/access_token'\n    post:\n      description: Creates a new span.\n      operationId: cloudtrace.projects.traces.spans.createSpan\n      parameters:\n        - description: 'Required. The resource name of the span in the following format: * `projects/[PROJECT_ID]/traces/[TRACE_ID]/spans/[SPAN_ID]` `[TRACE_ID]` is a unique identifier for a trace within a project; it is a 32-character hexadecimal encoding of a 16-byte array. It should not be zero. `[SPAN_ID]` is a unique identifier for a span within a trace; it is a 16-character hexadecimal encoding of an 8-byte array. It should not be zero. .'\n          in: path\n          name: name\n          required: true\n          schema:\n            type: string\n      requestBody:\n        content:\n          application/json:\n            schema:\n              $ref: '#/components/schemas/Span'\n      responses:\n        '200':\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/Span'\n          description: Successful response\n      security:\n        - Oauth2:\n            - https://www.googleapis.com/auth/cloud-platform\n          Oauth2c:\n            - https://www.googleapis.com/auth/cloud-platform\n        - Oauth2:\n            - https://www.googleapis.com/auth/trace.append\n          Oauth2c:\n            - https://www.googleapis.com/auth/trace.append\n      tags:\n        - spans_span\n  /v2/projects/{projectsId}/traces:batchWrite:\n    parameters:\n      - $ref: '#/components/parameters/upload_protocol'\n      - $ref: '#/components/parameters/callback'\n      - $ref: '#/components/parameters/fields'\n      - $ref: '#/components/parameters/uploadType'\n      - $ref: '#/components/parameters/key'\n      - $ref: '#/components/parameters/oauth_token'\n      - $ref: '#/components/parameters/_.xgafv'\n      - $ref: '#/components/parameters/prettyPrint'\n      - $ref: '#/components/parameters/alt'\n      - $ref: '#/components/parameters/quotaUser'\n      - $ref: '#/components/parameters/access_token'\n    post:\n      description: Batch writes new spans to new or existing traces. You cannot update existing spans.\n      operationId: cloudtrace.projects.traces.batchWrite\n      parameters:\n        - description: Required. The name of the project where the spans belong. The format is `projects/[PROJECT_ID]`.\n          in: path\n          name: name\n          required: true\n          schema:\n            type: string\n      requestBody:\n        content:\n          application/json:\n            schema:\n              $ref: '#/components/schemas/BatchWriteSpansRequest'\n      responses:\n        '200':\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/Empty'\n          description: Successful response\n      security:\n        - Oauth2:\n            - https://www.googleapis.com/auth/cloud-platform\n          Oauth2c:\n            - https://www.googleapis.com/auth/cloud-platform\n        - Oauth2:\n            - https://www.googleapis.com/auth/trace.append\n          Oauth2c:\n            - https://www.googleapis.com/auth/trace.append\n      tags:\n        - traces\nservers:\n  - url: https://cloudtrace.googleapis.com\n",
			"canonicalURL": "/github.com/stackql/stackql-provider-registry@ca6abad4745061e15112152cdee33275701a16c1/-/blob/providers/src/googleapis.com/v1.0.1/services/cloudtrace.yaml",
			"externalURLs": [
				{
					"url": "https://github.com/stackql/stackql-provider-registry/blob/ca6abad4745061e15112152cdee33275701a16c1/providers/src/googleapis.com/v1.0.1/services/cloudtrace.yaml",
					"serviceKind": "GITHUB"
				}
			]
		}
	},
	"Error": "parse: parse spec: parse components: at 1:15: schemas: \"Status\": parse schema: property \"details\": at 1:14758: parse schema: item: at 1:14888: parse schema: additionalProperties: at 1:14912: parse schema: unexpected schema type: \"any\""
}