{
	"File": {
		"__typename": "FileMatch",
		"repository": {
			"name": "github.com/plantbreeding/BrAPI"
		},
		"file": {
			"name": "StudyNewRequest.yaml",
			"size": 0,
			"path": "Specification/BrAPI-Core/Studies/Schemas/StudyNewRequest.yaml",
			"byteSize": 8023,
			"content": "info:\n  title: BrAPI\n  version: ''\nopenapi: 3.0.0\npaths: {}\ncomponents:\n  schemas:\n    StudyNewRequest:\n      type: object\n      properties:\n        active:\n          description: Is this study currently active\n          type: boolean\n          example: true\n        additionalInfo:\n          additionalProperties:\n            type: string\n          description: Additional arbitrary info\n          type: object\n        commonCropName:\n          description: Common name for the crop associated with this study\n          type: string\n          example: Grape\n        contacts:\n          description: List of contact entities associated with this study\n          items:\n            $ref: '#/components/schemas/Contact'\n          type: array\n        dataLinks:\n          description: List of links to extra data files associated with this study. Extra data could include notes, images, and reference data.\n          items:\n            $ref: '#/components/schemas/DataLink'\n          type: array\n        documentationURL:\n          description: A URL to the human readable documentation of this object\n          format: uri\n          type: string\n          example: https://wiki.brapi.org\n        endDate:\n          description: |-\n            The date the study ends\n            \n            MIAPPE V1.1 (DM-15) End date of study - Date and, if relevant, time when the experiment ended\n          format: date-time\n          type: string\n        environmentParameters:\n          description: |-\n            Environmental parameters that were kept constant throughout the study and did not change between observation units.\n            \n            MIAPPE V1.1 (DM-57) Environment - Environmental parameters that were kept constant throughout the study and did not change between observation units or assays. Environment characteristics that vary over time, i.e. environmental variables, should be recorded as Observed Variables (see below).\n          items:\n            $ref: '#/components/schemas/EnvironmentParameter'\n          type: array\n        lastUpdate:\n          description: The date and time when this study was last modified\n          type: object\n          properties:\n            timestamp:\n              format: date-time\n              type: string\n            version:\n              type: string\n              example: 1.2.3\n        license:\n          description: The usage license associated with the study data\n          type: string\n          example: MIT License\n        locationDbId:\n          description: The unique identifier for a Location\n          type: string\n          example: 3cfdd67d\n        locationName:\n          description: |-\n            A human readable name for this location\n            \n            MIAPPE V1.1 (DM-18) Experimental site name - The name of the natural site, experimental field, greenhouse, phenotyping facility, etc. where the experiment took place.\n          type: string\n          example: Location 1\n        seasons:\n          description: List of seasons over which this study was performed.\n          items:\n            type: string\n          type: array\n          example: ['Spring_2018']\n        startDate:\n          description: |-\n            The date this study started\n            \n            MIAPPE V1.1 (DM-14) Start date of study - Date and, if relevant, time when the experiment started\n          format: date-time\n          type: string\n        studyDescription:\n          description: |-\n            The description of this study\n            \n            MIAPPE V1.1 (DM-13) Study description - Human-readable text describing the study\n          type: string\n          example: This is a yield study for Spring 2018\n        studyName:\n          description: |-\n            The human readable name for a study\n            \n            MIAPPE V1.1 (DM-12) Study title - Human-readable text summarising the study\n          type: string\n          example: INRA's Walnut Genetic Resources Observation at Kenya\n        studyCode:\n          description: A short human readable code for a study\n          type: string\n          example: Grape_Yield_Spring_2018\n        studyPUI:\n          description: A permanent unique identifier associated with this study data. For example, a URI or DOI\n          type: string\n          example: doi:10.155454/12349537312\n        studyType:\n          description: The type of study being performed. ex. \"Yield Trial\", etc\n          type: string\n          example: Phenotyping\n        trialDbId:\n          description: The ID which uniquely identifies a trial\n          type: string\n          example: 48b327ea\n        trialName:\n          description: The human readable name of a trial\n          type: string\n          example: Grape_Yield_Trial\n        observationLevels:\n          description: |-\n            Observation levels indicate the granularity level at which the measurements are taken. `levelName` defines the level, `levelOrder` defines where that level exists in the hierarchy of levels. `levelOrder`s lower numbers are at the top of the hierarchy (ie field \u003e 0) and higher numbers are at the bottom of the hierarchy (ie plant \u003e 6). \n          type: array \n          items: \n            $ref: '#/components/schemas/ObservationUnitHierarchyLevel'\n          example:\n            - levelName: field\n              levelOrder: 0\n            - levelName: block\n              levelOrder: 1\n            - levelName: plot\n              levelOrder: 2\n        observationUnitsDescription:\n          description: MIAPPE V1.1 (DM-25) Observation unit description - General description of the observation units in the study.\n          type: string\n          example: Observation units consisted in individual plots themselves consisting of a row of 15 plants at a density of approximately six plants per square meter.\n        culturalPractices:\n          description: MIAPPE V1.1 (DM-28) Cultural practices - General description of the cultural practices of the study.\n          type: string\n          example: Irrigation was applied according needs during summer to prevent water stress.\n        experimentalDesign:\n          description: The experimental and statistical design full description plus a category PUI taken from crop research ontology or agronomy ontology\n          type: object\n          properties:\n            description:\n              description: MIAPPE V1.1 (DM-22) Description of the experimental design - Short description of the experimental design, possibly including statistical design. In specific cases, e.g. legacy datasets or data computed from several studies, the experimental design can be \"unknown\"/\"NA\", \"aggregated/reduced data\", or simply 'none'.\n              type: string\n              example: Lines were repeated twice at each location using a complete block design. In order to limit competition effects, each block was organized into four sub-blocks corresponding to earliest groups based on a prior information.\n            PUI:\n              description: MIAPPE V1.1 (DM-23) Type of experimental design - Type of experimental  design of the study, in the form of an accession number from the Crop Ontology.\n              type: string\n              example: CO_715:0000145\n        growthFacility:\n          description: Short description of the facility in which the study was carried out.\n          type: object\n          properties:\n            description:\n              description: MIAPPE V1.1 (DM-26) Description of growth facility - Short description of the facility in which the study was carried out.\n              type: string\n              example: field environment condition, greenhouse\n            PUI:\n              description: MIAPPE V1.1 (DM-27) Type of growth facility - Type of growth facility in which the study was carried out, in the form of an accession number from the Crop Ontology.\n              type: string\n              example: CO_715:0000162\n        externalReferences: \n          $ref: '#/components/schemas/ExternalReferences'\n          \n\n"
		}
	},
	"Error": "parse: parse spec: parse components: schemas: \"StudyNewRequest\": parse schema: property \"contacts\": parse schema: item: parse schema: resolve \"#/components/schemas/Contact\": find schema: resolve \"#/components/schemas/Contact\": can't find value for \"components/schemas/Contact\""
}