{
	"File": {
		"__typename": "FileMatch",
		"repository": {
			"name": "github.com/mercadopago/devsite-docs"
		},
		"file": {
			"name": "preferences.yaml",
			"size": 0,
			"path": "reference/api/preferences.yaml",
			"byteSize": 211931,
			"content": "openapi: 3.0.0\nservers:\n  - url: https://api.mercadopago.com\ninfo:\n  title: Mercado Pago API Reference\n  version: '1.0'\npaths:\n  /checkout/preferences:\n    post:\n      tags:\n        - $ref: '#/tags/checkout-pro'\n        - $ref: '#/tags/mobile-checkout'\n      summary: Create preference\n      x-summary-i18n:\n        eng: Create preference\n        spa: Crear preferencia\n        por: Criar preferência\n      description: Generate a preference with the information of a product or service and obtain the necessary URL to start the payment flow\n      x-description-i18n:\n        eng: Generate a preference with the information of a product or service and obtain the necessary URL to start the payment flow\n        spa: Genera una preferencia con la información de un producto o servicio y obtén la URL necesaria para iniciar el flujo de pago\n        por: Gerar uma preferência com informações sobre um produto ou serviço e obter a URL necessária para iniciar o fluxo de pagamento\n      requestBody:\n        content:\n          application/json:\n            schema:\n              type: object\n              properties:\n                items:\n                  type: array\n                  description: Items information.\n                  x-description-i18n:\n                    eng: Items information.\n                    spa: Información sobre el ítem\n                    por: Informações sobre o item\n                  items:\n                    type: object\n                    properties:\n                      id:\n                        type: string\n                        description: Item ID.\n                        x-description-i18n:\n                          eng: Item ID.\n                          spa: Indentificador del ítem\n                          por: Indentificador do item\n                      title:\n                        type: string\n                        example: Dummy Title\n                        description: This is the item`s title, which will display during the payment process, at checkout, activities, and emails.\n                        x-description-i18n:\n                          eng: This is the item`s title, which will display during the payment process, at checkout, activities, and emails.\n                          spa: Este es el título del ítem, que se mostrará durante el proceso de pago, en el checkout, actividades y correos electrónicos.\n                          por: Este é o título do item, que será exibido durante o processo de pagamento, no checkout, nas atividades e nos e-mails.\n                      description:\n                        type: string\n                        example: Dummy description\n                        description: Item description.\n                        x-description-i18n:\n                          eng: Item description.\n                          spa: Descripción del item\n                          por: Descrição do artigo\n                      picture_url:\n                        type: string\n                        example: http://www.myapp.com/myimage.jpg\n                        description: Item image URL.\n                        x-description-i18n:\n                          eng: Item image URL.\n                          spa: URL de imagen del ítem\n                          por: URL da imagem do anúncio\n                      category_id:\n                        type: string\n                        example: car_electronics\n                        description: This is a free string where the item category can be added. We suggest using one of the options shown in the following link https://api.mercadopago.com/item_categories\n                        x-description-i18n:\n                          eng: This is a free string where the item category can be added. We suggest using one of the options shown in the following link https://api.mercadopago.com/item_categories\n                          spa: Esto es un string libre donde se puede agregar la categoría del ítem. Sugerimos utilizar alguna de las opciones que se muestran en el siguiente enlace https://api.mercadopago.com/item_categories\n                          por: Esta é uma string livre onde a categoria do item pode ser adicionada. Sugerimos usar uma das opções mostradas no link a seguir https://api.mercadopago.com/item_categories\n                      quantity:\n                        type: number\n                        example: 1\n                        description: Item quantity. This property is used to calculate the total cost.\n                        x-description-i18n:\n                          eng: Item quantity. This property is used to calculate the total cost.\n                          spa: Cantidad de ítems. Esta propiedad se utiliza para calcular el costo total.\n                          por: Quantidade de itens. Esta propriedade é usada para calcular o custo total.\n                      currency_id:\n                        type: string\n                        example: U$\n                        description: Unique ID to identify the currency. ISO_4217 code. Some sites allow local currency and USD, but it is important to note that the amount is converted to local currency when the preference is created, as the checkout always processes transactions using local currency. If you use USD please take into consideration that this value is not automatically updated if the value of local currency changes in relation to USD.\n                        x-description-i18n:\n                          eng: Unique ID to identify the currency. ISO_4217 code. Some sites allow local currency and USD, but it is important to note that the amount is converted to local currency when the preference is created, as the checkout always processes transactions using local currency. If you use USD please take into consideration that this value is not automatically updated if the value of local currency changes in relation to USD.\n                          spa: ID único para identificar la moneda. Código ISO_4217. Algunos sitios permiten la moneda local y USD, pero es importante tener en cuenta que el monto se convierte a moneda local cuando se crea la preferencia, ya que el checkout siempre procesa las transacciones en moneda local. Si usas USD, ten en cuenta que este valor no se actualiza automáticamente si el valor de la moneda local cambia en relación a USD.\n                          por: ID exclusivo para identificar a moeda. Código ISO_4217. Alguns sites permitem moeda local e USD, mas é importante observar que o valor é convertido para moeda local quando a preferência é criada, pois o checkout sempre processa as transações em moeda local. Se você estiver usando USD, observe que esse valor não é atualizado automaticamente se o valor da moeda local mudar em relação ao USD.\n                        enum:\n                          - ARS -- Argentine peso.\n                          - BRL -- Brazilian real.\n                          - CLP -- Chilean peso.\n                          - MXN -- Mexican peso.\n                          - COP -- Colombian peso.\n                          - PEN -- Peruvian sol.\n                          - UYU -- Uruguayan peso.\n                      unit_price:\n                        type: number\n                        example: 10\n                        description: Unit price of the item. This property is used together with the property quantity to determine the order cost.\n                        x-description-i18n:\n                          eng: Unit price of the item. This property is used together with the property quantity to determine the order cost.\n                          spa: Precio unitario del ítem. Esta propiedad se usa junto con propiedad quantity para determinar el costo de la orden.\n                          por: Preço unitário do item. Essa propriedade é usada em conjunto com a propriedade de quantity para determinar o custo do pedido.\n                payer:\n                  type: object\n                  description: Buyer´s information, such as name, last name, e-mail, phone, personal identification, address, and registration date.\n                  x-description-i18n:\n                    eng: Buyer´s information, such as name, last name, e-mail, phone, personal identification, address, and registration date.\n                    spa: Información del comprador, como nombre, apellido, correo electrónico, teléfono, identificación personal, dirección y fecha de registro.\n                    por: Informações do comprador, como nome, sobrenome, e-mail, telefone, identificação pessoal, endereço e data de registro.\n                  properties:\n                    name:\n                      type: string\n                      description: Buyer name.\n                      x-description-i18n:\n                        eng: Buyer name.\n                        spa: Nombre del comprador\n                        por: Nome do comprador\n                    surname:\n                      type: string\n                      description: Buyer last name.\n                      x-description-i18n:\n                        eng: Buyer last name.\n                        spa: Apellido del comprador\n                        por: Apelido do comprador\n                    email:\n                      type: string\n                      description: Buyer e-mail address.\n                      x-description-i18n:\n                        eng: Buyer e-mail address.\n                        spa: Dirección de e-mail del comprador\n                        por: Endereço de e-mail do comprador\n                    phone:\n                      type: object\n                      description: Buyer phone.\n                      x-description-i18n:\n                        eng: Buyer phone.\n                        spa: Teléfono del comprador\n                        por: Telefone do comprador\n                      properties:\n                        area_code:\n                          type: string\n                          description: Area code.\n                          x-description-i18n:\n                            eng: Area code.\n                            spa: Código de área\n                            por: Código de área\n                        number:\n                          type: string\n                          description: Number.\n                          x-description-i18n:\n                            eng: Number.\n                            spa: Número\n                            por: Número\n                    identification:\n                      type: object\n                      description: Personal identification.\n                      x-description-i18n:\n                        eng: Personal identification.\n                        spa: Identificación personal\n                        por: Identificação pessoal\n                      properties:\n                        type:\n                          type: string\n                          description: Identification Type.\n                          x-description-i18n:\n                            eng: Identification Type.\n                            spa: Tipo de identificación\n                            por: Tipo de identificação\n                        number:\n                          type: string\n                          description: Number.\n                          x-description-i18n:\n                            eng: Number.\n                            spa: Número\n                            por: Número\n                    address:\n                      type: object\n                      description: Buyer’s address.\n                      x-description-i18n:\n                        eng: Buyer’s address.\n                        spa: Dirección del comprador\n                        por: Endereço do comprador\n                      properties:\n                        zip_code:\n                          type: string\n                          description: Zip code.\n                          x-description-i18n:\n                            eng: Zip code.\n                            spa: Código postal\n                            por: Código postal\n                        street_name:\n                          type: string\n                          description: Street name.\n                          x-description-i18n:\n                            eng: Street name.\n                            spa: Calle\n                            por: Rua\n                        street_number:\n                          type: number\n                          description: Street number.\n                          x-description-i18n:\n                            eng: Street number.\n                            spa: Número\n                            por: O Número\n                    date_created:\n                      type: string\n                      format: date\n                      description: Registration date.\n                      x-description-i18n:\n                        eng: Registration date.\n                        spa: Fecha de registración\n                        por: Data de registro\n                payment_methods:\n                  type: object\n                  description: All configuration related to payments methods, such as excluded payment methods, excluded payment types, default payment method, and installments.\n                  x-description-i18n:\n                    eng: All configuration related to payments methods, such as excluded payment methods, excluded payment types, default payment method, and installments.\n                    spa: Toda la configuración relacionada con los métodos de pago, tales como los métodos de pago excluidos, los tipos de pago excluidos, el método de pago predeterminado y las cuotas.\n                    por: Todas as configurações são relacionadas ao métodos de pagamento, como, por exemplo, métodos de pagamento excluídos, tipos de pagamento excluídos, método de pagamento padrão e taxas.\n                  properties:\n                    excluded_payment_methods:\n                      type: array\n                      description: Payment methods excluded from the payment process (except account_money, which is always allowed). The payment methods included here will not be available at checkout.\n                      x-description-i18n:\n                        eng: Payment methods excluded from the payment process (except account_money, which is always allowed). The payment methods included here will not be available at checkout.\n                        spa: Métodos de pago excluidos del proceso de pago (excepto account_money, que siempre estará disponible). Los métodos de pago incluidos aquí no estarán disponibles en el checkout.\n                        por: Métodos de pagamento excluídos do checkout (exceto account_money, que estará sempre disponível). Os métodos de pagamento aqui incluídos não estarão disponíveis no checkout.\n                      items:\n                        type: object\n                        properties:\n                          id:\n                            type: string\n                            description: Payment method ID.\n                            x-description-i18n:\n                              eng: Payment method ID.\n                              spa: Identificador del método de pago\n                              por: Identificador do método de pagamento\n                    excluded_payment_types:\n                      type: array\n                      description: Payment types excluded from the payment process. The payment types included here will not be available at checkout.\n                      x-description-i18n:\n                        eng: Payment types excluded from the payment process. The payment types included here will not be available at checkout.\n                        spa: Tipos de pago excluidos del proceso de pago. Los tipos de pago incluidos aquí no estarán disponibles en el checkout.\n                        por: Tipos de pagamento excluídos do processo de pagamento. Os tipos de pagamento incluídos aqui não estarão disponíveis no checkout.\n                      items:\n                        type: object\n                        properties:\n                          id:\n                            type: string\n                            description: Payment method data_type ID.\n                            x-description-i18n:\n                              eng: Payment method data_type ID.\n                              spa: Identificador de data_type del medio de pago\n                              por: Identificador de data_type do meio de pagamento\n                    default_payment_method_id:\n                      type: string\n                      description: Suggested payment method. The user will initiate the checkout this this payment method already selected. It is considered suggested because Checkouts follow different logics in order to select the best payment method for a specific transaction, and this property is the option with the least relevance.\n                      x-description-i18n:\n                        eng: Suggested payment method. The user will initiate the checkout this this payment method already selected. It is considered suggested because Checkouts follow different logics in order to select the best payment method for a specific transaction, and this property is the option with the least relevance.\n                        spa: Forma de pago sugerida. El usuario iniciará el pago con este método de pago ya seleccionado. Se considera sugerida porque los Checkouts siguen lógicas diferentes para seleccionar el mejor método de pago para una transacción específica, siendo esta propiedad la opción con menor relevancia.\n                        por: Forma de pagamento sugerida. O usuário iniciará o pagamento com esta forma de pagamento já selecionada. Considera-se sugerido porque os Checkouts seguem lógicas diferentes para selecionar o melhor meio de pagamento para uma determinada transação, sendo esta propriedade a opção menos relevante.\n                    installments:\n                      type: number\n                      description: Maximum number of credit card installments to be accepted.\n                      x-description-i18n:\n                        eng: Maximum number of credit card installments to be accepted.\n                        spa: Máximo número de cuotas\n                        por: Número Máximo de cotas\n                    default_installments:\n                      type: number\n                      description: Prefered number of credit card installments.\n                      x-description-i18n:\n                        eng: Prefered number of credit card installments.\n                        spa: Preferencia de cuotas\n                        por: Preferência de cotas\n                shipments:\n                  type: object\n                  description: Shipments information.\n                  x-description-i18n:\n                    eng: Shipments information.\n                    spa: Información de envío\n                    por: Informações de envio\n                  properties:\n                    mode:\n                      $ref: '#/components/schemas/shipment_mode'\n                    local_pickup:\n                      type: boolean\n                      description: The payer has the option to pick up the shipment in your store (mode:me2 only).\n                      x-description-i18n:\n                        eng: The payer has the option to pick up the shipment in your store (mode:me2 only).\n                        spa: Preferencia de retiro de paquetes en sucursal(mode:me2 solamente)\n                        por: Preferência de remoção de pacotes em agência(mode:me2 somente)\n                    dimensions:\n                      type: string\n                      description: Dimensions of the shipment in cm x cm x cm, gr (mode:me2 only)\n                      x-description-i18n:\n                        eng: Dimensions of the shipment in cm x cm x cm, gr (mode:me2 only)\n                        spa: Tamaño del paquete en cm x cm x cm, gr (mode:me2 solamente)\n                        por: Tamanho do pacote em cm x cm x cm, gr (mode:me2 somente)\n                    default_shipping_method:\n                      type: number\n                      description: Select default shipping method in checkout (mode:me2 only).\n                      x-description-i18n:\n                        eng: Select default shipping method in checkout (mode:me2 only).\n                        spa: Elegir un método de envío predeterminado en el checkout (mode:me2 solamente)\n                        por: Escolha um método de envio padrão no checkout (mode:me2 somente)\n                    free_methods:\n                      type: array\n                      description: Offer a shipping method as free shipping (mode:me2 only).\n                      x-description-i18n:\n                        eng: Offer a shipping method as free shipping (mode:me2 only).\n                        spa: Ofrecer un método de envío gratuito (mode:me2 solamente)\n                        por: Oferecer um método de frete grátis (mode:me2 somente)\n                      items:\n                        type: object\n                        properties:\n                          id:\n                            type: number\n                            description: Shipping method ID.\n                            x-description-i18n:\n                              eng: Shipping method ID.\n                              spa: Identificador de método de envío\n                              por: Identificador do método de envio\n                    cost:\n                      type: number\n                      description: Shipment cost (mode:custom only).\n                      x-description-i18n:\n                        eng: Shipment cost (mode:custom only).\n                        spa: Costo del envío (mode:custom solamente)\n                        por: Custo do transporte (mode:custom somente)\n                    free_shipping:\n                      type: boolean\n                      description: Free shipping for mode:custom.\n                      x-description-i18n:\n                        eng: Free shipping for mode:custom.\n                        spa: Preferencia de envío gratuito para mode:custom\n                        por: Preferência de frete grátis para mode:custom\n                    receiver_address:\n                      type: object\n                      description: Shipping address.\n                      x-description-i18n:\n                        eng: Shipping address.\n                        spa: Dirección de envío\n                        por: Endereço de envio\n                      properties:\n                        zip_code:\n                          type: string\n                          description: Zip code.\n                          x-description-i18n:\n                            eng: Zip code.\n                            spa: Código postal\n                            por: Código postal\n                        street_name:\n                          type: string\n                          description: Street name.\n                          x-description-i18n:\n                            eng: Street name.\n                            spa: Calle\n                            por: Rua\n                        city_name:\n                          type: string\n                          description: City name.\n                          x-description-i18n:\n                            eng: City name.\n                            spa: Ciudad\n                            por: Cidade\n                        state_name:\n                          type: string\n                          description: State name.\n                          x-description-i18n:\n                            eng: State name.\n                            spa: Estado\n                            por: Estado\n                        street_number:\n                          type: number\n                          description: Street number.\n                          x-description-i18n:\n                            eng: Street number.\n                            spa: Número\n                            por: O Número\n                        floor:\n                          type: string\n                          description: Floor.\n                          x-description-i18n:\n                            eng: Floor.\n                            spa: Piso\n                            por: Apartamento\n                        apartment:\n                          type: string\n                          description: Apartment.\n                          x-description-i18n:\n                            eng: Apartment.\n                            spa: Departamento\n                            por: Apartamento\n                back_urls:\n                  type: object\n                  description: URLs to return to the sellers website.\n                  x-description-i18n:\n                    eng: URLs to return to the sellers website.\n                    spa: URLs de retorno al sitio del vendedor\n                    por: Url de retorno ao site do vendedor\n                  properties:\n                    success:\n                      type: string\n                      description: Approved payment URL.\n                      x-description-i18n:\n                        eng: Approved payment URL.\n                        spa: URL de retorno ante pago aprobado\n                        por: URL de retorno ante o pagamento aprovado\n                    pending:\n                      type: string\n                      description: Pending or in process payment URL.\n                      x-description-i18n:\n                        eng: Pending or in process payment URL.\n                        spa: URL de retorno ante pago pendiente o en proceso.\n                        por: URL de retorno diante de pagamento pendente ou em processo.\n                    failure:\n                      type: string\n                      description: Canceled payment URL.\n                      x-description-i18n:\n                        eng: Canceled payment URL.\n                        spa: URL de retorno ante pago cancelado\n                        por: URL de retorno ante o pagamento cancelado\n                notification_url:\n                  type: string\n                  description: URL where you'd like to receive a payment notification.\n                  x-description-i18n:\n                    eng: URL where you'd like to receive a payment notification.\n                    spa: URL a la cual te gustaría recibir notificaciones de pagos\n                    por: URL para a qual você gostaria de receber notificações de pagamentos\n                statement_descriptor:\n                  type: string\n                  description: The statement descriptor is a long text (up to 16 characters) that will be visualized in the payer´s credit card statement to easily identify the purchase.\n                  x-description-i18n:\n                    eng: The statement descriptor is a long text (up to 16 characters) that will be visualized in the payer´s credit card statement to easily identify the purchase.\n                    spa: El statement descriptor es un texto largo (hasta 16 caracteres) que se visualizará en la factura de la tarjeta de crédito del pagador para identificar fácilmente la compra.\n                    por: O statement descriptor é um texto longo (até 16 caracteres) que será exibido na fatura do cartão de crédito do pagador para identificar facilmente a compra.\n                additional_info:\n                  type: string\n                  description: Additional information.\n                  x-description-i18n:\n                    eng: Additional information.\n                    spa: Información adicional\n                    por: Informações adicionais\n                auto_return:\n                  $ref: '#/components/schemas/auto_return'\n                external_reference:\n                  type: string\n                  description: Reference you can synchronize with your payment system.\n                  x-description-i18n:\n                    eng: Reference you can synchronize with your payment system.\n                    spa: Referencia que puedes sincronizar con tu sistema de pagos\n                    por: Referência que pode sincronizar com seu sistema de pagamentos\n                expires:\n                  type: boolean\n                  description: Boolean value that determines if a preference expires.\n                  x-description-i18n:\n                    eng: Boolean value that determines if a preference expires.\n                    spa: Preferencia que determina si una preferencia expira\n                    por: Preferência que determina se uma preferência expira\n                date_of_expiration:\n                  type: string\n                  format: date\n                  description: Expiration date of cash payment.\n                  x-description-i18n:\n                    eng: Expiration date of cash payment.\n                    spa: Fecha de vencimiento del medio de pago en efectivo\n                    por: Data de expiração de meios de pagamento em dinheiro\n                expiration_date_from:\n                  type: string\n                  format: date\n                  description: Date in YYYY-MM-DD-HH-MM-SS format which indicates the start of the preference`s validity period. This can be used, for instance, for limited sales, where sellers make an offer between certain dates.\n                  x-description-i18n:\n                    eng: Date in YYYY-MM-DD-HH-MM-SS format which indicates the start of the preference`s validity period. This can be used, for instance, for limited sales, where sellers make an offer between certain dates.\n                    spa: Fecha en formato AAAA-MM-DD-HH-MM-SS que indica el inicio del período de validez de la preferencia. Esto se puede usar, por ejemplo, para ventas limitadas, donde los vendedores hacen una oferta entre ciertas fechas.\n                    por: Data no formato AAAA-MM-DD-HH-MM-SS que indica o início do período de validade da preferência. Isso pode ser usado, por exemplo, para vendas limitadas, onde os vendedores fazem uma oferta entre determinadas datas.\n                expiration_date_to:\n                  type: string\n                  format: date\n                  description: Date in YYYY-MM-DD-HH-MM-SS format which indicates the end of the preference`s validity period. This can be used, for instance, for limited sales, where sellers make an offer between certain dates.\n                  x-description-i18n:\n                    eng: Date in YYYY-MM-DD-HH-MM-SS format which indicates the end of the preference`s validity period. This can be used, for instance, for limited sales, where sellers make an offer between certain dates.\n                    spa: Fecha en formato AAAA-MM-DD-HH-MM-SS que indica el final del período de validez de la preferencia. Esto se puede usar, por ejemplo, para ventas limitadas, donde los vendedores hacen una oferta entre ciertas fechas.\n                    por: Data no formato AAAA-MM-DD-HH-MM-SS que indica o início do período de validade da preferência. Isso pode ser usado, por exemplo, para vendas limitadas, onde os vendedores fazem uma oferta entre determinadas datas.\n                marketplace:\n                  type: string\n                  description: Origin of the payment. This is an alphanumeric field whose default value is NONE. If the collector has their own marketplace, this is where the credentials to identify it are sent. As the marketplace is associated to the Application ID, the marketplace credentials must correspond to the credentials used to create the preference. Using the wrong credentials will result in an error.\n                  x-description-i18n:\n                    eng: Origin of the payment. This is an alphanumeric field whose default value is NONE. If the collector has their own marketplace, this is where the credentials to identify it are sent. As the marketplace is associated to the Application ID, the marketplace credentials must correspond to the credentials used to create the preference. Using the wrong credentials will result in an error.\n                    spa: Origen del pago. Este es un campo alfanumérico cuyo valor por defecto es NONE. Si el collector tiene su propio marketplace, aquí es donde se envían las credenciales para identificarlo. Como el marketplace está asociado al Application ID, las credenciales del marketplace deben corresponder a las credenciales utilizadas para crear la preferencia. El uso de credenciales incorrectas dará como resultado un error.\n                    por: Origem do pagamento. Este é um campo alfanumérico cujo valor padrão é NONE. Caso o coletor tenha seu próprio marketplace, é para onde são enviadas as credenciais para identificá-lo. Como o marketplace está associado ao Application ID, as credenciais do marketplace devem corresponder às credenciais usadas para criar a preferência. Usar as credenciais erradas resultará em um erro.\n                marketplace_fee:\n                  type: number\n                  description: Marketplace`s fee charged by application owner. It is a fixed amount and its default value is 0 in local currency. This property can only be sent if a valid marketplace has been defined as well, otherwise the request will fail.\n                  x-description-i18n:\n                    eng: Marketplace`s fee charged by application owner. It is a fixed amount and its default value is 0 in local currency. This property can only be sent if a valid marketplace has been defined as well, otherwise the request will fail.\n                    spa: Tarifa de Marketplace cobrada por el propietario de la aplicación. Es una cantidad fija y su valor por defecto es 0 en moneda local. Esta propiedad solo se puede enviar si también se ha definido un marketplace válido; de lo contrario, la solicitud fallará.\n                    por: Taxa de Marketplace cobrada pelo proprietário da aplicação. É um valor fixo e seu valor padrão é 0 em moeda local. Esta propriedade só pode ser apresentada se também tiver sido definido um marketplace válido e, caso contrário, a solicitação falhará.\n                differential_pricing:\n                  type: object\n                  description: Differential pricing configuration for this preference. The seller can have their own configuration regarding payment methods and installments, and it`s in this parameter where they will include the numeric ID to indicate so. This value is used to apply custom payment methods. \n                  properties:\n                    id:\n                      type: number\n                      description: Differential pricing ID.\n                      x-description-i18n:\n                        eng: Differential pricing ID.\n                        spa: Identificador de precio diferenciado\n                        por: Identificador de preço diferenciado\n                tracks:\n                  type: array\n                  description: Tracks to be executed during the users`s interaction in the Checkout flow. The user can configure their own tracks. We currently supoort google and facebook. The collector must send the pixel ID (from google or facebook), and when the transaction flow is finalized the seller will be notified of the sale.\n                  x-description-i18n:\n                    eng: Tracks to be executed during the users`s interaction in the Checkout flow. The user can configure their own tracks. We currently supoort google and facebook. The collector must send the pixel ID (from google or facebook), and when the transaction flow is finalized the seller will be notified of the sale.\n                    spa: Tracks que se ejecutarán durante la interacción de los usuarios en el flujo de Pago. El usuario puede configurar sus propios tracks. Actualmente soportamos Google y Facebook. El collector debe enviar el pixel ID (de google o facebook), y cuando finalice el flujo de la transacción, el vendedor será notificado de la venta.\n                    por: Tracks que serão executados durante a interação do usuário no fluxo de Pagamento. O usuário pode configurar suas próprias trilhas. Atualmente suportamos Google e Facebook. O colector deve enviar o pixel ID (do google ou facebook) e, quando o fluxo da transação for finalizado, o vendedor será notificado da venda.\n                  items:\n                    type: object\n                    properties:\n                      type:\n                        type: string\n                        description: Track type. Specifies which tool the values belong to.\n                        x-description-i18n:\n                          eng: Track type. Specifies which tool the values belong to.\n                          spa: Tipo del track. Especifica a qué herramienta pertenecen los valores\n                          por: Tipo da track. Especifique a herramienta pertenecen los valores\n                        example: google_ad\n                        enum:\n                          - google_ad -- Allows configurations for GTM's Google Ads Conversion Tracking tag. Necessary values as conversion_id and conversion_label.\n                          - facebook_ad -- Allows configurations for Facebook Pixel. Necessary values as pixel_id.\n                      values:\n                        type: string\n                        description: Configuration values according the track type.\n                        x-description-i18n:\n                          eng: Configuration values according the track type.\n                          spa: Valores de configuración de acuerdo al tipo de track\n                          por: Valores de configuração de acordo com o tipo de track\n                metadata:\n                    type: object\n                    description: Valid JSON that can be added to the payment to save additional attributes.\n                    x-description-i18n:\n                      eng: Valid JSON that can be added to the payment to save additional attributes.\n                      spa: JSON válido que puede agregarse al pago para guardar atributos adicionales\n                      por: JSON válido que pode ser adicionado ao pagamento para salvar atributos adicionais\n      responses:\n        '200':\n          description: Success\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  collector_id:\n                    type: number\n                    example: 202809963\n                    description: Unique ID used to identify the collector. It is the same as the Cust ID.\n                    x-description-i18n:\n                      eng: Unique ID used to identify the collector. It is the same as the Cust ID.\n                      spa: ID único utilizada para identificar al collector. Es el mismo que el Cust ID.\n                      por: ID exclusivo usado para identificar o coletor. É o mesmo que o Cust ID.\n                  operation_type:\n                    $ref: '#/components/schemas/operation_type'\n                  items:\n                    type: array\n                    description: Items information.\n                    x-description-i18n:\n                      eng: Items information.\n                      spa: Información sobre el ítem\n                      por: Informações sobre o item\n                    items:\n                      type: object\n                      properties:\n                        id:\n                          type: string\n                          description: Item ID.\n                          x-description-i18n:\n                            eng: Item ID.\n                            spa: Indentificador del ítem\n                            por: Indentificador do item\n                        picture_url:\n                          type: string\n                          description: Item image URL.\n                          x-description-i18n:\n                            eng: Item image URL.\n                            spa: URL de imagen del ítem\n                            por: URL da imagem do anúncio\n                        title:\n                          type: string\n                          example: Dummy Item\n                          description: This is the item`s title, which will display during the payment process, at checkout, activities, and emails.\n                          x-description-i18n:\n                            eng: This is the item`s title, which will display during the payment process, at checkout, activities, and emails.\n                            spa: Este es el título del ítem, que se mostrará durante el proceso de pago, en el checkout, actividades y correos electrónicos.\n                            por: Este é o título do item, que será exibido durante o processo de pagamento, no checkout, nas atividades e nos e-mails.\n                        description:\n                          type: string\n                          example: Multicolor Item\n                          description: Item description. This is a free text field.\n                          x-description-i18n:\n                            eng: Item description. This is a free text field.\n                            spa: Esto es un string libre donde se puede agregar la categoría del ítem.\n                            por: Esta é uma string livre onde a categoria do item pode ser adicionada.\n                        category_id:\n                          type: string\n                          description: This is a free string where the item category can be added.\n                          x-description-i18n:\n                            eng: This is a free string where the item category can be added.\n                            spa: Esto es un string libre donde se puede agregar la categoría del ítem.\n                            por: Esta é uma string livre onde a categoria do item pode ser adicionada.\n                        currency_id:\n                          type: string\n                          example: $\n                          description: Unique ID to identify the currency. ISO_4217 code. Some sites allow local currency and USD, but it is important to note that the amount is converted to local currency when the preference is created, as the checkout always processes transactions using local currency. If you use USD please take into consideration that this value is not automatically updated if the value of local currency changes in relation to USD.\n                          x-description-i18n:\n                            eng: Unique ID to identify the currency. ISO_4217 code. Some sites allow local currency and USD, but it is important to note that the amount is converted to local currency when the preference is created, as the checkout always processes transactions using local currency. If you use USD please take into consideration that this value is not automatically updated if the value of local currency changes in relation to USD.\n                            spa: ID único para identificar la moneda. Código ISO_4217. Algunos sitios permiten la moneda local y USD, pero es importante tener en cuenta que el monto se convierte a moneda local cuando se crea la preferencia, ya que el checkout siempre procesa las transacciones en moneda local. Si usas USD, ten en cuenta que este valor no se actualiza automáticamente si el valor de la moneda local cambia en relación a USD.\n                            por: ID exclusivo para identificar a moeda. Código ISO_4217. Alguns sites permitem moeda local e USD, mas é importante observar que o valor é convertido para moeda local quando a preferência é criada, pois o checkout sempre processa as transações em moeda local. Se você estiver usando USD, observe que esse valor não é atualizado automaticamente se o valor da moeda local mudar em relação ao USD.\n                          enum:\n                            - ARS -- Argentine peso.\n                            - BRL -- Brazilian real.\n                            - CLP -- Chilean peso.\n                            - MXN -- Mexican peso.\n                            - COP -- Colombian peso.\n                            - PEN -- Peruvian sol.\n                            - UYU -- Uruguayan peso.\n                        quantity:\n                          type: number\n                          example: 1\n                          description: Item quantity. This property is used to calculate the total cost.\n                          x-description-i18n:\n                            eng: Item quantity. This property is used to calculate the total cost.\n                            spa: Cantidad de ítems. Esta propiedad se utiliza para calcular el costo total.\n                            por: Quantidade de itens. Esta propriedade é usada para calcular o custo total.\n                        unit_price:\n                          type: number\n                          example: 10\n                          description: Unit price of the item. This property is used together with the property quantity to determine the order cost.\n                          x-description-i18n:\n                            eng: Unit price of the item. This property is used together with the property quantity to determine the order cost.\n                            spa: Precio unitario del ítem. Esta propiedad se usa junto con propiedad quantity para determinar el costo de la orden.\n                            por: Preço unitário do item. Essa propriedade é usada em conjunto com a propriedade de quantity para determinar o custo do pedido.\n                  payer:\n                    type: object\n                    description: Buyer information, such as name, last name, e-mail, phone, personal identification, address, and registration date.\n                    x-description-i18n:\n                      eng: Buyer information, such as name, last name, e-mail, phone, personal identification, address, and registration date.\n                      spa: Información del comprador, como nombre, apellido, correo electrónico, teléfono, identificación personal, dirección y fecha de registro.\n                      por: Informações do comprador, como nome, sobrenome, e-mail, telefone, identificação pessoal, endereço e data de registro.\n                    properties:\n                      name:\n                        type: string\n                        description: Name of the associated payer.\n                        x-description-i18n:\n                          eng: Name of the associated payer.\n                          spa: Nombre del pagador asociado\n                          por: Nome do pagante associado\n                      surname:\n                        type: string\n                        description: Last name of the associated payer.\n                        x-description-i18n:\n                          eng: Last name of the associated payer.\n                          spa: Apellido del pagador asociado\n                          por: Sobrenome do pagante associado\n                      email:\n                        type: string\n                        description: Payer’s email address.\n                        x-description-i18n:\n                          eng: Payer’s email address.\n                          spa: E-mail del pagador\n                          por: E-mail do pagante\n                      date_created:\n                        type: string\n                        description: Registration date.\n                        x-description-i18n:\n                          eng: Registration date.\n                          spa: Fecha de registración\n                          por: Data de registro\n                      phone:\n                        type: object\n                        description: Phone number of the associated payer.\n                        x-description-i18n:\n                          eng: Phone number of the associated payer.\n                          spa: Teléfono del pagador asociado\n                          por: Telefone do pagante associado\n                        properties:\n                          area_code:\n                            type: string\n                            description: Area code.\n                            x-description-i18n:\n                              eng: Area code.\n                              spa: Código de área\n                              por: Código de área\n                          number:\n                            type: string\n                            description: Phone number.\n                            x-description-i18n:\n                              eng: Phone number.\n                              spa: Número telefónico\n                              por: Número de telefone\n                      identification:\n                        type: object\n                        description: Identification of the associated payer.\n                        x-description-i18n:\n                          eng: Identification of the associated payer.\n                          spa: Identificación del pagador asociado\n                          por: Identificação do pagador associado\n                        properties:\n                          type:\n                            type: string\n                            description: Type of identification of the associated payer (required if the payer is a customer).\n                            x-description-i18n:\n                              eng: Type of identification of the associated payer (required if the payer is a customer).\n                              spa: Tipo de identificación del pagador asociado (requerido si el pagador es un cliente)\n                              por: Tipo de identificação do pagante associado (exigido se o pagante é um cliente)\n                          number:\n                            type: string\n                            description: Identification number.\n                            x-description-i18n:\n                              eng: Identification number.\n                              spa: Número de identificación\n                              por: Número de identificação\n                      address:\n                        type: object\n                        description: Buyer’s address.\n                        x-description-i18n:\n                          eng: Buyer’s address.\n                          spa: Dirección del comprador\n                          por: Endereço do comprador\n                        properties:\n                          street_name:\n                            type: string\n                            description: Street name.\n                            x-description-i18n:\n                              eng: Street name.\n                              spa: Calle\n                              por: Rua\n                          street_number:\n                            type: string\n                            format: nullable\n                            description: Street number.\n                            x-description-i18n:\n                              eng: Street number.\n                              spa: Número\n                              por: O Número\n                          zip_code:\n                            type: string\n                            description: Zip code.\n                            x-description-i18n:\n                              eng: Zip code.\n                              spa: Código postal\n                              por: Código postal\n                  back_urls:\n                    type: object\n                    description: URLs to return to the sellers website.\n                    x-description-i18n:\n                      eng: URLs to return to the sellers website.\n                      spa: URLs de retorno al sitio del vendedor\n                      por: Url de retorno ao site do vendedor\n                    properties:\n                      success:\n                        type: string\n                        description: Approved payment URL.\n                        x-description-i18n:\n                          eng: Approved payment URL.\n                          spa: URL de retorno ante pago aprobado\n                          por: URL de retorno ante o pagamento aprovado\n                      pending:\n                        type: string\n                        description: Pending or in process payment URL.\n                        x-description-i18n:\n                          eng: Pending or in process payment URL.\n                          spa: URL de retorno ante pago pendiente o en proceso.\n                          por: URL de retorno diante de pagamento pendente ou em processo.\n                      failure:\n                        type: string\n                        description: Canceled payment URL.\n                        x-description-i18n:\n                          eng: Canceled payment URL.\n                          spa: URL de retorno ante pago cancelado\n                          por: URL de retorno ante o pagamento cancelado\n                  auto_return:\n                    $ref: '#/components/schemas/auto_return'\n                  payment_methods:\n                    type: object\n                    description: All configuration related to payments methods, such as excluded payment methods, excluded payment types, default payment method, and installments.\n                    x-description-i18n:\n                      eng: All configuration related to payments methods, such as excluded payment methods, excluded payment types, default payment method, and installments.\n                      spa: Toda la configuración relacionada con los métodos de pago, tales como los métodos de pago excluidos, los tipos de pago excluidos, el método de pago predeterminado y las cuotas.\n                      por: Todas as configurações são relacionadas ao métodos de pagamento, como, por exemplo, métodos de pagamento excluídos, tipos de pagamento excluídos, método de pagamento padrão e taxas.\n                    properties:\n                      excluded_payment_methods:\n                        type: array\n                        description: Payment methods excluded from the payment process (except account_money, which is always allowed). The payment methods included here will not be available at checkout.\n                        x-description-i18n:\n                          eng: Payment methods excluded from the payment process (except account_money, which is always allowed). The payment methods included here will not be available at checkout.\n                          spa: Métodos de pago excluidos del proceso de pago (excepto account_money, que siempre estará disponible). Los métodos de pago incluidos aquí no estarán disponibles en el checkout.\n                          por: Métodos de pagamento excluídos do checkout (exceto account_money, que estará sempre disponível). Os métodos de pagamento aqui incluídos não estarão disponíveis no checkout.\n                        items:\n                          type: object\n                          properties:\n                            id:\n                              type: string\n                              description: Payment method identifier.\n                              x-description-i18n:\n                                eng: Payment method identifier.\n                                spa: Identificador del medio de pago\n                                por: Id do meio de pagamento\n                      excluded_payment_types:\n                        type: array\n                        description: Payment types excluded from the payment process. The payment types included here will not be available at checkout.\n                        x-description-i18n:\n                          eng: Payment types excluded from the payment process. The payment types included here will not be available at checkout.\n                          spa: Tipos de pago excluidos del proceso de pago. Los tipos de pago incluidos aquí no estarán disponibles en el checkout.\n                          por: Tipos de pagamento excluídos do processo de pagamento. Os tipos de pagamento incluídos aqui não estarão disponíveis no checkout.\n                        items:\n                          type: object\n                          properties:\n                            id:\n                              type: string\n                              description: Payment type identifier\n                              x-description-i18n:\n                                eng: Payment type identifier\n                                spa: Identificador del tipo de pago\n                                por: Identificador do tipo de pagamento\n                      installments:\n                        type: string\n                        format: nullable\n                        description: Maximum number of credit card installments to be accepted.\n                        x-description-i18n:\n                          eng: Maximum number of credit card installments to be accepted.\n                          spa: Máximo número de cuotas\n                          por: Número Máximo de cotas\n                      default_payment_method_id:\n                        type: string\n                        format: nullable\n                        description: Suggested payment method. The user will initiate the checkout this this payment method already selected. It is considered suggested because Checkouts follow different logics in order to select the best payment method for a specific transaction, and this property is the option with the least relevance.\n                        x-description-i18n:\n                          eng: Suggested payment method. The user will initiate the checkout this this payment method already selected. It is considered suggested because Checkouts follow different logics in order to select the best payment method for a specific transaction, and this property is the option with the least relevance.\n                          spa: Forma de pago sugerida. El usuario iniciará el pago con este método de pago ya seleccionado. Se considera sugerida porque los Checkouts siguen lógicas diferentes para seleccionar el mejor método de pago para una transacción específica, siendo esta propiedad la opción con menor relevancia.\n                          por: Forma de pagamento sugerida. O usuário iniciará o pagamento com esta forma de pagamento já selecionada. Considera-se sugerido porque os Checkouts seguem lógicas diferentes para selecionar o melhor meio de pagamento para uma determinada transação, sendo esta propriedade a opção menos relevante.\n                      default_installments:\n                        type: string\n                        format: nullable\n                        description: Prefered number of credit card installments.\n                        x-description-i18n:\n                          eng: Prefered number of credit card installments.\n                          spa: Preferencia de cuotas\n                          por: Preferência de cotas\n                  client_id:\n                    type: string\n                    example: 6295877106812064\n                    description: Unique ID used to identify the client. It is obtained from the credentials used to create the preference. It´s the application ID.\n                    x-description-i18n:\n                      eng: Unique ID used to identify the client. It is obtained from the credentials used to create the preference. It´s the application ID.\n                      spa: ID único utilizada para identificar al cliente. Se obtiene a partir de las credenciales utilizadas para crear la preferencia. Es el Application ID.\n                      por: ID exclusivo usado para identificar o cliente. Obtido das credenciais usadas para criar a preferência. É o Application ID.\n                  marketplace:\n                    type: string\n                    example: MP-MKT-6295877106812064\n                    description: Origin of the payment. This is an alphanumeric field whose default value is NONE. If the collector has their own marketplace, this is where the credentials to identify it are sent. As the marketplace is associated to the Application ID, the marketplace credentials must correspond to the credentials used to create the preference. Using the wrong credentials will result in an error.\n                    x-description-i18n:\n                      eng: Origin of the payment. This is an alphanumeric field whose default value is NONE. If the collector has their own marketplace, this is where the credentials to identify it are sent. As the marketplace is associated to the Application ID, the marketplace credentials must correspond to the credentials used to create the preference. Using the wrong credentials will result in an error.\n                      spa: Origen del pago. Este es un campo alfanumérico cuyo valor por defecto es NONE. Si el collector tiene su propio marketplace, aquí es donde se envían las credenciales para identificarlo. Como el marketplace está asociado al Application ID, las credenciales del marketplace deben corresponder a las credenciales utilizadas para crear la preferencia. El uso de credenciales incorrectas dará como resultado un error.\n                      por: Origem do pagamento. Este é um campo alfanumérico cujo valor padrão é NONE. Caso o coletor tenha seu próprio marketplace, é para onde são enviadas as credenciais para identificá-lo. Como o marketplace está associado ao Application ID, as credenciais do marketplace devem corresponder às credenciais usadas para criar a preferência. Usar as credenciais erradas resultará em um erro.\n                  marketplace_fee:\n                    type: number\n                    example: 0\n                    description: Marketplace`s fee charged by application owner. It is a fixed amount and its default value is 0 in local currency. This property can only be sent if a valid marketplace has been defined as well, otherwise the request will fail.\n                    x-description-i18n:\n                      eng: Marketplace`s fee charged by application owner. It is a fixed amount and its default value is 0 in local currency. This property can only be sent if a valid marketplace has been defined as well, otherwise the request will fail.\n                      spa: Tarifa de Marketplace cobrada por el propietario de la aplicación. Es una cantidad fija y su valor por defecto es 0 en moneda local. Esta propiedad solo se puede enviar si también se ha definido un marketplace válido; de lo contrario, la solicitud fallará.\n                      por: Taxa de Marketplace cobrada pelo proprietário da aplicação. É um valor fixo e seu valor padrão é 0 em moeda local. Esta propriedade só pode ser apresentada se também tiver sido definido um marketplace válido e, caso contrário, a solicitação falhará.\n                  shipments:\n                    type: object\n                    description: Shipments information.\n                    x-description-i18n:\n                      eng: Shipments information.\n                      spa: Información de envío\n                      por: Informações de envio\n                    properties:\n                      receiver_address:\n                        type: object\n                        description: Shipping address.\n                        x-description-i18n:\n                          eng: Shipping address.\n                          spa: Dirección de envío\n                          por: Endereço de envio\n                        properties:\n                          zip_code:\n                            type: string\n                            description: Zip code.\n                            x-description-i18n:\n                              eng: Zip code.\n                              spa: Código postal\n                              por: Código postal\n                          street_number:\n                            type: string\n                            format: nullable\n                            description: Street number.\n                            x-description-i18n:\n                              eng: Street number.\n                              spa: Número\n                              por: O Número\n                          street_name:\n                            type: string\n                            description: Street name.\n                            x-description-i18n:\n                              eng: Street name.\n                              spa: Calle\n                              por: Rua\n                          floor:\n                            type: string\n                            description: Floor.\n                            x-description-i18n:\n                              eng: Floor.\n                              spa: Piso\n                              por: Apartamento\n                          apartment:\n                            type: string\n                            description: Apartment.\n                            x-description-i18n:\n                              eng: Apartment.\n                              spa: Departamento\n                              por: Apartamento\n                  notification_url:\n                    type: string\n                    format: nullable\n                    description: URL where you'd like to receive a payment notification.\n                    x-description-i18n:\n                      eng: URL where you'd like to receive a payment notification.\n                      spa: URL a la cual te gustaría recibir notificaciones de pagos\n                      por: URL para a qual você gostaria de receber notificações de pagamentos\n                  statement_descriptor:\n                    type: string\n                    example: MERCADOPAGO\n                    description: The statement descriptor is a long text (up to 16 characters) that will be visualized in the payer´s credit card statement to easily identify the purchase.\n                    x-description-i18n:\n                      eng: The statement descriptor is a long text (up to 16 characters) that will be visualized in the payer´s credit card statement to easily identify the purchase.\n                      spa: El statement descriptor es un texto largo (hasta 16 caracteres) que se visualizará en la factura de la tarjeta de crédito del pagador para identificar fácilmente la compra.\n                      por: O statement descriptor é um texto longo (até 16 caracteres) que será exibido na fatura do cartão de crédito do pagador para identificar facilmente a compra.\n                  external_reference:\n                    type: string\n                    description: Reference you can synchronize with your payment system.\n                    x-description-i18n:\n                      eng: Reference you can synchronize with your payment system.\n                      spa: Referencia que puedes sincronizar con tu sistema de pagos\n                      por: Referência que pode sincronizar com seu sistema de pagamentos\n                  additional_info:\n                    type: string\n                    description: Additional information.\n                    x-description-i18n:\n                      eng: Additional information.\n                      spa: Información adicional\n                      por: Informações adicionais\n                  expires:\n                    type: boolean\n                    description: Boolean value that determines if a preference expires.\n                    x-description-i18n:\n                      eng: Boolean value that determines if a preference expires.\n                      spa: Preferencia que determina si una preferencia expira\n                      por: Preferência que determina se uma preferência expira\n                  expiration_date_from:\n                    type: string\n                    format: nullable\n                    description: Date in YYYY-MM-DD-HH-MM-SS format which indicates the start of the preference`s validity period. This can be used, for instance, for limited sales, where sellers make an offer between certain dates.\n                    x-description-i18n:\n                      eng: Date in YYYY-MM-DD-HH-MM-SS format which indicates the start of the preference`s validity period. This can be used, for instance, for limited sales, where sellers make an offer between certain dates.\n                      spa: Fecha en formato AAAA-MM-DD-HH-MM-SS que indica el inicio del período de validez de la preferencia. Esto se puede usar, por ejemplo, para ventas limitadas, donde los vendedores hacen una oferta entre ciertas fechas.\n                      por: Data no formato AAAA-MM-DD-HH-MM-SS que indica o início do período de validade da preferência. Isso pode ser usado, por exemplo, para vendas limitadas, onde os vendedores fazem uma oferta entre determinadas datas.\n                  expiration_date_to:\n                    type: string\n                    format: nullable\n                    description: Date in YYYY-MM-DD-HH-MM-SS format which indicates the end of the preference`s validity period. This can be used, for instance, for limited sales, where sellers make an offer between certain dates.\n                    x-description-i18n:\n                      eng: Date in YYYY-MM-DD-HH-MM-SS format which indicates the end of the preference`s validity period. This can be used, for instance, for limited sales, where sellers make an offer between certain dates.\n                      spa: Fecha en formato AAAA-MM-DD-HH-MM-SS que indica el final del período de validez de la preferencia. Esto se puede usar, por ejemplo, para ventas limitadas, donde los vendedores hacen una oferta entre ciertas fechas.\n                      por: Data no formato AAAA-MM-DD-HH-MM-SS que indica o início do período de validade da preferência. Isso pode ser usado, por exemplo, para vendas limitadas, onde os vendedores fazem uma oferta entre determinadas datas.\n                  date_created:\n                    type: string\n                    example: 2018-02-02T19:22:23.535Z\n                    description: Registration date.\n                    x-description-i18n:\n                      eng: Registration date.\n                      spa: Fecha de registración\n                      por: Data de registro\n                  id:\n                    type: string\n                    example: 202809963-920c288b-4ebb-40be-966f-700250fa5370\n                    description: Autogenerated unique ID that identifies the preference. For example 036151801-2484cd71-7140-4c51-985a-d4cfcf133baf\n                    x-description-i18n:\n                      eng: Autogenerated unique ID that identifies the preference. For example 036151801-2484cd71-7140-4c51-985a-d4cfcf133baf\n                      spa: ID único generado automáticamente que identifica la preferencia. Por ejemplo 036151801-2484cd71-7140-4c51-985a-d4cfcf133baf\n                      por: ID exclusivo gerado automaticamente que identifica a preferência. Por exemplo 036151801-2484cd71-7140-4c51-985a-d4cfcf133baf\n                  init_point:\n                    type: string\n                    example: \n                      https://www.mercadopago.com/mla/checkout/start?pref_id=202809963-920c288b-4ebb-40be-966f-700250fa5370\n                    description: Automatically generated URL to open the Checkout.\n                    x-description-i18n:\n                      eng: Automatically generated URL to open the Checkout.\n                      spa: URL generada automáticamente para abrir el Checkout.\n                      por: URL gerado automaticamente para abrir o Checkout.\n                  sandbox_init_point:\n                    type: string\n                    example: \n                      https://sandbox.mercadopago.com/mla/checkout/pay?pref_id=202809963-920c288b-4ebb-40be-966f-700250fa5370\n                    description: Automatically generated URL to open the Checkout in sandbox mode. Real users are used here, but transactions are executed using test credentials.\n                    x-description-i18n:\n                      eng: Automatically generated URL to open the Checkout in sandbox mode. Real users are used here, but transactions are executed using test credentials.\n                      spa: URL generada automáticamente para abrir el Checkout en modo sandbox. Aquí se utilizan usuarios reales, pero las transacciones se ejecutan con credenciales de prueba.\n                      por: URL gerado automaticamente para abrir o Checkout no modo sandbox. Usuários reais são usados ​​aqui, mas as transações são executadas com credenciais de teste.\n                  metadata:\n                    type: object\n                    description: Valid JSON that can be added to the payment to save additional attributes.\n                    x-description-i18n:\n                      eng: Valid JSON that can be added to the payment to save additional attributes.\n                      spa: JSON válido que puede agregarse al pago para guardar atributos adicionales\n                      por: JSON válido que pode ser adicionado ao pagamento para salvar atributos adicionais\n        '400':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - collector_does_not_comply_with_current_regulation--identity validation required.\n                      - invalid_collector_id--collector_id invalid.\n                      - invalid_sponsor_id--sponsor_id is not an active user.\n                      - invalid_collector_email--collector is not collector_email owner\n                      - invalid_operation_type--operation_type invalid.\n                      - invalid_expiration_date_to--expiration_date_to invalid.\n                      - invalid_date--invalid date of expiration.\n                      - invalid_expiration_date_from--expiration_date_from invalid.\n                      - invalid_items--unit_price invalid.\n                      - invalid_back_urls--back_urls invalid. Wrong format\n                      - invalid_payment_methods--installments invalid. Should be a number between 1 and 36.\n                      - invalid_marketplace_fee--marketplace_fee must not be greater than total amount.\n                      - invalid_id--preference_id not found.\n                      - invalid_access_token--access denied\n                      - invalid_shipments--invalid type (<type>) for field shipments.cost.\n                      - invalid_binary_mode--binary_mode must be boolean.\n  /checkout/preferences/search:\n    get:\n      tags:\n        - $ref: '#/tags/checkout-pro'\n        - $ref: '#/tags/mobile-checkout'\n      summary: Search preferences\n      x-summary-i18n:\n        eng: Search preferences\n        spa: Buscar en preferencias\n        por: Buscar em preferências\n      description: Find all the information related to generated preferences using specific filters or a specific date range\n      x-description-i18n:\n        eng: Find all the information related to generated preferences using specific filters or a specific date range\n        spa: Encuentra toda la información de las preferencias generadas a través de filtros específicos o por un rango de fechas determinado\n        por: Encontre todas as informações das preferências geradas através de filtros específicos ou por uma faixa de datas específica\n      parameters:\n        - name: sponsor_id\n          in: query\n          description: Unique numeric ID to identify the sponsor. It is used to identify what platform the checkout flow was initiated in.\n          x-description-i18n:\n            eng: Unique numeric ID to identify the sponsor. It is used to identify what platform the checkout flow was initiated in.\n            spa: ID numérico único para identificar al sponsor. Se utiliza para identificar en qué plataforma se inició el flujo de pago.\n            por: ID numérico exclusivo para identificar o sponsor. É usado para identificar em qual plataforma o fluxo de pagamento foi iniciado.\n          schema:\n            type: string\n        - name: external_reference\n          in: query\n          description: Reference you can synchronize with your payment system.\n          x-description-i18n:\n            eng: Reference you can synchronize with your payment system.\n            spa: Referencia que puedes sincronizar con tu sistema de pagos\n            por: Referência que pode sincronizar com seu sistema de pagamentos\n          schema:\n            type: string\n        - name: site_id\n          in: query\n          description: The site id\n          x-description-i18n:\n            eng: The site id\n            spa: ID del site\n            por: ID do site\n          schema:\n            type: string\n          enum:\n            - MLA -- Mercado Libre Argentina\n            - MLB -- Mercado Libre Brasil\n            - MLC -- Mercado Libre Chile\n            - MLM -- Mercado Libre México\n            - MLU -- Mercado Libre Uruguay\n            - MCO -- Mercado Libre Colombia\n            - MPE -- Mercado Libre Perú\n        - name: marketplace\n          in: query\n          description: Marketplace ID.\n          x-description-i18n:\n            eng: Marketplace ID.\n            spa: ID del Marketplace\n            por: ID do Marketplace\n          schema:\n            type: string\n      responses:\n        '200':\n          description: Success\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  elements:\n                    type: array\n                    items:\n                      type: object\n                      properties:\n                        id:\n                          type: string\n                          example: 202809963-a2201f8d-11cb-443f-adf6-de5a42eed67d\n                          description: Preference ID.\n                          x-description-i18n:\n                            eng: Preference ID.\n                            spa: Identificador de preferencia\n                            por: Identificação de preferência\n                        client_id:\n                          type: string\n                          example: 6295877106812064\n                          description: Unique ID used to identify the client. It is obtained from the credentials used to create the preference. It´s the application ID.\n                          x-description-i18n:\n                            eng: Unique ID used to identify the client. It is obtained from the credentials used to create the preference. It´s the application ID.\n                            spa: ID único utilizada para identificar al cliente. Se obtiene a partir de las credenciales utilizadas para crear la preferencia. Es el Application ID.\n                            por: ID exclusivo usado para identificar o cliente. Obtido das credenciais usadas para criar a preferência. É o Application ID.\n                        collector_id:\n                          type: number\n                          example: 202809963\n                          description: Unique ID used to identify the collector. It is the same as the Cust ID.\n                          x-description-i18n:\n                            eng: Unique ID used to identify the collector. It is the same as the Cust ID.\n                            spa: ID único utilizada para identificar al collector. Es el mismo que el Cust ID.\n                            por: ID exclusivo usado para identificar o coletor. É o mesmo que o Cust ID.\n                        concept_id:\n                          type: string\n                          format: nullable\n                          description: Unique ID used to identify the concept.\n                          x-description-i18n:\n                            eng: Unique ID used to identify the concept.\n                            spa: ID único utilizado para identificar el concepto.\n                            por: ID exclusivo usado para identificar o conceito.\n                        corporation_id:\n                          type: string\n                          format: nullable\n                          description: Corporation identifier\n                          x-description-i18n:\n                            eng: Corporation identifier\n                            spa: Identificador de la corporación\n                            por: Identificador da corporação\n                        date_created:\n                          type: string\n                          example: 2018-02-02T19:18:51.150Z\n                          description: Registration date.\n                          x-description-i18n:\n                            eng: Registration date.\n                            spa: Fecha de registración\n                            por: Data de registro\n                        expiration_date_from:\n                          type: string\n                          format: nullable\n                          description: Date in YYYY-MM-DD-HH-MM-SS format which indicates the start of the preference`s validity period. This can be used, for instance, for limited sales, where sellers make an offer between certain dates.\n                          x-description-i18n:\n                            eng: Date in YYYY-MM-DD-HH-MM-SS format which indicates the start of the preference`s validity period. This can be used, for instance, for limited sales, where sellers make an offer between certain dates.\n                            spa: Fecha en formato AAAA-MM-DD-HH-MM-SS que indica el inicio del período de validez de la preferencia. Esto se puede usar, por ejemplo, para ventas limitadas, donde los vendedores hacen una oferta entre ciertas fechas.\n                            por: Data no formato AAAA-MM-DD-HH-MM-SS que indica o início do período de validade da preferência. Isso pode ser usado, por exemplo, para vendas limitadas, onde os vendedores fazem uma oferta entre determinadas datas.\n                        expiration_date_to:\n                          type: string\n                          format: nullable\n                          description: Date in YYYY-MM-DD-HH-MM-SS format which indicates the end of the preference`s validity period. This can be used, for instance, for limited sales, where sellers make an offer between certain dates.\n                          x-description-i18n:\n                            eng: Date in YYYY-MM-DD-HH-MM-SS format which indicates the end of the preference`s validity period. This can be used, for instance, for limited sales, where sellers make an offer between certain dates.\n                            spa: Fecha en formato AAAA-MM-DD-HH-MM-SS que indica el final del período de validez de la preferencia. Esto se puede usar, por ejemplo, para ventas limitadas, donde los vendedores hacen una oferta entre ciertas fechas.\n                            por: Data no formato AAAA-MM-DD-HH-MM-SS que indica o início do período de validade da preferência. Isso pode ser usado, por exemplo, para vendas limitadas, onde os vendedores fazem uma oferta entre determinadas datas.\n                        expires:\n                          type: boolean\n                          description: Boolean value that determines if a preference expires.\n                          x-description-i18n:\n                            eng: Boolean value that determines if a preference expires.\n                            spa: Preferencia que determina si una preferencia expira\n                            por: Preferência que determina se uma preferência expira\n                        external_reference:\n                          type: string\n                          description: Reference you can synchronize with your payment system.\n                          x-description-i18n:\n                            eng: Reference you can synchronize with your payment system.\n                            spa: Referencia que puedes sincronizar con tu sistema de pagos\n                            por: Referência que pode sincronizar com seu sistema de pagamentos\n                        integrator_id:\n                          type: string\n                          format: nullable\n                          description: Integrator identifier\n                          x-description-i18n:\n                            eng: Integrator identifier\n                            spa: Identificador del integrador\n                            por: Identificador do integrador\n                        items:\n                          type: array\n                          items:\n                            type: string\n                            example: Test Item\n                          description: items\n                        last_updated:\n                          type: string\n                          format: nullable\n                          description: Last updated date\n                          x-description-i18n:\n                            eng: Last updated date\n                            spa: Última fecha de actualización\n                            por: Data da última atualização\n                        live_mode:\n                          type: boolean\n                          description: Indicates whether the Payment was made in a production environment or in a Test environment. If TRUE, then the chargeback will be processed in production mode. If FALSE, then the chargeback will be processed in sandbox mode.\n                          x-description-i18n:\n                            eng: Indicates whether the Payment was made in a production environment or in a Test environment. If TRUE, then the chargeback will be processed in production mode. If FALSE, then the chargeback will be processed in sandbox mode.\n                            spa: Indica si el Pago se realizó en ambiente productivo o en un ambiente de Test. Si es TRUE, el contracargo se procesará en modo de producción. Si es FALSE, el contracargo se procesará en modo sandbox.\n                            por: Indica se o Pagamento foi feito em ambiente de produção ou em ambiente de Teste. Se TRUE, o estorno será processado em modo de produção. Se FALSE, o estorno será processado no modo sandbox.\n                        marketplace:\n                          type: string\n                          example: NONE\n                          description: Origin of the payment. This is an alphanumeric field whose default value is NONE. If the collector has their own marketplace, this is where the credentials to identify it are sent. As the marketplace is associated to the Application ID, the marketplace credentials must correspond to the credentials used to create the preference. Using the wrong credentials will result in an error.\n                          x-description-i18n:\n                            eng: Origin of the payment. This is an alphanumeric field whose default value is NONE. If the collector has their own marketplace, this is where the credentials to identify it are sent. As the marketplace is associated to the Application ID, the marketplace credentials must correspond to the credentials used to create the preference. Using the wrong credentials will result in an error.\n                            spa: Origen del pago. Este es un campo alfanumérico cuyo valor por defecto es NONE. Si el collector tiene su propio marketplace, aquí es donde se envían las credenciales para identificarlo. Como el marketplace está asociado al Application ID, las credenciales del marketplace deben corresponder a las credenciales utilizadas para crear la preferencia. El uso de credenciales incorrectas dará como resultado un error.\n                            por: Origem do pagamento. Este é um campo alfanumérico cujo valor padrão é NONE. Caso o coletor tenha seu próprio marketplace, é para onde são enviadas as credenciais para identificá-lo. Como o marketplace está associado ao Application ID, as credenciais do marketplace devem corresponder às credenciais usadas para criar a preferência. Usar as credenciais erradas resultará em um erro.\n                        operation_type:\n                          $ref: '#/components/schemas/operation_type'\n                        payer_email:\n                          type: string\n                          description: Payer’s email address.\n                          x-description-i18n:\n                            eng: Payer’s email address.\n                            spa: E-mail del pagador\n                            por: E-mail do pagante\n                        platform_id:\n                          type: string\n                          description: Platform identifier\n                          x-description-i18n:\n                            eng: Platform identifier\n                            spa: Identificador de la plataforma\n                            por: Identificador da plataforma\n                        processing_modes:\n                          type: string\n                          format: nullable\n                          description: Processing mode\n                          x-description-i18n:\n                            eng: Processing mode\n                            spa: Modo de procesamiento\n                            por: Modo de processamento\n                        product_id:\n                          type: string\n                          description: Unique ID used to identify the product.\n                          x-description-i18n:\n                            eng: Unique ID used to identify the product.\n                            spa: ID único utilizado para identificar el producto.\n                            por: ID exclusivo usado para identificar o produto.\n                        purpose:\n                          type: string\n                          description: This field has two possible values, empty and wallet_purchase.\n                          x-description-i18n:\n                            eng: This field has two possible values, empty and wallet_purchase.\n                            spa: Este campo tiene dos valores posibles, empty y wallet_purchase.\n                            por: Este campo tem dois valores possíveis, empty e wallet_purchase.\n                        site_id:\n                          type: string\n                          example: MLA\n                          description: Unique ID used to identify the site.\n                          x-description-i18n:\n                            eng: Unique ID used to identify the site.\n                            spa: ID único utilizado para identificar el site.\n                            por: ID exclusivo usado para identificar o site.\n                          enum:\n                            - MLA -- Mercado Libre Argentina\n                            - MLB -- Mercado Libre Brasil\n                            - MLC -- Mercado Libre Chile\n                            - MLM -- Mercado Libre México\n                            - MLU -- Mercado Libre Uruguay\n                            - MCO -- Mercado Libre Colombia\n                            - MPE -- Mercado Libre Perú\n                        sponsor_id:\n                          type: number\n                          example: 0\n                          description: Unique numeric ID to identify the sponsor. It is used to identify what platform the checkout flow was initiated in.\n                          x-description-i18n:\n                            eng: Unique numeric ID to identify the sponsor. It is used to identify what platform the checkout flow was initiated in.\n                            spa: ID numérico único para identificar al sponsor. Se utiliza para identificar en qué plataforma se inició el flujo de pago.\n                            por: ID numérico exclusivo para identificar o sponsor. É usado para identificar em qual plataforma o fluxo de pagamento foi iniciado.\n                    description: Elements\n                  next_offset:\n                    type: number\n                    example: 1\n                    description: Numeric field used to paginate the response.\n                    x-description-i18n:\n                      eng: Numeric field used to paginate the response.\n                      spa: Campo numérico utilizado para paginar la respuesta.\n                      por: Campo numérico usado para paginar a resposta.\n                  total:\n                    type: number\n                    example: 1\n                    description: total\n        '400':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - ds_search_query--invalid query.\n        '401':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - invalid_token--invalid_token.\n                      - invalid_caller_id--invalid caller_id\n  /checkout/preferences/{id}:\n    get:\n      tags:\n        - $ref: '#/tags/checkout-pro'\n        - $ref: '#/tags/mobile-checkout'\n      summary: Get preference\n      x-summary-i18n:\n        eng: Get preference\n        spa: Obtener preferencia\n        por: Obter preferência\n      description: Check all the payment information for a product or service with the ID of the preference of your choice\n      x-description-i18n:\n        eng: Check all the payment information for a product or service with the ID of the preference of your choice\n        spa: Consulta toda la información de pago de un producto o servicio con el ID de la preferencia que quieras\n        por: Veja todas as informações de pagamento de um produto ou serviço com a identificação da preferência desejada\n      parameters:\n        - name: id\n          in: path\n          description: Preference ID.\n          x-description-i18n:\n            eng: Preference ID.\n            spa: Identificador de preferencia\n            por: Identificação de preferência\n          required: true\n          schema:\n            type: string\n      responses:\n        '200':\n          description: Success\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  additional_info:\n                    type: string\n                    description: Additional information.\n                    x-description-i18n:\n                      eng: Additional information.\n                      spa: Información adicional\n                      por: Informações adicionais\n                  auto_return:\n                    $ref: '#/components/schemas/auto_return'\n                  back_urls:\n                    type: object\n                    description: URLs to return to the sellers website.\n                    x-description-i18n:\n                      eng: URLs to return to the sellers website.\n                      spa: URLs de retorno al sitio del vendedor\n                      por: Url de retorno ao site do vendedor\n                    properties:\n                      failure:\n                        type: string\n                        description: Canceled payment URL.\n                        x-description-i18n:\n                          eng: Canceled payment URL.\n                          spa: URL de retorno ante pago cancelado\n                          por: URL de retorno ante o pagamento cancelado\n                      pending:\n                        type: string\n                        description: Pending or in process payment URL.\n                        x-description-i18n:\n                          eng: Pending or in process payment URL.\n                          spa: URL de retorno ante pago pendiente o en proceso.\n                          por: URL de retorno diante de pagamento pendente ou em processo.\n                      success:\n                        type: string\n                        description: Approved payment URL.\n                        x-description-i18n:\n                          eng: Approved payment URL.\n                          spa: URL de retorno ante pago aprobado\n                          por: URL de retorno ante o pagamento aprovado\n                  client_id:\n                    type: string\n                    example: 6295877106812064\n                    description: Unique ID used to identify the client. It is obtained from the credentials used to create the preference. It´s the application ID.\n                    x-description-i18n:\n                      eng: Unique ID used to identify the client. It is obtained from the credentials used to create the preference. It´s the application ID.\n                      spa: ID único utilizada para identificar al cliente. Se obtiene a partir de las credenciales utilizadas para crear la preferencia. Es el Application ID.\n                      por: ID exclusivo usado para identificar o cliente. Obtido das credenciais usadas para criar a preferência. É o Application ID.\n                  collector_id:\n                    type: number\n                    example: 202809963\n                    description: Unique ID used to identify the collector. It is the same as the Cust ID.\n                    x-description-i18n:\n                      eng: Unique ID used to identify the collector. It is the same as the Cust ID.\n                      spa: ID único utilizada para identificar al collector. Es el mismo que el Cust ID.\n                      por: ID exclusivo usado para identificar o coletor. É o mesmo que o Cust ID.\n                  date_created:\n                    type: string\n                    example: 2018-02-02T19:18:51.150Z\n                    description: Registration date.\n                    x-description-i18n:\n                      eng: Registration date.\n                      spa: Fecha de registración\n                      por: Data de registro\n                  expiration_date_from:\n                    type: string\n                    format: nullable\n                    description: Date in YYYY-MM-DD-HH-MM-SS format which indicates the start of the preference`s validity period. This can be used, for instance, for limited sales, where sellers make an offer between certain dates.\n                    x-description-i18n:\n                      eng: Date in YYYY-MM-DD-HH-MM-SS format which indicates the start of the preference`s validity period. This can be used, for instance, for limited sales, where sellers make an offer between certain dates.\n                      spa: Fecha en formato AAAA-MM-DD-HH-MM-SS que indica el inicio del período de validez de la preferencia. Esto se puede usar, por ejemplo, para ventas limitadas, donde los vendedores hacen una oferta entre ciertas fechas.\n                      por: Data no formato AAAA-MM-DD-HH-MM-SS que indica o início do período de validade da preferência. Isso pode ser usado, por exemplo, para vendas limitadas, onde os vendedores fazem uma oferta entre determinadas datas.\n                  expiration_date_to:\n                    type: string\n                    format: nullable\n                    description: Date in YYYY-MM-DD-HH-MM-SS format which indicates the end of the preference`s validity period. This can be used, for instance, for limited sales, where sellers make an offer between certain dates.\n                    x-description-i18n:\n                      eng: Date in YYYY-MM-DD-HH-MM-SS format which indicates the end of the preference`s validity period. This can be used, for instance, for limited sales, where sellers make an offer between certain dates.\n                      spa: Fecha en formato AAAA-MM-DD-HH-MM-SS que indica el final del período de validez de la preferencia. Esto se puede usar, por ejemplo, para ventas limitadas, donde los vendedores hacen una oferta entre ciertas fechas.\n                      por: Data no formato AAAA-MM-DD-HH-MM-SS que indica o início do período de validade da preferência. Isso pode ser usado, por exemplo, para vendas limitadas, onde os vendedores fazem uma oferta entre determinadas datas.\n                  expires:\n                    type: boolean\n                    description: Boolean value that determines if a preference expires.\n                    x-description-i18n:\n                      eng: Boolean value that determines if a preference expires.\n                      spa: Preferencia que determina si una preferencia expira\n                      por: Preferência que determina se uma preferência expira\n                  external_reference:\n                    type: string\n                    description: Reference you can synchronize with your payment system.\n                    x-description-i18n:\n                      eng: Reference you can synchronize with your payment system.\n                      spa: Referencia que puedes sincronizar con tu sistema de pagos\n                      por: Referência que pode sincronizar com seu sistema de pagamentos\n                  id:\n                    type: string\n                    example: 202809963-a2201f8d-11cb-443f-adf6-de5a42eed67d\n                    description: Autogenerated unique ID that identifies the preference. For example 036151801-2484cd71-7140-4c51-985a-d4cfcf133baf\n                    x-description-i18n:\n                      eng: Autogenerated unique ID that identifies the preference. For example 036151801-2484cd71-7140-4c51-985a-d4cfcf133baf\n                      spa: ID único generado automáticamente que identifica la preferencia. Por ejemplo 036151801-2484cd71-7140-4c51-985a-d4cfcf133baf\n                      por: ID exclusivo gerado automaticamente que identifica a preferência. Por exemplo 036151801-2484cd71-7140-4c51-985a-d4cfcf133baf\n                  init_point:\n                    type: string\n                    example: \n                      https://www.mercadopago.com/mla/checkout/start?pref_id=202809963-a2201f8d-11cb-443f-adf6-de5a42eed67d\n                    description: Automatically generated URL to open the Checkout.\n                    x-description-i18n:\n                      eng: Automatically generated URL to open the Checkout.\n                      spa: URL generada automáticamente para abrir el Checkout.\n                      por: URL gerado automaticamente para abrir o Checkout.\n                  items:\n                    type: array\n                    description: Items information.\n                    x-description-i18n:\n                      eng: Items information.\n                      spa: Información sobre el ítem\n                      por: Informações sobre o item\n                    items:\n                      type: object\n                      properties:\n                        id:\n                          type: string\n                          example: item-ID-1234\n                          description: Item id.\n                          x-description-i18n:\n                            eng: Item id.\n                            spa: Identificador del ítem\n                            por: Id do anúncio\n                        currency_id:\n                          type: string\n                          example: $\n                          description: Unique ID to identify the currency. ISO_4217 code. Some sites allow local currency and USD, but it is important to note that the amount is converted to local currency when the preference is created, as the checkout always processes transactions using local currency. If you use USD please take into consideration that this value is not automatically updated if the value of local currency changes in relation to USD.\n                          x-description-i18n:\n                            eng: Unique ID to identify the currency. ISO_4217 code. Some sites allow local currency and USD, but it is important to note that the amount is converted to local currency when the preference is created, as the checkout always processes transactions using local currency. If you use USD please take into consideration that this value is not automatically updated if the value of local currency changes in relation to USD.\n                            spa: ID único para identificar la moneda. Código ISO_4217. Algunos sitios permiten la moneda local y USD, pero es importante tener en cuenta que el monto se convierte a moneda local cuando se crea la preferencia, ya que el checkout siempre procesa las transacciones en moneda local. Si usas USD, ten en cuenta que este valor no se actualiza automáticamente si el valor de la moneda local cambia en relación a USD.\n                            por: ID exclusivo para identificar a moeda. Código ISO_4217. Alguns sites permitem moeda local e USD, mas é importante observar que o valor é convertido para moeda local quando a preferência é criada, pois o checkout sempre processa as transações em moeda local. Se você estiver usando USD, observe que esse valor não é atualizado automaticamente se o valor da moeda local mudar em relação ao USD.\n                          enum:\n                            - ARS -- Argentine peso.\n                            - BRL -- Brazilian real.\n                            - CLP -- Chilean peso.\n                            - MXN -- Mexican peso.\n                            - COP -- Colombian peso.\n                            - PEN -- Peruvian sol.\n                            - UYU -- Uruguayan peso.\n                        title:\n                          type: string\n                          example: Practical Granite Shirt\n                          description: This is the item`s title, which will display during the payment process, at checkout, activities, and emails.\n                          x-description-i18n:\n                            eng: This is the item`s title, which will display during the payment process, at checkout, activities, and emails.\n                            spa: Este es el título del ítem, que se mostrará durante el proceso de pago, en el checkout, actividades y correos electrónicos.\n                            por: Este é o título do item, que será exibido durante o processo de pagamento, no checkout, nas atividades e nos e-mails.\n                        picture_url:\n                          type: string\n                          example: http://placehold.it/350x150\n                          description: Item image URL.\n                          x-description-i18n:\n                            eng: Item image URL.\n                            spa: URL de imagen del ítem\n                            por: URL da imagem do anúncio\n                        description:\n                          type: string\n                          example: \n                            This is my description\n                          description: Item description. This is a free text field.\n                          x-description-i18n:\n                            eng: Item description. This is a free text field.\n                            spa: Esto es un string libre donde se puede agregar la categoría del ítem.\n                            por: Esta é uma string livre onde a categoria do item pode ser adicionada.\n                        category_id:\n                          type: string\n                          description: This is a free string where the item category can be added.\n                          x-description-i18n:\n                            eng: This is a free string where the item category can be added.\n                            spa: Esto es un string libre donde se puede agregar la categoría del ítem.\n                            por: Esta é uma string livre onde a categoria do item pode ser adicionada.\n                        quantity:\n                          type: number\n                          example: 2\n                          description: Item quantity. This property is used to calculate the total cost.\n                          x-description-i18n:\n                            eng: Item quantity. This property is used to calculate the total cost.\n                            spa: Cantidad de ítems. Esta propiedad se utiliza para calcular el costo total.\n                            por: Quantidade de itens. Esta propriedade é usada para calcular o custo total.\n                        unit_price:\n                          type: number\n                          example: 14.5\n                          description: Unit price of the item. This property is used together with the property quantity to determine the order cost.\n                          x-description-i18n:\n                            eng: Unit price of the item. This property is used together with the property quantity to determine the order cost.\n                            spa: Precio unitario del ítem. Esta propiedad se usa junto con propiedad quantity para determinar el costo de la orden.\n                            por: Preço unitário do item. Essa propriedade é usada em conjunto com a propriedade de quantity para determinar o custo do pedido.\n                  marketplace:\n                    type: string\n                    example: MP-MKT-6295877106812064\n                    description: Origin of the payment. This is an alphanumeric field whose default value is NONE. If the collector has their own marketplace, this is where the credentials to identify it are sent. As the marketplace is associated to the Application ID, the marketplace credentials must correspond to the credentials used to create the preference. Using the wrong credentials will result in an error.\n                    x-description-i18n:\n                      eng: Origin of the payment. This is an alphanumeric field whose default value is NONE. If the collector has their own marketplace, this is where the credentials to identify it are sent. As the marketplace is associated to the Application ID, the marketplace credentials must correspond to the credentials used to create the preference. Using the wrong credentials will result in an error.\n                      spa: Origen del pago. Este es un campo alfanumérico cuyo valor por defecto es NONE. Si el collector tiene su propio marketplace, aquí es donde se envían las credenciales para identificarlo. Como el marketplace está asociado al Application ID, las credenciales del marketplace deben corresponder a las credenciales utilizadas para crear la preferencia. El uso de credenciales incorrectas dará como resultado un error.\n                      por: Origem do pagamento. Este é um campo alfanumérico cujo valor padrão é NONE. Caso o coletor tenha seu próprio marketplace, é para onde são enviadas as credenciais para identificá-lo. Como o marketplace está associado ao Application ID, as credenciais do marketplace devem corresponder às credenciais usadas para criar a preferência. Usar as credenciais erradas resultará em um erro.\n                  marketplace_fee:\n                    type: number\n                    example: 0\n                    description: Marketplace`s fee charged by application owner. It is a fixed amount and its default value is 0 in local currency. This property can only be sent if a valid marketplace has been defined as well, otherwise the request will fail.\n                    x-description-i18n:\n                      eng: Marketplace`s fee charged by application owner. It is a fixed amount and its default value is 0 in local currency. This property can only be sent if a valid marketplace has been defined as well, otherwise the request will fail.\n                      spa: Tarifa de Marketplace cobrada por el propietario de la aplicación. Es una cantidad fija y su valor por defecto es 0 en moneda local. Esta propiedad solo se puede enviar si también se ha definido un marketplace válido; de lo contrario, la solicitud fallará.\n                      por: Taxa de Marketplace cobrada pelo proprietário da aplicação. É um valor fixo e seu valor padrão é 0 em moeda local. Esta propriedade só pode ser apresentada se também tiver sido definido um marketplace válido e, caso contrário, a solicitação falhará.\n                  notification_url:\n                    type: string\n                    format: nullable\n                    description: URL where you'd like to receive a payment notification.\n                    x-description-i18n:\n                      eng: URL where you'd like to receive a payment notification.\n                      spa: URL a la cual te gustaría recibir notificaciones de pagos\n                      por: URL para a qual você gostaria de receber notificações de pagamentos\n                  statement_descriptor:\n                    type: string\n                    example: MERCADOPAGO\n                    description: The statement descriptor is a long text (up to 16 characters) that will be visualized in the payer´s credit card statement to easily identify the purchase.\n                    x-description-i18n:\n                      eng: The statement descriptor is a long text (up to 16 characters) that will be visualized in the payer´s credit card statement to easily identify the purchase.\n                      spa: El statement descriptor es un texto largo (hasta 16 caracteres) que se visualizará en la factura de la tarjeta de crédito del pagador para identificar fácilmente la compra.\n                      por: O statement descriptor é um texto longo (até 16 caracteres) que será exibido na fatura do cartão de crédito do pagador para identificar facilmente a compra.\n                  operation_type:\n                    $ref: '#/components/schemas/operation_type'\n                  payer:\n                    type: object\n                    description: Buyer information, such as name, last name, e-mail, phone, personal identification, address, and registration date.\n                    x-description-i18n:\n                      eng: Buyer information, such as name, last name, e-mail, phone, personal identification, address, and registration date.\n                      spa: Información del comprador, como nombre, apellido, correo electrónico, teléfono, identificación personal, dirección y fecha de registro.\n                      por: Informações do comprador, como nome, sobrenome, e-mail, telefone, identificação pessoal, endereço e data de registro.\n                    properties:\n                      phone:\n                        type: object\n                        description: Buyer’s phone number.\n                        x-description-i18n:\n                          eng: Buyer’s phone number.\n                          spa: Teléfono del comprador\n                          por: Telefone do comprador\n                        properties:\n                          area_code:\n                            type: string\n                            description: Area code.\n                            x-description-i18n:\n                              eng: Area code.\n                              spa: Código de área\n                              por: Código de área\n                          number:\n                            type: string\n                            example: 631.586.0213\n                            description: Phone number.\n                            x-description-i18n:\n                              eng: Phone number.\n                              spa: Número telefónico\n                              por: Número de telefone\n                      address:\n                        type: object\n                        description: Buyer’s address.\n                        x-description-i18n:\n                          eng: Buyer’s address.\n                          spa: Dirección del comprador\n                          por: Endereço do comprador\n                        properties:\n                          zip_code:\n                            type: string\n                            example: 76336\n                            description: Zip code.\n                            x-description-i18n:\n                              eng: Zip code.\n                              spa: Código postal\n                              por: Código postal\n                          street_name:\n                            type: string\n                            example: Marjory Stream\n                            description: Street name.\n                            x-description-i18n:\n                              eng: Street name.\n                              spa: Calle\n                              por: Rua\n                          street_number:\n                            type: string\n                            example: 941\n                            description: Street number.\n                            x-description-i18n:\n                              eng: Street number.\n                              spa: Número\n                              por: O Número\n                      email:\n                        type: string\n                        description: Payer’s email address.\n                        x-description-i18n:\n                          eng: Payer’s email address.\n                          spa: E-mail del pagador\n                          por: E-mail do pagante\n                      identification:\n                        type: object\n                        description: Payer ID.\n                        x-description-i18n:\n                          eng: Payer ID.\n                          spa: Identificador de pagador\n                          por: Identificador de pagador\n                        properties:\n                          number:\n                            type: string\n                            example: 12345678\n                            description: Identification number.\n                            x-description-i18n:\n                              eng: Identification number.\n                              spa: Número de identificación\n                              por: Número de identificação\n                          type:\n                            type: string\n                            example: DNI\n                            description: Identification Type.\n                            x-description-i18n:\n                              eng: Identification Type.\n                              spa: Tipo de identificación\n                              por: Tipo de identificação\n                      name:\n                        type: string\n                        description: Buyer’s name.\n                        x-description-i18n:\n                          eng: Buyer’s name.\n                          spa: Nombre del comprador\n                          por: Nome do comprador\n                      surname:\n                        type: string\n                        description: Buyer’s last name.\n                        x-description-i18n:\n                          eng: Buyer’s last name.\n                          spa: Apellido del comprador\n                          por: Sobrenome do comprador\n                      date_created:\n                        type: string\n                        description: Registration date.\n                        x-description-i18n:\n                          eng: Registration date.\n                          spa: Fecha de registración\n                          por: Data de registro\n                  payment_methods:\n                    type: object\n                    description: All configuration related to payments methods, such as excluded payment methods, excluded payment types, default payment method, and installments.\n                    x-description-i18n:\n                      eng: All configuration related to payments methods, such as excluded payment methods, excluded payment types, default payment method, and installments.\n                      spa: Toda la configuración relacionada con los métodos de pago, tales como los métodos de pago excluidos, los tipos de pago excluidos, el método de pago predeterminado y las cuotas.\n                      por: Todas as configurações são relacionadas ao métodos de pagamento, como, por exemplo, métodos de pagamento excluídos, tipos de pagamento excluídos, método de pagamento padrão e taxas.\n                    properties:\n                      excluded_payment_methods:\n                        type: array\n                        description: Payment methods excluded from the payment process (except account_money, which is always allowed). The payment methods included here will not be available at checkout.\n                        x-description-i18n:\n                          eng: Payment methods excluded from the payment process (except account_money, which is always allowed). The payment methods included here will not be available at checkout.\n                          spa: Métodos de pago excluidos del proceso de pago (excepto account_money, que siempre estará disponible). Los métodos de pago incluidos aquí no estarán disponibles en el checkout.\n                          por: Métodos de pagamento excluídos do checkout (exceto account_money, que estará sempre disponível). Os métodos de pagamento aqui incluídos não estarão disponíveis no checkout.\n                        items:\n                          type: object\n                          properties:\n                            id:\n                              type: string\n                              description: Payment method identifier.\n                              x-description-i18n:\n                                eng: Payment method identifier.\n                                spa: Identificador del medio de pago\n                                por: Id do meio de pagamento\n                      default_installments:\n                        type: string\n                        format: nullable\n                        description: Prefered number of credit card installments.\n                        x-description-i18n:\n                          eng: Prefered number of credit card installments.\n                          spa: Preferencia de cuotas\n                          por: Preferência de cotas\n                      default_payment_method_id:\n                        type: string\n                        format: nullable\n                        description: Suggested payment method. The user will initiate the checkout this this payment method already selected. It is considered suggested because Checkouts follow different logics in order to select the best payment method for a specific transaction, and this property is the option with the least relevance.\n                        x-description-i18n:\n                          eng: Suggested payment method. The user will initiate the checkout this this payment method already selected. It is considered suggested because Checkouts follow different logics in order to select the best payment method for a specific transaction, and this property is the option with the least relevance.\n                          spa: Forma de pago sugerida. El usuario iniciará el pago con este método de pago ya seleccionado. Se considera sugerida porque los Checkouts siguen lógicas diferentes para seleccionar el mejor método de pago para una transacción específica, siendo esta propiedad la opción con menor relevancia.\n                          por: Forma de pagamento sugerida. O usuário iniciará o pagamento com esta forma de pagamento já selecionada. Considera-se sugerido porque os Checkouts seguem lógicas diferentes para selecionar o melhor meio de pagamento para uma determinada transação, sendo esta propriedade a opção menos relevante.\n                      excluded_payment_types:\n                        type: array\n                        description: Payment types excluded from the payment process. The payment types included here will not be available at checkout.\n                        x-description-i18n:\n                          eng: Payment types excluded from the payment process. The payment types included here will not be available at checkout.\n                          spa: Tipos de pago excluidos del proceso de pago. Los tipos de pago incluidos aquí no estarán disponibles en el checkout.\n                          por: Tipos de pagamento excluídos do processo de pagamento. Os tipos de pagamento incluídos aqui não estarão disponíveis no checkout.\n                        items:\n                          type: object\n                          properties:\n                            id:\n                              type: string\n                              description: Payment type identifier\n                              x-description-i18n:\n                                eng: Payment type identifier\n                                spa: Identificador del tipo de pago\n                                por: Identificador do tipo de pagamento\n                      installments:\n                        type: string\n                        format: nullable\n                        description: Maximum number of credit card installments to be accepted.\n                        x-description-i18n:\n                          eng: Maximum number of credit card installments to be accepted.\n                          spa: Máximo número de cuotas\n                          por: Número Máximo de cotas\n                  sandbox_init_point:\n                    type: string\n                    example: \n                      https://sandbox.mercadopago.com/mla/checkout/pay?pref_id=202809963-a2201f8d-11cb-443f-adf6-de5a42eed67d\n                    description: Automatically generated URL to open the Checkout in sandbox mode. Real users are used here, but transactions are executed using test credentials.\n                    x-description-i18n:\n                      eng: Automatically generated URL to open the Checkout in sandbox mode. Real users are used here, but transactions are executed using test credentials.\n                      spa: URL generada automáticamente para abrir el Checkout en modo sandbox. Aquí se utilizan usuarios reales, pero las transacciones se ejecutan con credenciales de prueba.\n                      por: URL gerado automaticamente para abrir o Checkout no modo sandbox. Usuários reais são usados ​​aqui, mas as transações são executadas com credenciais de teste.\n                  shipments:\n                    type: object\n                    description: Shipments information.\n                    x-description-i18n:\n                      eng: Shipments information.\n                      spa: Información de envío\n                      por: Informações de envio\n                    properties:\n                      receiver_address:\n                        type: object\n                        description: Shipping address.\n                        x-description-i18n:\n                          eng: Shipping address.\n                          spa: Dirección de envío\n                          por: Endereço de envio\n                        properties:\n                          floor:\n                            type: string\n                            description: Floor.\n                            x-description-i18n:\n                              eng: Floor.\n                              spa: Piso\n                              por: Apartamento\n                          zip_code:\n                            type: string\n                            description: Zip code.\n                            x-description-i18n:\n                              eng: Zip code.\n                              spa: Código postal\n                              por: Código postal\n                          street_name:\n                            type: string\n                            description: Street name.\n                            x-description-i18n:\n                              eng: Street name.\n                              spa: Calle\n                              por: Rua\n                          apartment:\n                            type: string\n                            description: Apartment.\n                            x-description-i18n:\n                              eng: Apartment.\n                              spa: Departamento\n                              por: Apartamento\n                          street_number:\n                            type: string\n                            format: nullable\n                            description: Street number.\n                            x-description-i18n:\n                              eng: Street number.\n                              spa: Número\n                              por: O Número\n        '400':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - invalid_collector_id--collector_id invalid.\n                      - invalid_sponsor_id--sponsor_id is not an active user.\n                      - invalid_collector_email--collector is not collector_email owner.\n                      - invalid_operation_type--operation_type invalid.\n                      - invalid_expiration_date_to--expiration_date_to invalid.\n                      - invalid_expiration_date_from--expiration_date_from invalid.\n                      - invalid_items--unit_price invalid.\n                      - invalid_payer--payer email invalid. Max length 150.\n                      - invalid_back_urls--back_urls invalid. Wrong format.\n                      - invalid_payment_methods--installments invalid. Should be a number between 1 and 36.\n                      - invalid_marketplace_fee--marketplace_fee must not be greater than total amount.\n                      - invalid_id--preference_id not found.\n                      - invalid_access_token--access denied.\n                      - invalid_shipments--Invalid total amount, with me2 it cannot be lesser than <limit>.\n    put:\n      tags:\n        - $ref: '#/tags/checkout-pro'\n        - $ref: '#/tags/mobile-checkout'\n      summary: Update preference\n      x-summary-i18n:\n        eng: Update preference\n        spa: Actualizar preferencia\n        por: Atualizar preferência\n      description: Renew the details of a payment preference. Indicate the ID of the preference and send the parameters with the information you want to update\n      x-description-i18n:\n        eng: Renew the details of a payment preference. Indicate the ID of the preference and send the parameters with the information you want to update\n        spa: Renueva los datos de una preferencia de pago. Indica el ID de la preferencia y envía los parámetros con la información que quieras actualizar\n        por: Atualizar os detalhes de uma preferência de pagamento. Digite o ID da preferência e envie as informações que você deseja atualizar\n      parameters:\n        - name: id\n          in: path\n          description: The preference's ID\n          x-description-i18n:\n            eng: The preference's ID\n            spa: The preference's ID\n            por: The preference's ID\n          required: true\n          schema:\n            type: string\n      requestBody:\n        content:\n          application/json:\n            schema:\n              type: object\n              properties:\n                items:\n                  type: array\n                  description: Items information.\n                  x-description-i18n:\n                    eng: Items information.\n                    spa: Información sobre el ítem\n                    por: Informações sobre o item\n                  items:\n                    type: object\n                    properties:\n                      id:\n                        type: string\n                        example: 202809963-a2201f8d-11cb-443f-adf6-de5a42eed67d\n                        description: Item ID.\n                        x-description-i18n:\n                          eng: Item ID.\n                          spa: Indentificador del ítem\n                          por: Indentificador do item\n                      title:\n                        type: string\n                        example: Dummy Title\n                        description: This is the item`s title, which will display during the payment process, at checkout, activities, and emails.\n                        x-description-i18n:\n                          eng: This is the item`s title, which will display during the payment process, at checkout, activities, and emails.\n                          spa: Este es el título del ítem, que se mostrará durante el proceso de pago, en el checkout, actividades y correos electrónicos.\n                          por: Este é o título do item, que será exibido durante o processo de pagamento, no checkout, nas atividades e nos e-mails.\n                      description:\n                        type: string\n                        example: Dummy Description\n                        description: Item description. This is a free text field.\n                        x-description-i18n:\n                          eng: Item description. This is a free text field.\n                          spa: Esto es un string libre donde se puede agregar la categoría del ítem.\n                          por: Esta é uma string livre onde a categoria do item pode ser adicionada.\n                      picture_url:\n                        type: string\n                        example: http://www.myapp.com/myimage.jpg\n                        description: Item image URL.\n                        x-description-i18n:\n                          eng: Item image URL.\n                          spa: URL de imagen del ítem\n                          por: URL da imagem do anúncio\n                      category_id:\n                        type: string\n                        example: cat123\n                        description: This is a free string where the item category can be added.\n                        x-description-i18n:\n                          eng: This is a free string where the item category can be added.\n                          spa: Esto es un string libre donde se puede agregar la categoría del ítem.\n                          por: Esta é uma string livre onde a categoria do item pode ser adicionada.\n                      quantity:\n                        type: number\n                        example: 1\n                        description: Item quantity. This property is used to calculate the total cost.\n                        x-description-i18n:\n                          eng: Item quantity. This property is used to calculate the total cost.\n                          spa: Cantidad de ítems. Esta propiedad se utiliza para calcular el costo total.\n                          por: Quantidade de itens. Esta propriedade é usada para calcular o custo total.\n                      currency_id:\n                        type: string\n                        example: U$\n                        description: Unique ID to identify the currency. ISO_4217 code. Some sites allow local currency and USD, but it is important to note that the amount is converted to local currency when the preference is created, as the checkout always processes transactions using local currency. If you use USD please take into consideration that this value is not automatically updated if the value of local currency changes in relation to USD.\n                        x-description-i18n:\n                          eng: Unique ID to identify the currency. ISO_4217 code. Some sites allow local currency and USD, but it is important to note that the amount is converted to local currency when the preference is created, as the checkout always processes transactions using local currency. If you use USD please take into consideration that this value is not automatically updated if the value of local currency changes in relation to USD.\n                          spa: ID único para identificar la moneda. Código ISO_4217. Algunos sitios permiten la moneda local y USD, pero es importante tener en cuenta que el monto se convierte a moneda local cuando se crea la preferencia, ya que el checkout siempre procesa las transacciones en moneda local. Si usas USD, ten en cuenta que este valor no se actualiza automáticamente si el valor de la moneda local cambia en relación a USD.\n                          por: ID exclusivo para identificar a moeda. Código ISO_4217. Alguns sites permitem moeda local e USD, mas é importante observar que o valor é convertido para moeda local quando a preferência é criada, pois o checkout sempre processa as transações em moeda local. Se você estiver usando USD, observe que esse valor não é atualizado automaticamente se o valor da moeda local mudar em relação ao USD.\n                        enum:\n                          - ARS -- Argentine peso.\n                          - BRL -- Brazilian real.\n                          - CLP -- Chilean peso.\n                          - MXN -- Mexican peso.\n                          - COP -- Colombian peso.\n                          - PEN -- Peruvian sol.\n                          - UYU -- Uruguayan peso.\n                      unit_price:\n                        type: number\n                        example: 10\n                        description: Unit price of the item. This property is used together with the property quantity to determine the order cost.\n                        x-description-i18n:\n                          eng: Unit price of the item. This property is used together with the property quantity to determine the order cost.\n                          spa: Precio unitario del ítem. Esta propiedad se usa junto con propiedad quantity para determinar el costo de la orden.\n                          por: Preço unitário do item. Essa propriedade é usada em conjunto com a propriedade de quantity para determinar o custo do pedido.\n                payer:\n                  type: object\n                  description: Buyer´s information, such as name, last name, e-mail, phone, personal identification, address, and registration date.\n                  x-description-i18n:\n                    eng: Buyer´s information, such as name, last name, e-mail, phone, personal identification, address, and registration date.\n                    spa: Información del comprador, como nombre, apellido, correo electrónico, teléfono, identificación personal, dirección y fecha de registro.\n                    por: Informações do comprador, como nome, sobrenome, e-mail, telefone, identificação pessoal, endereço e data de registro.\n                  properties:\n                    name:\n                      type: string\n                      description: Buyer name.\n                      x-description-i18n:\n                        eng: Buyer name.\n                        spa: Nombre del comprador\n                        por: Nome do comprador\n                    surname:\n                      type: string\n                      description: Buyer last name.\n                      x-description-i18n:\n                        eng: Buyer last name.\n                        spa: Apellido del comprador\n                        por: Apelido do comprador\n                    email:\n                      type: string\n                      description: Buyer e-mail address.\n                      x-description-i18n:\n                        eng: Buyer e-mail address.\n                        spa: Dirección de e-mail del comprador\n                        por: Endereço de e-mail do comprador\n                    phone:\n                      type: object\n                      description: Buyer phone.\n                      x-description-i18n:\n                        eng: Buyer phone.\n                        spa: Teléfono del comprador\n                        por: Telefone do comprador\n                      properties:\n                        area_code:\n                          type: string\n                          description: Area code.\n                          x-description-i18n:\n                            eng: Area code.\n                            spa: Código de área\n                            por: Código de área\n                        number:\n                          type: string\n                          description: Number.\n                          x-description-i18n:\n                            eng: Number.\n                            spa: Número\n                            por: Número\n                    identification:\n                      type: object\n                      description: Personal identification.\n                      x-description-i18n:\n                        eng: Personal identification.\n                        spa: Identificación personal\n                        por: Identificação pessoal\n                      properties:\n                        type:\n                          type: string\n                          description: Identification Type.\n                          x-description-i18n:\n                            eng: Identification Type.\n                            spa: Tipo de identificación\n                            por: Tipo de identificação\n                        number:\n                          type: string\n                          description: Number.\n                          x-description-i18n:\n                            eng: Number.\n                            spa: Número\n                            por: Número\n                    address:\n                      type: object\n                      description: Buyer’s address.\n                      x-description-i18n:\n                        eng: Buyer’s address.\n                        spa: Dirección del comprador\n                        por: Endereço do comprador\n                      properties:\n                        zip_code:\n                          type: string\n                          description: Zip code.\n                          x-description-i18n:\n                            eng: Zip code.\n                            spa: Código postal\n                            por: Código postal\n                        street_name:\n                          type: string\n                          description: Street name.\n                          x-description-i18n:\n                            eng: Street name.\n                            spa: Calle\n                            por: Rua\n                        street_number:\n                          type: number\n                          description: Street number.\n                          x-description-i18n:\n                            eng: Street number.\n                            spa: Número\n                            por: O Número\n                    date_created:\n                      type: string\n                      format: date\n                      description: Registration date.\n                      x-description-i18n:\n                        eng: Registration date.\n                        spa: Fecha de registración\n                        por: Data de registro\n                payment_methods:\n                  type: object\n                  description: All configuration related to payments methods, such as excluded payment methods, excluded payment types, default payment method, and installments.\n                  x-description-i18n:\n                    eng: All configuration related to payments methods, such as excluded payment methods, excluded payment types, default payment method, and installments.\n                    spa: Toda la configuración relacionada con los métodos de pago, tales como los métodos de pago excluidos, los tipos de pago excluidos, el método de pago predeterminado y las cuotas.\n                    por: Todas as configurações são relacionadas ao métodos de pagamento, como, por exemplo, métodos de pagamento excluídos, tipos de pagamento excluídos, método de pagamento padrão e taxas.\n                  properties:\n                    excluded_payment_methods:\n                      type: array\n                      description: Payment methods excluded from the payment process (except account_money, which is always allowed). The payment methods included here will not be available at checkout.\n                      x-description-i18n:\n                        eng: Payment methods excluded from the payment process (except account_money, which is always allowed). The payment methods included here will not be available at checkout.\n                        spa: Métodos de pago excluidos del proceso de pago (excepto account_money, que siempre estará disponible). Los métodos de pago incluidos aquí no estarán disponibles en el checkout.\n                        por: Métodos de pagamento excluídos do checkout (exceto account_money, que estará sempre disponível). Os métodos de pagamento aqui incluídos não estarão disponíveis no checkout.\n                      items:\n                        type: object\n                        properties:\n                          id:\n                            type: string\n                            description: Payment method ID.\n                            x-description-i18n:\n                              eng: Payment method ID.\n                              spa: Identificador del método de pago\n                              por: Identificador do método de pagamento\n                    excluded_payment_types:\n                      type: array\n                      description: Payment types excluded from the payment process. The payment types included here will not be available at checkout.\n                      x-description-i18n:\n                        eng: Payment types excluded from the payment process. The payment types included here will not be available at checkout.\n                        spa: Tipos de pago excluidos del proceso de pago. Los tipos de pago incluidos aquí no estarán disponibles en el checkout.\n                        por: Tipos de pagamento excluídos do processo de pagamento. Os tipos de pagamento incluídos aqui não estarão disponíveis no checkout.\n                      items:\n                        type: object\n                        properties:\n                          id:\n                            type: string\n                            description: Payment method data_type ID.\n                            x-description-i18n:\n                              eng: Payment method data_type ID.\n                              spa: Identificador de data_type del medio de pago\n                              por: Identificador de data_type do meio de pagamento\n                    default_payment_method_id:\n                      type: string\n                      description: Suggested payment method. The user will initiate the checkout this this payment method already selected. It is considered suggested because Checkouts follow different logics in order to select the best payment method for a specific transaction, and this property is the option with the least relevance.\n                      x-description-i18n:\n                        eng: Suggested payment method. The user will initiate the checkout this this payment method already selected. It is considered suggested because Checkouts follow different logics in order to select the best payment method for a specific transaction, and this property is the option with the least relevance.\n                        spa: Forma de pago sugerida. El usuario iniciará el pago con este método de pago ya seleccionado. Se considera sugerida porque los Checkouts siguen lógicas diferentes para seleccionar el mejor método de pago para una transacción específica, siendo esta propiedad la opción con menor relevancia.\n                        por: Forma de pagamento sugerida. O usuário iniciará o pagamento com esta forma de pagamento já selecionada. Considera-se sugerido porque os Checkouts seguem lógicas diferentes para selecionar o melhor meio de pagamento para uma determinada transação, sendo esta propriedade a opção menos relevante.\n                    installments:\n                      type: number\n                      description: Maximum number of credit card installments to be accepted.\n                      x-description-i18n:\n                        eng: Maximum number of credit card installments to be accepted.\n                        spa: Máximo número de cuotas\n                        por: Número Máximo de cotas\n                    default_installments:\n                      type: number\n                      description: Prefered number of credit card installments.\n                      x-description-i18n:\n                        eng: Prefered number of credit card installments.\n                        spa: Preferencia de cuotas\n                        por: Preferência de cotas\n                shipments:\n                  type: object\n                  description: Shipments information.\n                  x-description-i18n:\n                    eng: Shipments information.\n                    spa: Información de envío\n                    por: Informações de envio\n                  properties:\n                    mode:\n                      $ref: '#/components/schemas/shipment_mode'\n                    local_pickup:\n                      type: boolean\n                      description: The payer have the option to pick up the shipment in your store (mode:me2 only).\n                    dimensions:\n                      type: string\n                      description: Dimensions of the shipment in cm x cm x cm, gr (mode:me2 only)\n                      x-description-i18n:\n                        eng: Dimensions of the shipment in cm x cm x cm, gr (mode:me2 only)\n                        spa: Tamaño del paquete en cm x cm x cm, gr (mode:me2 solamente)\n                        por: Tamanho do pacote em cm x cm x cm, gr (mode:me2 somente)\n                    default_shipping_method:\n                      type: number\n                      description: Select default shipping method in checkout (mode:me2 only).\n                      x-description-i18n:\n                        eng: Select default shipping method in checkout (mode:me2 only).\n                        spa: Elegir un método de envío predeterminado en el checkout (mode:me2 solamente)\n                        por: Escolha um método de envio padrão no checkout (mode:me2 somente)\n                    free_methods:\n                      type: array\n                      description: Offer a shipping method as free shipping (mode:me2 only).\n                      x-description-i18n:\n                        eng: Offer a shipping method as free shipping (mode:me2 only).\n                        spa: Ofrecer un método de envío gratuito (mode:me2 solamente)\n                        por: Oferecer um método de frete grátis (mode:me2 somente)\n                      items:\n                        type: object\n                        properties:\n                          id:\n                            type: number\n                            description: Shipping method ID.\n                            x-description-i18n:\n                              eng: Shipping method ID.\n                              spa: Identificador de método de envío\n                              por: Identificador do método de envio\n                    cost:\n                      type: number\n                      description: Shipment cost (mode:custom only).\n                      x-description-i18n:\n                        eng: Shipment cost (mode:custom only).\n                        spa: Costo del envío (mode:custom solamente)\n                        por: Custo do transporte (mode:custom somente)\n                    free_shipping:\n                      type: boolean\n                      description: Free shipping for mode:custom.\n                      x-description-i18n:\n                        eng: Free shipping for mode:custom.\n                        spa: Preferencia de envío gratuito para mode:custom\n                        por: Preferência de frete grátis para mode:custom\n                    receiver_address:\n                      type: object\n                      description: Shipping address.\n                      x-description-i18n:\n                        eng: Shipping address.\n                        spa: Dirección de envío\n                        por: Endereço de envio\n                      properties:\n                        zip_code:\n                          type: string\n                          description: Zip code.\n                          x-description-i18n:\n                            eng: Zip code.\n                            spa: Código postal\n                            por: Código postal\n                        street_name:\n                          type: string\n                          description: Street name.\n                          x-description-i18n:\n                            eng: Street name.\n                            spa: Calle\n                            por: Rua\n                        city_name:\n                          type: string\n                          description: City name.\n                          x-description-i18n:\n                            eng: City name.\n                            spa: Ciudad\n                            por: Cidade\n                        state_name:\n                          type: string\n                          description: State name.\n                          x-description-i18n:\n                            eng: State name.\n                            spa: Estado\n                            por: Estado\n                        street_number:\n                          type: number\n                          description: Street number.\n                          x-description-i18n:\n                            eng: Street number.\n                            spa: Número\n                            por: O Número\n                        floor:\n                          type: string\n                          description: Floor.\n                          x-description-i18n:\n                            eng: Floor.\n                            spa: Piso\n                            por: Apartamento\n                        apartment:\n                          type: string\n                          description: Apartment.\n                          x-description-i18n:\n                            eng: Apartment.\n                            spa: Departamento\n                            por: Apartamento\n                back_urls:\n                  type: object\n                  description: URLs to return to the sellers website.\n                  x-description-i18n:\n                    eng: URLs to return to the sellers website.\n                    spa: URLs de retorno al sitio del vendedor\n                    por: Url de retorno ao site do vendedor\n                  properties:\n                    success:\n                      type: string\n                      description: Approved payment URL.\n                      x-description-i18n:\n                        eng: Approved payment URL.\n                        spa: URL de retorno ante pago aprobado\n                        por: URL de retorno ante o pagamento aprovado\n                    pending:\n                      type: string\n                      description: Pending or in process payment URL.\n                      x-description-i18n:\n                        eng: Pending or in process payment URL.\n                        spa: URL de retorno ante pago pendiente o en proceso.\n                        por: URL de retorno diante de pagamento pendente ou em processo.\n                    failure:\n                      type: string\n                      description: Canceled payment URL.\n                      x-description-i18n:\n                        eng: Canceled payment URL.\n                        spa: URL de retorno ante pago cancelado\n                        por: URL de retorno ante o pagamento cancelado\n                notification_url:\n                  type: string\n                  description: URL where you'd like to receive a payment notification.\n                  x-description-i18n:\n                    eng: URL where you'd like to receive a payment notification.\n                    spa: URL a la cual te gustaría recibir notificaciones de pagos\n                    por: URL para a qual você gostaria de receber notificações de pagamentos\n                additional_info:\n                  type: string\n                  description: Additional information.\n                  x-description-i18n:\n                    eng: Additional information.\n                    spa: Información adicional\n                    por: Informações adicionais\n                auto_return:\n                  $ref: '#/components/schemas/auto_return'\n                external_reference:\n                  type: string\n                  description: Reference you can synchronize with your payment system.\n                  x-description-i18n:\n                    eng: Reference you can synchronize with your payment system.\n                    spa: Referencia que puedes sincronizar con tu sistema de pagos\n                    por: Referência que pode sincronizar com seu sistema de pagamentos\n                expires:\n                  type: boolean\n                  description: Boolean value that determines if a preference expires.\n                  x-description-i18n:\n                    eng: Boolean value that determines if a preference expires.\n                    spa: Preferencia que determina si una preferencia expira\n                    por: Preferência que determina se uma preferência expira\n                date_of_expiration:\n                  type: string\n                  format: date\n                  description: Expiration date of cash payment.\n                  x-description-i18n:\n                    eng: Expiration date of cash payment.\n                    spa: Fecha de vencimiento del medio de pago en efectivo\n                    por: Data de expiração de meios de pagamento em dinheiro\n                expiration_date_from:\n                  type: string\n                  format: date\n                  description: Date in YYYY-MM-DD-HH-MM-SS format which indicates the start of the preference`s validity period. This can be used, for instance, for limited sales, where sellers make an offer between certain dates.\n                  x-description-i18n:\n                    eng: Date in YYYY-MM-DD-HH-MM-SS format which indicates the start of the preference`s validity period. This can be used, for instance, for limited sales, where sellers make an offer between certain dates.\n                    spa: Fecha en formato AAAA-MM-DD-HH-MM-SS que indica el inicio del período de validez de la preferencia. Esto se puede usar, por ejemplo, para ventas limitadas, donde los vendedores hacen una oferta entre ciertas fechas.\n                    por: Data no formato AAAA-MM-DD-HH-MM-SS que indica o início do período de validade da preferência. Isso pode ser usado, por exemplo, para vendas limitadas, onde os vendedores fazem uma oferta entre determinadas datas.\n                expiration_date_to:\n                  type: string\n                  format: date\n                  description: Date in YYYY-MM-DD-HH-MM-SS format which indicates the end of the preference`s validity period. This can be used, for instance, for limited sales, where sellers make an offer between certain dates.\n                  x-description-i18n:\n                    eng: Date in YYYY-MM-DD-HH-MM-SS format which indicates the end of the preference`s validity period. This can be used, for instance, for limited sales, where sellers make an offer between certain dates.\n                    spa: Fecha en formato AAAA-MM-DD-HH-MM-SS que indica el final del período de validez de la preferencia. Esto se puede usar, por ejemplo, para ventas limitadas, donde los vendedores hacen una oferta entre ciertas fechas.\n                    por: Data no formato AAAA-MM-DD-HH-MM-SS que indica o início do período de validade da preferência. Isso pode ser usado, por exemplo, para vendas limitadas, onde os vendedores fazem uma oferta entre determinadas datas.\n                marketplace:\n                  type: string\n                  description: Origin of the payment. This is an alphanumeric field whose default value is NONE. If the collector has their own marketplace, this is where the credentials to identify it are sent. As the marketplace is associated to the Application ID, the marketplace credentials must correspond to the credentials used to create the preference. Using the wrong credentials will result in an error.\n                  x-description-i18n:\n                    eng: Origin of the payment. This is an alphanumeric field whose default value is NONE. If the collector has their own marketplace, this is where the credentials to identify it are sent. As the marketplace is associated to the Application ID, the marketplace credentials must correspond to the credentials used to create the preference. Using the wrong credentials will result in an error.\n                    spa: Origen del pago. Este es un campo alfanumérico cuyo valor por defecto es NONE. Si el collector tiene su propio marketplace, aquí es donde se envían las credenciales para identificarlo. Como el marketplace está asociado al Application ID, las credenciales del marketplace deben corresponder a las credenciales utilizadas para crear la preferencia. El uso de credenciales incorrectas dará como resultado un error.\n                    por: Origem do pagamento. Este é um campo alfanumérico cujo valor padrão é NONE. Caso o coletor tenha seu próprio marketplace, é para onde são enviadas as credenciais para identificá-lo. Como o marketplace está associado ao Application ID, as credenciais do marketplace devem corresponder às credenciais usadas para criar a preferência. Usar as credenciais erradas resultará em um erro.\n                marketplace_fee:\n                  type: number\n                  description: Marketplace`s fee charged by application owner. It is a fixed amount and its default value is 0 in local currency. This property can only be sent if a valid marketplace has been defined as well, otherwise the request will fail.\n                  x-description-i18n:\n                    eng: Marketplace`s fee charged by application owner. It is a fixed amount and its default value is 0 in local currency. This property can only be sent if a valid marketplace has been defined as well, otherwise the request will fail.\n                    spa: Tarifa de Marketplace cobrada por el propietario de la aplicación. Es una cantidad fija y su valor por defecto es 0 en moneda local. Esta propiedad solo se puede enviar si también se ha definido un marketplace válido; de lo contrario, la solicitud fallará.\n                    por: Taxa de Marketplace cobrada pelo proprietário da aplicação. É um valor fixo e seu valor padrão é 0 em moeda local. Esta propriedade só pode ser apresentada se também tiver sido definido um marketplace válido e, caso contrário, a solicitação falhará.\n                  example: 0\n                differential_pricing:\n                  type: object\n                  description: Differential pricing configuration for this preference. The seller can have their own configuration regarding payment methods and installments, and it`s in this parameter where they will include the numeric ID to indicate so. This value is used to apply custom payment methods.\n                  x-description-i18n:\n                    eng: Differential pricing configuration for this preference. The seller can have their own configuration regarding payment methods and installments, and it`s in this parameter where they will include the numeric ID to indicate so. This value is used to apply custom payment methods.\n                    spa: Configuración de precio diferencial para esta preferencia. El vendedor puede tener su propia configuración en cuanto a formas de pago y cuotas, y es en este parámetro donde incluirá el ID numérico para indicarlo. Este valor se utiliza para aplicar métodos de pago personalizados.\n                    por: Configuração de preço diferencial para esta preferência. O vendedor pode ter sua própria configuração em relação às formas de pagamento e taxas, e é neste parâmetro que incluirá o ID numérico para indicá-lo. Esse valor é usado para aplicar métodos de pagamento personalizados.\n                  properties:\n                    id:\n                      type: number\n                      description: Differential pricing ID.\n                      x-description-i18n:\n                        eng: Differential pricing ID.\n                        spa: Identificador de precio diferenciado\n                        por: Identificador de preço diferenciado\n                metadata:\n                    type: object\n                    description: Valid JSON that can be added to the payment to save additional attributes.\n                    x-description-i18n:\n                      eng: Valid JSON that can be added to the payment to save additional attributes.\n                      spa: JSON válido que puede agregarse al pago para guardar atributos adicionales\n                      por: JSON válido que pode ser adicionado ao pagamento para salvar atributos adicionais\n      responses:\n        '200':\n          description: success\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  additional_info:\n                    type: string\n                    description: Additional information.\n                    x-description-i18n:\n                      eng: Additional information.\n                      spa: Información adicional\n                      por: Informações adicionais\n                  auto_return:\n                    $ref: '#/components/schemas/auto_return'\n                  back_urls:\n                    type: object\n                    description: URLs to return to the sellers website.\n                    x-description-i18n:\n                      eng: URLs to return to the sellers website.\n                      spa: URLs de retorno al sitio del vendedor\n                      por: Url de retorno ao site do vendedor\n                    properties:\n                      failure:\n                        type: string\n                        description: Canceled payment URL.\n                        x-description-i18n:\n                          eng: Canceled payment URL.\n                          spa: URL de retorno ante pago cancelado\n                          por: URL de retorno ante o pagamento cancelado\n                      pending:\n                        type: string\n                        description: Pending or in process payment URL.\n                        x-description-i18n:\n                          eng: Pending or in process payment URL.\n                          spa: URL de retorno ante pago pendiente o en proceso.\n                          por: URL de retorno diante de pagamento pendente ou em processo.\n                      success:\n                        type: string\n                        description: Approved payment URL.\n                        x-description-i18n:\n                          eng: Approved payment URL.\n                          spa: URL de retorno ante pago aprobado\n                          por: URL de retorno ante o pagamento aprovado\n                  binary_mode:\n                    type: boolean\n                    example: false\n                    description: When the payment is activated, it can only be approved or rejected. Otherwise, the payment may be pending.\n                    x-description-i18n:\n                      eng: When the payment is activated, it can only be approved or rejected. Otherwise, the payment may be pending.\n                      spa: Cuando está activado, el pago sólo puede resultar aprobado o rechazado. De lo contrario, el pago puede resultar pendiente\n                      por: Quando o pagamento está ativado, só pode ser aprovado ou rejeitado. Caso contrário, o pagamento pode ficar pendente\n                  client_id:\n                    type: string\n                    example: 6295877106812064\n                    description: Unique ID used to identify the client. It is obtained from the credentials used to create the preference. It´s the application ID.\n                    x-description-i18n:\n                      eng: Unique ID used to identify the client. It is obtained from the credentials used to create the preference. It´s the application ID.\n                      spa: ID único utilizada para identificar al cliente. Se obtiene a partir de las credenciales utilizadas para crear la preferencia. Es el Application ID.\n                      por: ID exclusivo usado para identificar o cliente. Obtido das credenciais usadas para criar a preferência. É o Application ID.\n                  collector_id:\n                    type: number\n                    example: 202809963\n                    description: Unique ID used to identify the collector. It is the same as the Cust ID.\n                    x-description-i18n:\n                      eng: Unique ID used to identify the collector. It is the same as the Cust ID.\n                      spa: ID único utilizada para identificar al collector. Es el mismo que el Cust ID.\n                      por: ID exclusivo usado para identificar o coletor. É o mesmo que o Cust ID.\n                  coupon_code:\n                    type: object\n                    description: Discount campaign with a specific code.\n                    x-description-i18n:\n                      eng: Discount campaign with a specific code.\n                      spa: Campaña de descuento con un código específico\n                      por: Campanha de desconto com um código específico\n                  coupon_labels:\n                    type: object\n                  date_created:\n                    type: string\n                    example: '2018-02-02T19:22:23.535Z'\n                    description: Registration date.\n                    x-description-i18n:\n                      eng: Registration date.\n                      spa: Fecha de registración\n                      por: Data de registro\n                  date_of_expiration:\n                    type: object\n                    description: Expiration date\n                    x-description-i18n:\n                      eng: Expiration date\n                      spa: Fecha de vencimiento\n                      por: Data de validade\n                  expiration_date_from:\n                    type: string\n                    format: nullable\n                    description: Date in YYYY-MM-DD-HH-MM-SS format which indicates the start of the preference`s validity period. This can be used, for instance, for limited sales, where sellers make an offer between certain dates.\n                    x-description-i18n:\n                      eng: Date in YYYY-MM-DD-HH-MM-SS format which indicates the start of the preference`s validity period. This can be used, for instance, for limited sales, where sellers make an offer between certain dates.\n                      spa: Fecha en formato AAAA-MM-DD-HH-MM-SS que indica el inicio del período de validez de la preferencia. Esto se puede usar, por ejemplo, para ventas limitadas, donde los vendedores hacen una oferta entre ciertas fechas.\n                      por: Data no formato AAAA-MM-DD-HH-MM-SS que indica o início do período de validade da preferência. Isso pode ser usado, por exemplo, para vendas limitadas, onde os vendedores fazem uma oferta entre determinadas datas.\n                  expiration_date_to:\n                    type: string\n                    format: nullable\n                    description: Date in YYYY-MM-DD-HH-MM-SS format which indicates the end of the preference`s validity period. This can be used, for instance, for limited sales, where sellers make an offer between certain dates.\n                    x-description-i18n:\n                      eng: Date in YYYY-MM-DD-HH-MM-SS format which indicates the end of the preference`s validity period. This can be used, for instance, for limited sales, where sellers make an offer between certain dates.\n                      spa: Fecha en formato AAAA-MM-DD-HH-MM-SS que indica el final del período de validez de la preferencia. Esto se puede usar, por ejemplo, para ventas limitadas, donde los vendedores hacen una oferta entre ciertas fechas.\n                      por: Data no formato AAAA-MM-DD-HH-MM-SS que indica o início do período de validade da preferência. Isso pode ser usado, por exemplo, para vendas limitadas, onde os vendedores fazem uma oferta entre determinadas datas.\n                  expires:\n                    type: boolean\n                    example: false\n                    description: Boolean value that determines if a preference expires.\n                    x-description-i18n:\n                      eng: Boolean value that determines if a preference expires.\n                      spa: Preferencia que determina si una preferencia expira\n                      por: Preferência que determina se uma preferência expira\n                  external_reference:\n                    type: string\n                    description: Reference you can synchronize with your payment system.\n                    x-description-i18n:\n                      eng: Reference you can synchronize with your payment system.\n                      spa: Referencia que puedes sincronizar con tu sistema de pagos\n                      por: Referência que pode sincronizar com seu sistema de pagamentos\n                  id:\n                    type: string\n                    example: 202809963-920c288b-4ebb-40be-966f-700250fa5370\n                    description: Autogenerated unique ID that identifies the preference. For example 036151801-2484cd71-7140-4c51-985a-d4cfcf133baf\n                    x-description-i18n:\n                      eng: Autogenerated unique ID that identifies the preference. For example 036151801-2484cd71-7140-4c51-985a-d4cfcf133baf\n                      spa: ID único generado automáticamente que identifica la preferencia. Por ejemplo 036151801-2484cd71-7140-4c51-985a-d4cfcf133baf\n                      por: ID exclusivo gerado automaticamente que identifica a preferência. Por exemplo 036151801-2484cd71-7140-4c51-985a-d4cfcf133baf\n                  init_point:\n                    type: string\n                    example: \n                      https://www.mercadopago.com/mla/checkout/start?pref_id=202809963-920c288b-4ebb-40be-966f-700250fa5370\n                    description: Automatically generated URL to open the Checkout.\n                    x-description-i18n:\n                      eng: Automatically generated URL to open the Checkout.\n                      spa: URL generada automáticamente para abrir el Checkout.\n                      por: URL gerado automaticamente para abrir o Checkout.\n                  internal_metadata:\n                    type: object\n                  items:\n                    type: array\n                    items:\n                      type: object\n                      properties:\n                        id:\n                          type: string\n                          description: Item ID.\n                          x-description-i18n:\n                            eng: Item ID.\n                            spa: Indentificador del ítem\n                            por: Indentificador do item\n                        picture_url:\n                          type: string\n                          description: Item image URL.\n                          x-description-i18n:\n                            eng: Item image URL.\n                            spa: URL de imagen del ítem\n                            por: URL da imagem do anúncio\n                        title:\n                          type: string\n                          example: Dummy Item\n                          description: This is the item`s title, which will display during the payment process, at checkout, activities, and emails.\n                          x-description-i18n:\n                            eng: This is the item`s title, which will display during the payment process, at checkout, activities, and emails.\n                            spa: Este es el título del ítem, que se mostrará durante el proceso de pago, en el checkout, actividades y correos electrónicos.\n                            por: Este é o título do item, que será exibido durante o processo de pagamento, no checkout, nas atividades e nos e-mails.\n                        description:\n                          type: string\n                          example: Multicolor Item\n                          description: Item description. This is a free text field.\n                          x-description-i18n:\n                            eng: Item description. This is a free text field.\n                            spa: Esto es un string libre donde se puede agregar la categoría del ítem.\n                            por: Esta é uma string livre onde a categoria do item pode ser adicionada.\n                        category_id:\n                          type: string\n                          description: This is a free string where the item category can be added.\n                          x-description-i18n:\n                            eng: This is a free string where the item category can be added.\n                            spa: Esto es un string libre donde se puede agregar la categoría del ítem.\n                            por: Esta é uma string livre onde a categoria do item pode ser adicionada.\n                        currency_id:\n                          type: string\n                          example: $\n                          description: Unique ID to identify the currency. ISO_4217 code. Some sites allow local currency and USD, but it is important to note that the amount is converted to local currency when the preference is created, as the checkout always processes transactions using local currency. If you use USD please take into consideration that this value is not automatically updated if the value of local currency changes in relation to USD.\n                          x-description-i18n:\n                            eng: Unique ID to identify the currency. ISO_4217 code. Some sites allow local currency and USD, but it is important to note that the amount is converted to local currency when the preference is created, as the checkout always processes transactions using local currency. If you use USD please take into consideration that this value is not automatically updated if the value of local currency changes in relation to USD.\n                            spa: ID único para identificar la moneda. Código ISO_4217. Algunos sitios permiten la moneda local y USD, pero es importante tener en cuenta que el monto se convierte a moneda local cuando se crea la preferencia, ya que el checkout siempre procesa las transacciones en moneda local. Si usas USD, ten en cuenta que este valor no se actualiza automáticamente si el valor de la moneda local cambia en relación a USD.\n                            por: ID exclusivo para identificar a moeda. Código ISO_4217. Alguns sites permitem moeda local e USD, mas é importante observar que o valor é convertido para moeda local quando a preferência é criada, pois o checkout sempre processa as transações em moeda local. Se você estiver usando USD, observe que esse valor não é atualizado automaticamente se o valor da moeda local mudar em relação ao USD.\n                          enum:\n                            - ARS -- Argentine peso.\n                            - BRL -- Brazilian real.\n                            - CLP -- Chilean peso.\n                            - MXN -- Mexican peso.\n                            - COP -- Colombian peso.\n                            - PEN -- Peruvian sol.\n                            - UYU -- Uruguayan peso.\n                        quantity:\n                          type: number\n                          example: 1\n                          description: Item quantity. This property is used to calculate the total cost.\n                          x-description-i18n:\n                            eng: Item quantity. This property is used to calculate the total cost.\n                            spa: Cantidad de ítems. Esta propiedad se utiliza para calcular el costo total.\n                            por: Quantidade de itens. Esta propriedade é usada para calcular o custo total.\n                        unit_price:\n                          type: number\n                          example: 10\n                          description: Unit price of the item. This property is used together with the property quantity to determine the order cost.\n                          x-description-i18n:\n                            eng: Unit price of the item. This property is used together with the property quantity to determine the order cost.\n                            spa: Precio unitario del ítem. Esta propiedad se usa junto con propiedad quantity para determinar el costo de la orden.\n                            por: Preço unitário do item. Essa propriedade é usada em conjunto com a propriedade de quantity para determinar o custo do pedido.\n                    description: Items information.\n                    x-description-i18n:\n                      eng: Items information.\n                      spa: Información sobre el ítem\n                      por: Informações sobre o item\n                  marketplace:\n                    type: string\n                    example: MP-MKT-6295877106812064\n                    description: Origin of the payment. This is an alphanumeric field whose default value is NONE. If the collector has their own marketplace, this is where the credentials to identify it are sent. As the marketplace is associated to the Application ID, the marketplace credentials must correspond to the credentials used to create the preference. Using the wrong credentials will result in an error.\n                    x-description-i18n:\n                      eng: Origin of the payment. This is an alphanumeric field whose default value is NONE. If the collector has their own marketplace, this is where the credentials to identify it are sent. As the marketplace is associated to the Application ID, the marketplace credentials must correspond to the credentials used to create the preference. Using the wrong credentials will result in an error.\n                      spa: Origen del pago. Este es un campo alfanumérico cuyo valor por defecto es NONE. Si el collector tiene su propio marketplace, aquí es donde se envían las credenciales para identificarlo. Como el marketplace está asociado al Application ID, las credenciales del marketplace deben corresponder a las credenciales utilizadas para crear la preferencia. El uso de credenciales incorrectas dará como resultado un error.\n                      por: Origem do pagamento. Este é um campo alfanumérico cujo valor padrão é NONE. Caso o coletor tenha seu próprio marketplace, é para onde são enviadas as credenciais para identificá-lo. Como o marketplace está associado ao Application ID, as credenciais do marketplace devem corresponder às credenciais usadas para criar a preferência. Usar as credenciais erradas resultará em um erro.\n                  marketplace_fee:\n                    type: number\n                    example: 0\n                    description: Marketplace`s fee charged by application owner. It is a fixed amount and its default value is 0 in local currency. This property can only be sent if a valid marketplace has been defined as well, otherwise the request will fail.\n                    x-description-i18n:\n                      eng: Marketplace`s fee charged by application owner. It is a fixed amount and its default value is 0 in local currency. This property can only be sent if a valid marketplace has been defined as well, otherwise the request will fail.\n                      spa: Tarifa de Marketplace cobrada por el propietario de la aplicación. Es una cantidad fija y su valor por defecto es 0 en moneda local. Esta propiedad solo se puede enviar si también se ha definido un marketplace válido; de lo contrario, la solicitud fallará.\n                      por: Taxa de Marketplace cobrada pelo proprietário da aplicação. É um valor fixo e seu valor padrão é 0 em moeda local. Esta propriedade só pode ser apresentada se também tiver sido definido um marketplace válido e, caso contrário, a solicitação falhará.\n                  metadata:\n                    type: object\n                    description: Valid JSON that can be added to the payment to save additional attributes.\n                    x-description-i18n:\n                      eng: Valid JSON that can be added to the payment to save additional attributes.\n                      spa: JSON válido que puede agregarse al pago para guardar atributos adicionales\n                      por: JSON válido que pode ser adicionado ao pagamento para salvar atributos adicionais\n                  notification_url:\n                    type: string\n                    example: https://url.com.br/notificacao\n                    format: nullable\n                    description: URL where you'd like to receive a payment notification.\n                    x-description-i18n:\n                      eng: URL where you'd like to receive a payment notification.\n                      spa: URL a la cual te gustaría recibir notificaciones de pagos\n                      por: URL para a qual você gostaria de receber notificações de pagamentos\n                  operation_type:\n                    $ref: '#/components/schemas/operation_type'\n                  payer:\n                    type: object\n                    description: Buyer information, such as name, last name, e-mail, phone, personal identification, address, and registration date.\n                    x-description-i18n:\n                      eng: Buyer information, such as name, last name, e-mail, phone, personal identification, address, and registration date.\n                      spa: Información del comprador, como nombre, apellido, correo electrónico, teléfono, identificación personal, dirección y fecha de registro.\n                      por: Informações do comprador, como nome, sobrenome, e-mail, telefone, identificação pessoal, endereço e data de registro.\n                    properties:\n                      phone:\n                        type: object\n                        description: Buyer phone.\n                        x-description-i18n:\n                          eng: Buyer phone.\n                          spa: Teléfono del comprador\n                          por: Telefone do comprador\n                        properties:\n                          area_code:\n                            type: string\n                            description: Area code.\n                            x-description-i18n:\n                              eng: Area code.\n                              spa: Código de área\n                              por: Código de área\n                          number:\n                            type: string\n                            description: Number.\n                            x-description-i18n:\n                              eng: Number.\n                              spa: Número\n                              por: Número\n                      address:\n                        type: object\n                        description: Buyer’s address.\n                        x-description-i18n:\n                          eng: Buyer’s address.\n                          spa: Dirección del comprador\n                          por: Endereço do comprador\n                        properties:\n                          zip_code:\n                            type: string\n                            description: Zip code.\n                            x-description-i18n:\n                              eng: Zip code.\n                              spa: Código postal\n                              por: Código postal\n                          street_name:\n                            type: string\n                            example: Mc Street\n                            description: Street name.\n                            x-description-i18n:\n                              eng: Street name.\n                              spa: Calle\n                              por: Rua\n                          street_number:\n                            type: string\n                            example: '7304'\n                            format: nullable\n                            description: Street number.\n                            x-description-i18n:\n                              eng: Street number.\n                              spa: Número\n                              por: O Número\n                      email:\n                        type: string\n                        description: Buyer e-mail address.\n                        x-description-i18n:\n                          eng: Buyer e-mail address.\n                          spa: Dirección de e-mail del comprador\n                          por: Endereço de e-mail do comprador\n                      identification:\n                        type: object\n                        description: Personal identification.\n                        x-description-i18n:\n                          eng: Personal identification.\n                          spa: Identificación personal\n                          por: Identificação pessoal\n                        properties:\n                          number:\n                            type: string\n                            description: Number.\n                            x-description-i18n:\n                              eng: Number.\n                              spa: Número\n                              por: Número\n                          type:\n                            type: string\n                            description: Identification Type.\n                            x-description-i18n:\n                              eng: Identification Type.\n                              spa: Tipo de identificación\n                              por: Tipo de identificação\n                      name:\n                        type: string\n                        description: Buyer name.\n                        x-description-i18n:\n                          eng: Buyer name.\n                          spa: Nombre del comprador\n                          por: Nome do comprador\n                      surname:\n                        type: string\n                        description: Buyer last name.\n                        x-description-i18n:\n                          eng: Buyer last name.\n                          spa: Apellido del comprador\n                          por: Apelido do comprador\n                      date_created:\n                        type: string\n                        description: Registration date.\n                        x-description-i18n:\n                          eng: Registration date.\n                          spa: Fecha de registración\n                          por: Data de registro\n                      last_purchase:\n                        type: object\n                        description: Date of last purchase\n                        x-description-i18n:\n                          eng: Date of last purchase\n                          spa: Fecha de última compra.\n                          por: Data da última compra.\n                  payment_methods:\n                    type: object\n                    description: All configuration related to payments methods, such as excluded payment methods, excluded payment types, default payment method, and installments.\n                    x-description-i18n:\n                      eng: All configuration related to payments methods, such as excluded payment methods, excluded payment types, default payment method, and installments.\n                      spa: Toda la configuración relacionada con los métodos de pago, tales como los métodos de pago excluidos, los tipos de pago excluidos, el método de pago predeterminado y las cuotas.\n                      por: Todas as configurações são relacionadas ao métodos de pagamento, como, por exemplo, métodos de pagamento excluídos, tipos de pagamento excluídos, método de pagamento padrão e taxas.\n                    properties:\n                      default_card_id:\n                        type: object\n                        description: Default card ID.\n                        x-description-i18n:\n                          eng: Default card ID.\n                          spa: ID de tarjeta predeterminada.\n                          por: ID do cartão padrão.\n                      default_payment_method_id:\n                        type: string\n                        format: nullable\n                        description: Suggested payment method. The user will initiate the checkout this this payment method already selected. It is considered suggested because Checkouts follow different logics in order to select the best payment method for a specific transaction, and this property is the option with the least relevance.\n                        x-description-i18n:\n                          eng: Suggested payment method. The user will initiate the checkout this this payment method already selected. It is considered suggested because Checkouts follow different logics in order to select the best payment method for a specific transaction, and this property is the option with the least relevance.\n                          spa: Forma de pago sugerida. El usuario iniciará el pago con este método de pago ya seleccionado. Se considera sugerida porque los Checkouts siguen lógicas diferentes para seleccionar el mejor método de pago para una transacción específica, siendo esta propiedad la opción con menor relevancia.\n                          por: Forma de pagamento sugerida. O usuário iniciará o pagamento com esta forma de pagamento já selecionada. Considera-se sugerido porque os Checkouts seguem lógicas diferentes para selecionar o melhor meio de pagamento para uma determinada transação, sendo esta propriedade a opção menos relevante.\n                      excluded_payment_methods:\n                        type: array\n                        description: Payment methods excluded from the payment process (except account_money, which is always allowed). The payment methods included here will not be available at checkout.\n                        x-description-i18n:\n                          eng: Payment methods excluded from the payment process (except account_money, which is always allowed). The payment methods included here will not be available at checkout.\n                          spa: Métodos de pago excluidos del proceso de pago (excepto account_money, que siempre estará disponible). Los métodos de pago incluidos aquí no estarán disponibles en el checkout.\n                          por: Métodos de pagamento excluídos do checkout (exceto account_money, que estará sempre disponível). Os métodos de pagamento aqui incluídos não estarão disponíveis no checkout.\n                        items:\n                          type: object\n                          properties:\n                            id:\n                              type: string\n                              example: ''\n                              description: Payment method ID.\n                              x-description-i18n:\n                                eng: Payment method ID.\n                                spa: Identificador del método de pago\n                                por: Identificador do método de pagamento\n                      excluded_payment_types:\n                        type: array\n                        description: Payment types excluded from the payment process. The payment types included here will not be available at checkout.\n                        x-description-i18n:\n                          eng: Payment types excluded from the payment process. The payment types included here will not be available at checkout.\n                          spa: Tipos de pago excluidos del proceso de pago. Los tipos de pago incluidos aquí no estarán disponibles en el checkout.\n                          por: Tipos de pagamento excluídos do processo de pagamento. Os tipos de pagamento incluídos aqui não estarão disponíveis no checkout.\n                        items:\n                          type: object\n                          properties:\n                            id:\n                              type: string\n                              example: ''\n                              description: Payment method data_type ID.\n                              x-description-i18n:\n                                eng: Payment method data_type ID.\n                                spa: Identificador de data_type del medio de pago\n                                por: Identificador de data_type do meio de pagamento\n                      installments:\n                        type: string\n                        format: nullable\n                        description: Maximum number of credit card installments to be accepted.\n                        x-description-i18n:\n                          eng: Maximum number of credit card installments to be accepted.\n                          spa: Máximo número de cuotas\n                          por: Número Máximo de cotas\n                      default_installments:\n                        type: string\n                        format: nullable\n                        description: Prefered number of credit card installments.\n                        x-description-i18n:\n                          eng: Prefered number of credit card installments.\n                          spa: Preferencia de cuotas\n                          por: Preferência de cotas\n                  processing_modes:\n                    type: object\n                    description: Processing mode\n                    x-description-i18n:\n                      eng: Processing mode\n                      spa: Modo de procesamiento\n                      por: Modo de processamento\n                  product_id:\n                    type: object\n                    description: Unique ID used to identify the product.\n                    x-description-i18n:\n                      eng: Unique ID used to identify the product.\n                      spa: ID único utilizado para identificar el producto.\n                      por: ID exclusivo usado para identificar o produto.\n                  redirect_urls:\n                    type: object\n                    properties:\n                      failure:\n                        type: string\n                        example: ''\n                      pending:\n                        type: string\n                        example: ''\n                      success:\n                        type: string\n                        example: ''\n                  sandbox_init_point:\n                    type: string\n                    example: \n                      https://sandbox.mercadopago.com/mla/checkout/pay?pref_id=202809963-920c288b-4ebb-40be-966f-700250fa5370\n                    description: Automatically generated URL to open the Checkout in sandbox mode. Real users are used here, but transactions are executed using test credentials.\n                    x-description-i18n:\n                      eng: Automatically generated URL to open the Checkout in sandbox mode. Real users are used here, but transactions are executed using test credentials.\n                      spa: URL generada automáticamente para abrir el Checkout en modo sandbox. Aquí se utilizan usuarios reales, pero las transacciones se ejecutan con credenciales de prueba.\n                      por: URL gerado automaticamente para abrir o Checkout no modo sandbox. Usuários reais são usados ​​aqui, mas as transações são executadas com credenciais de teste.\n                  site_id:\n                    type: string\n                    example: MLB\n                    description: Unique ID used to identify the site.\n                    x-description-i18n:\n                      eng: Unique ID used to identify the site.\n                      spa: ID único utilizado para identificar el site.\n                      por: ID exclusivo usado para identificar o site.\n                    enum:\n                      - MLA -- Mercado Libre Argentina\n                      - MLB -- Mercado Libre Brasil\n                      - MLC -- Mercado Libre Chile\n                      - MLM -- Mercado Libre México\n                      - MLU -- Mercado Libre Uruguay\n                      - MCO -- Mercado Libre Colombia\n                      - MPE -- Mercado Libre Perú\n                  shipments:\n                    type: object\n                    description: Shipments information.\n                    x-description-i18n:\n                      eng: Shipments information.\n                      spa: Información de envío\n                      por: Informações de envio\n                    properties:\n                      default_shipping_method:\n                        type: object\n                        description: Select default shipping method in checkout (mode:me2 only).\n                        x-description-i18n:\n                          eng: Select default shipping method in checkout (mode:me2 only).\n                          spa: Elegir un método de envío predeterminado en el checkout (mode:me2 solamente)\n                          por: Escolha um método de envio padrão no checkout (mode:me2 somente)\n                      receiver_address:\n                        type: object\n                        description: Shipping address.\n                        x-description-i18n:\n                          eng: Shipping address.\n                          spa: Dirección de envío\n                          por: Endereço de envio\n                        properties:\n                          zip_code:\n                            type: string\n                            description: Zip code.\n                            x-description-i18n:\n                              eng: Zip code.\n                              spa: Código postal\n                              por: Código postal\n                          street_name:\n                            type: string\n                            description: Street name.\n                            x-description-i18n:\n                              eng: Street name.\n                              spa: Calle\n                              por: Rua\n                          street_number:\n                            type: string\n                            format: nullable\n                            description: Street number.\n                            x-description-i18n:\n                              eng: Street number.\n                              spa: Número\n                              por: O Número\n                          floor:\n                            type: string\n                            description: Floor.\n                            x-description-i18n:\n                              eng: Floor.\n                              spa: Piso\n                              por: Apartamento\n                          apartment:\n                            type: string\n                            description: Apartment.\n                            x-description-i18n:\n                              eng: Apartment.\n                              spa: Departamento\n                              por: Apartamento\n                          city_name:\n                            type: object\n                            description: City name.\n                            x-description-i18n:\n                              eng: City name.\n                              spa: Ciudad\n                              por: Cidade\n                          state_name:\n                            type: object\n                            description: State name.\n                            x-description-i18n:\n                              eng: State name.\n                              spa: Estado\n                              por: Estado\n                          country_name:\n                            type: Country name.\n                            x-type-i18n:\n                              eng: Country name.\n                              spa: Nombre del país\n                              por: Nome do país\n                            description: Country name.\n                            x-description-i18n:\n                              eng: Country name.\n                              spa: Nombre del país\n                              por: Nome do país\n                  total_amount:\n                    type: object\n                    description: Total amount of the order.\n                    x-description-i18n:\n                      eng: Total amount of the order.\n                      spa: Costo total de la orden\n                      por: Valor total do pedido.\n                  last_updated:\n                    type: object\n                    description: Last updated date\n                    x-description-i18n:\n                      eng: Last updated date\n                      spa: Última fecha de actualización\n                      por: Data da última atualização\n                  statement_descriptor:\n                    type: string\n                    example: MERCADOPAGO\n                    description: The statement descriptor is a long text (up to 16 characters) that will be visualized in the payer´s credit card statement to easily identify the purchase.\n                    x-description-i18n:\n                      eng: The statement descriptor is a long text (up to 16 characters) that will be visualized in the payer´s credit card statement to easily identify the purchase.\n                      spa: El statement descriptor es un texto largo (hasta 16 caracteres) que se visualizará en la factura de la tarjeta de crédito del pagador para identificar fácilmente la compra.\n                      por: O statement descriptor é um texto longo (até 16 caracteres) que será exibido na fatura do cartão de crédito do pagador para identificar facilmente a compra.\n        '400':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - invalid_collector_id--collector_id invalid.\n                      - invalid_sponsor_id--sponsor_id is not an active user.\n                      - invalid_collector_email--collector is not collector_email owner\n                      - invalid_operation_type--operation_type invalid.\n                      - invalid_expiration_date_to--expiration_date_to invalid.\n                      - invalid_date--invalid date of expiration.\n                      - invalid_expiration_date_from--expiration_date_from invalid.\n                      - invalid_items--unit_price invalid.\n                      - invalid_back_urls--back_urls invalid. Wrong format\n                      - invalid_payment_methods--installments invalid. Should be a number between 1 and 36.\n                      - invalid_marketplace_fee--marketplace_fee must not be greater than total amount.\n                      - invalid_id--preference_id not found.\n                      - invalid_access_token--access denied\n                      - invalid_shipments--invalid type (<type>) for field shipments.cost.\n\ncomponents:\n  schemas:\n    shipment_mode:\n      type: string\n      description: Shipment mode.\n      x-description-i18n:\n        eng: Shipment mode.\n        spa: Modo de envío\n        por: Modo de envio\n      enum:\n        - custom -- Custom shipping.\n        - me2 -- Mercado Envíos.\n        - not_specified -- Shipping mode not specified.\n    operation_type:\n      type: String\n      description: Operation data_type.\n      x-description-i18n:\n        eng: Operation data_type.\n        spa: data_type de la operación\n        por: data_type da operação\n      enum:\n        - regular_payment -- Normal payment.\n        - money_transfer -- Money request.\n    auto_return:\n      type: String\n      description: If specified, your buyers will be redirected back to your site immediately after completing the purchase.\n      x-description-i18n:\n        eng: If specified, your buyers will be redirected back to your site immediately after completing the purchase.\n        spa: En el caso de estar especificado tu comprador sera redirigido a tu sitio inmediatamente después de la compra\n        por: No caso de estar especificado o comprador será redirecionado para o seu site imediatamente após a compra\n      enum:\n        - approved -- The redirection takes place only for approved payments.\n        - all -- The redirection takes place only for approved payments, forward compatibility only if we change the default behavior",
			"canonicalURL": "/github.com/mercadopago/devsite-docs@20069589158195c9fbaaeb1dcc49d3aee817599f/-/blob/reference/api/preferences.yaml",
			"externalURLs": [
				{
					"url": "https://github.com/mercadopago/devsite-docs/blob/20069589158195c9fbaaeb1dcc49d3aee817599f/reference/api/preferences.yaml",
					"serviceKind": "GITHUB"
				}
			]
		}
	},
	"Error": "unmarshal: json: line 1:55257: json: cannot unmarshal Go value of type ogen.Spec: spec: json: unable to unmarshal JSON object into Go value of type string"
}