{
	"File": {
		"__typename": "FileMatch",
		"repository": {
			"name": "github.com/mercadopago/devsite-docs"
		},
		"file": {
			"name": "payment_methods.yaml",
			"size": 0,
			"path": "reference/api/payment_methods.yaml",
			"byteSize": 18893,
			"content": "openapi: 3.0.0\nservers:\n  - url: https://api.mercadopago.com\ninfo:\n  title: Mercado Pago API Reference\n  version: '1.0'\npaths:\n  /v1/payment_methods:\n    get:\n      tags:\n        - $ref: '#/tags/checkout-pro'\n        - $ref: '#/tags/subscriptions'\n        - $ref: '#/tags/checkout-api'\n      summary: Get payment methods\n      x-summary-i18n:\n        eng: Get payment methods\n        spa: Obtener medios de pago\n        por: Obter meios de pagamento\n      description: Consult all the available payment methods and obtain a list with the details of each one and its properties\n      x-description-i18n:\n        eng: Consult all the available payment methods and obtain a list with the details of each one and its properties\n        spa: Consulta todos los medios de pago disponibles y obtén un listado con el detalle de cada uno y sus propiedades\n        por: Consulte todas as formas de pagamento disponíveis e obtenha uma lista com os detalhes de cada uma delas e suas propriedades\n      responses:\n        '200':\n          description: Success\n          content:\n            application/json:\n              schema:\n                type: array\n                items:\n                  properties:\n                    id:\n                      type: string\n                      example: visa\n                      description: Payment method identifier.\n                      x-description-i18n:\n                        eng: Payment method identifier.\n                        spa: Identificador del medio de pago\n                        por: Id do meio de pagamento\n                    name:\n                      type: string\n                      example: Visa\n                      description: Descriptive name of the payment method, for example Visa, American Express, etc.\n                      x-description-i18n:\n                        eng: Descriptive name of the payment method, for example Visa, American Express, etc.\n                        spa: Nombre descriptivo del método de pago, por ejemplo Visa, American Express, etc.\n                        por: Nome descritivo da forma de pagamento como, por exemplo, Visa, American Express, etc.\n                    payment_type_id:\n                      type: string\n                      example: credit_card\n                      description: Types of payment methods.\n                      x-description-i18n:\n                        eng: Types of payment methods.\n                        spa: Tipo de medio de pago\n                        por: Tipo de meio de pagamento\n                      enum:\n                        - ticket -- Printed ticket\n                        - atm -- Payment by ATM\n                        - credit_card -- Payment by credit card\n                        - debit_card -- Payment by debit card\n                        - prepaid_card -- Payment by prepaid card\n                    status:\n                      type: string\n                      example: active\n                      description: Payment methods status.\n                      x-description-i18n:\n                        eng: Payment methods status.\n                        spa: Estado del medio de pago\n                        por: Estado do meio de pagamento\n                      enum:\n                        - active -- Available for use.\n                        - deactive -- Decommissioned, we don't support it anymore.\n                        - temporally_deactive -- Unavailable for use, possible interruption of the service.\n                    secure_thumbnail:\n                      type: string\n                      example: https://www.mercadopago.com/org-img/MP3/API/logos/visa.gif\n                      description: Logo to display on secure sites. Link to the thumbnail image that identifies the issuer and the payment method hosted on a server with a secure transfer protocol.\n                      x-description-i18n:\n                        eng: Logo to display on secure sites. Link to the thumbnail image that identifies the issuer and the payment method hosted on a server with a secure transfer protocol.\n                        spa: Logo para mostrar en sitios seguros. Enlace a la imagen en miniatura que identifica al issuer (emisor) y al medio de pago alojado en un servidor con protocolo de transferencia seguro.\n                        por: Logo para exibir em sites seguros. Link para a imagem em miniatura que identifica o issuer (emissor) e o meio de pagamento hospedado em um servidor com protocolo de transferência seguro.\n                    thumbnail:\n                      type: string\n                      example: http://img.mlstatic.com/org-img/MP3/API/logos/visa.gif\n                      description: Logo to show. Link to the thumbnail image that identifies the issuer and the payment method.\n                      x-description-i18n:\n                        eng: Logo to show. Link to the thumbnail image that identifies the issuer and the payment method.\n                        spa: Logo para mostrar. Enlace a la imagen en miniatura que identifica al issuer (emisor) y al medio de pago.\n                        por: Logo para exibir. Link para a imagem em miniatura que identifica o issuer (emissor) e o meio de pagamento.\n                    deferred_capture:\n                      type: string\n                      example: supported\n                      description: Indicates whether the capture can be delayed or not. It has three possible values.\n                      x-description-i18n:\n                        eng: Indicates whether the capture can be delayed or not. It has three possible values.\n                        spa: Indica si la captura puede ser diferida o no. Tiene tres valores posibles.\n                        por: Indica se a captura pode ser lenta ou não. Tem três valores possíveis.\n                      enum:\n                        - supported -- This payment method supports authorization and capture operations.\n                        - unsupported -- Deferred capture is not available for this payment method.\n                        - does_not_apply -- Cash payment methods don't allow deferred capture.\n                    settings:\n                      type: object\n                      properties:\n                        bin:\n                          type: object\n                          description: Regular expression through which it will be verified if a bin corresponds to the means of payment.\n                          x-description-i18n:\n                            eng: Regular expression through which it will be verified if a bin corresponds to the means of payment.\n                            spa: Expresión regular por la cual se verificará si un bin corresponde al medio de pago.\n                            por: Expressão regular pela qual será verificado se um bin corresponde ao meio de pagamento.\n                          properties:\n                            pattern:\n                              type: string\n                              example: ^(4)\n                              description: Regular expression representing the accepted bins.\n                              x-description-i18n:\n                                eng: Regular expression representing the accepted bins.\n                                spa: Expresión regular representando los bines aceptados\n                                por: A expressão regular, representando bines aceitos\n                            exclusion_pattern:\n                              type: string\n                              description: Regular expression representing the excluded bins.\n                              x-description-i18n:\n                                eng: Regular expression representing the excluded bins.\n                                spa: Expresión regular representando los bines excluídos\n                                por: A expressão regular, representando bines excluídos\n                              example: \n                                    ^(400163|400176|400178|400185|400199|423808|439267|471233|473200|476332|482481|451416|438935|(40117[8-9])|(45763[1-2])|457393|431274)\n                            installments_pattern:\n                              type: string\n                              example: ^(?!(417401|453998|426398|462437|451212|456188))\n                              description: Regular expression representing bins allowed to pay with more than one installment.\n                              x-description-i18n:\n                                eng: Regular expression representing bins allowed to pay with more than one installment.\n                                spa: Expresión regular representando los bines aceptados para pagar con más de una cuota\n                                por: A expressão regular, representando bines aceitos para pagar com mais de uma cota\n                        card_number:\n                          type: object\n                          description: Contains information about card length and validaton.\n                          x-description-i18n:\n                            eng: Contains information about card length and validaton.\n                            spa: Contiene información sobre la longitud y la validación de la tarjeta.\n                            por: Contém informações sobre o comprimento e validação do cartão.\n                          properties:\n                            length:\n                              type: string\n                              description: Card number length.\n                              x-description-i18n:\n                                eng: Card number length.\n                                spa: Longitud del número de la tarjeta de crédito\n                                por: Comprimento do número do cartão de crédito\n                              example: 16\n                            validation:\n                              type: string\n                              example: standard\n                              description: \n                                Whether the card number can be validated using a checksum algorithm\n                                (usually Luhn)\n                              enum:\n                                - standard -- The card number should validate Luhn's algorithm.\n                                - none -- There is no algorithm to validate the checksum.\n                        security_code:\n                          type: object\n                          description: Card security code information.\n                          x-description-i18n:\n                            eng: Card security code information.\n                            spa: Información del código de seguridad de una tarjeta.\n                            por: Informações do código de segurança do cartão.\n                          properties:\n                            mode:\n                              type: string\n                              example: mandatory\n                              description: Whether the security code is mandatory or not.\n                              x-description-i18n:\n                                eng: Whether the security code is mandatory or not.\n                                spa: Indica si el código de seguridad es mandatorio o no\n                                por: Indica se o código de segurança é obrigatório ou não\n                              enum:\n                                - mandatory -- The security code should be given to process the payment.\n                                - optional -- A payment could be issued without the security code.\n                            length:\n                              type: number\n                              description: Security code length.\n                              x-description-i18n:\n                                eng: Security code length.\n                                spa: Longitud del código de seguridad\n                                por: Comprimento do código de segurança\n                              example: 3\n                            card_location:\n                              type: string\n                              example: back\n                              description: \n                                Whether the security code is located in the back or in the front of\n                                the card.\n                              enum:\n                                - back -- The security code is located in the back of the card.\n                                - front -- The security code is located in the front of the card.\n                      description: Payment method settings.\n                      x-description-i18n:\n                        eng: Payment method settings.\n                        spa: Configuración de métodos de pago\n                        por: Configuração de métodos de pagamento\n                    additional_info_needed:\n                      type: array\n                      description: List of additional information that must be supplied by the payer.\n                      x-description-i18n:\n                        eng: List of additional information that must be supplied by the payer.\n                        spa: Lista de información adicional que debe ser provista por el pagador\n                        por: Lista de informações que devem ser fornecidas pelo pagador\n                      enum:\n                        - cardholder_identification_number -- Identification number of the card owner.\n                        - cardholder_identification_type -- Identification type of the card owner.\n                        - cardholder_name -- Name as seen in the card of the card owner.\n                        - issuer_id -- ID of the card issuing entity.\n                    min_allowed_amount:\n                      type: number\n                      example: 0.5\n                      description: Minimum amount that can be processed with this payment method.\n                      x-description-i18n:\n                        eng: Minimum amount that can be processed with this payment method.\n                        spa: Mínimo monto que se puede procesar con este medio de pago\n                        por: Mínimo valor que pode ser processado com este meio de pagamento\n                    max_allowed_amount:\n                      type: number\n                      example: 60000\n                      description: Maximum amount that can be processed with this payment method.\n                      x-description-i18n:\n                        eng: Maximum amount that can be processed with this payment method.\n                        spa: Máximo monto que se puede procesar con este medio de pago\n                        por: Máximo valor que pode ser processado com este meio de pagamento\n                    accreditation_time:\n                      type: number\n                      example: 2880\n                      description: How many time in minutes could happen until processing of the payment.\n                      x-description-i18n:\n                        eng: How many time in minutes could happen until processing of the payment.\n                        spa: Tiempo de procesamiento del pago\n                        por: Tempo de processamento do pagamento\n                    financial_institutions:\n                      type: object\n                      properties:\n                        id:\n                          type: number\n                          description: 'External financial institution identifier (e.g.: company id for atm)'\n                        description:\n                          type: string\n                          description: Descriptive finantial institution name.\n                          x-description-i18n:\n                            eng: Descriptive finantial institution name.\n                            spa: Nombre descriptivo de la institución financiera\n                            por: Nome descritivo para a instituição financeira\n                      description: Finantial institution processing this payment method.\n                      x-description-i18n:\n                        eng: Finantial institution processing this payment method.\n                        spa: Institución financiera procesando el medio de pago\n                        por: Instituição financeira processando o meio de pagamento\n                    processing_modes:\n                      type: string\n                      example: aggregator\n                      description: The processing mode of the means of payment. There are 2 types.\n                      x-description-i18n:\n                        eng: The processing mode of the means of payment. There are 2 types.\n                        spa: Modo de proceso del medio de pago. Hay 2 tipos.\n                        por: Informações do código de segurança do cartão. Existem 2 tipos.\n                      enum:\n                        - Aggegator -- aggregator mode. Receive payments using all the cards and promotions that Mercado Pago offers, in addition to bank transfers and offline payment methods and where the money is deposited and managed in a Mercado Pago bank accounts.\n                        - Gateway -- gateway mode. Receive payments directly into the store codes (merchant account) of the seller using all the seller's own promotions. With this mode they can also negotiate with purchasers, both in terms of tariffs and interest-free installments and promotions.\n        '400':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 1000--the credentials are required.\n                      - 1001--public_key not found.\n        '401':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - unauthorized--unauthorized.\n        '404':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - not_found--not_found.",
			"canonicalURL": "/github.com/mercadopago/devsite-docs@3cbe090aadf3f42ba59e02d3ed01aaf6f92403a6/-/blob/reference/api/payment_methods.yaml",
			"externalURLs": [
				{
					"url": "https://github.com/mercadopago/devsite-docs/blob/3cbe090aadf3f42ba59e02d3ed01aaf6f92403a6/reference/api/payment_methods.yaml",
					"serviceKind": "GITHUB"
				}
			]
		}
	},
	"Error": "unmarshal: yaml: unmarshal errors:\n  yaml: line 1: cannot unmarshal !!map into string; yaml: line 1: cannot unmarshal !!map into string; yaml: line 1: cannot unmarshal !!map into string"
}