{
	"File": {
		"__typename": "FileMatch",
		"repository": {
			"name": "github.com/mercadopago/devsite-docs"
		},
		"file": {
			"name": "oauth.yaml",
			"size": 0,
			"path": "reference/api/oauth.yaml",
			"byteSize": 19273,
			"content": "openapi: 3.0.0\nservers:\n  - url: https://api.mercadopago.com\ninfo:\n  title: Mercado Pago API Reference\n  version: '1.0'\npaths:\n  /oauth/token:\n    post:\n      tags:\n        - $ref: '#/tags/checkout-pro'\n        - $ref: '#/tags/mobile-checkout'\n        - $ref: '#/tags/subscriptions'\n      summary: Create and refresh token\n      x-summary-i18n:\n        eng: Create and refresh token\n        spa: Crear y refrescar token\n        por: Criar e atualizar token\n      description: To create or refresh the necessary token to operate your application in the name of a seller\n      x-description-i18n:\n        eng: To create or refresh the necessary token to operate your application in the name of a seller\n        spa: Para crear o actualizar el token necesario para operar su aplicación en nombre de un vendedor\n        por: Para criar ou atualizar o token necessário para operar seu aplicativo em nome de um vendedor\n      requestBody:\n        content:\n          application/json:\n            schema:\n              type: object\n              properties:\n                client_secret:\n                  type: string\n                  description: Private key to be used in some plugins to generate payments. One of the keys in the pair that make up the credentials that identify an application/integration in your account. \n                  x-description-i18n:\n                    eng: Private key to be used in some plugins to generate payments. One of the keys in the pair that make up the credentials that identify an application/integration in your account.\n                    spa: Clave privada para ser utilizada en algunos complementos para generar pagos. Una de las claves del par que componen las credenciales que identifican una aplicación/integración en tu cuenta.\n                    por: Chave privada para ser utilizada em alguns plugins para gerar pagamentos. Uma das chaves do par que compõe as credenciais que identifica uma aplicação/integração na sua conta.\n                  required: true\n                  example: 'client_secret'\n                client_id:\n                  type: string\n                  description: Unique ID that identifies your application/integration. One of the keys in the pair that make up the credentials that identify an application/integration in your account. \n                  x-description-i18n:\n                    eng: Unique ID that identifies your application/integration. One of the keys in the pair that make up the credentials that identify an application/integration in your account.\n                    spa: ID único que identifica tu aplicación/integración. Una de las claves del par que componen las credenciales que identifican una aplicación/integración en tu cuenta.\n                    por: ID único que identifica sua aplicação/integração. Uma das chaves do par que compõe as credenciais que identifica uma aplicação/integração na sua conta.\n                  required: true\n                  example: 'client_id'\n                grant_type:\n                  type: string\n                  description: Specifies the type of operation to perform. There are two possible operations.\n                  x-description-i18n:\n                    eng: Specifies the type of operation to perform. There are two possible operations.\n                    spa: Especifica el tipo de operación a realizar para obtener tus credenciales.\n                    por: Especifica o tipo de operação a ser executada para obter suas credenciais.\n                  required: true\n                  example: 'authorization_code'\n                  enum:\n                    - authorization_code -- used to get the access token for the first time.\n                    - refresh_token -- it is used to refresh an existing token.\n                code:\n                  type: string\n                  description: Code provided by the authentication server so that the application can obtain an access token and an associated refresh token. It is valid for 10 minutes counted from its generation. Required when grant_type=authorization_code.\n                  x-description-i18n:\n                    eng: Code provided by the authentication server so that the application can obtain an access token and an associated refresh token. It is valid for 10 minutes counted from its generation. Required when grant_type=authorization_code.\n                    spa: Código otorgado por el servidor de autenticación para que la aplicación pueda obtener un access token y un refresh token asociado. Tiene una validez de 10 minutos contados desde su generación. Obligatorio cuando grant_type=authorization_code.\n                    por: Código concedido pelo servidor de autenticação para que a aplicação possa obter um access token e um refresh token associado. Tem validade de 10 minutos contados a partir da sua geração. Requerido quando grant_type=authorization_code.\n                  example: 'TG-XXXXXXXX-241983636'\n                redirect_uri:\n                  type: string\n                  description: URL reported in the Redirect URL field of your application. Required only when grant_type=authorization_code.\n                  x-description-i18n:\n                    eng: URL reported in the Redirect URL field of your application. Required only when grant_type=authorization_code.\n                    spa: URL informada en el campo URL de redirección de tu aplicación. Obligatorio solo cuando grant_type=authorization_code.\n                    por: URL informada no campo Redirect URL da sua aplicação. Requerido apenas quando grant_type=authorization_code.\n                refresh_token:\n                  type: string\n                  description: Value received when the access token is created. Only required when grant_type=refresh_token.\n                  x-description-i18n:\n                    eng: Value received when the access token is created. Only required when grant_type=refresh_token.\n                    spa: Valor recibido cuando se crea el access token. Solo se requiere cuando grant_type=refresh_token.\n                    por: Valor recebido quando o access token é criado. Requerido apenas quando grant_type=refresh_token.\n                test_token:\n                  type: string\n                  description: Added with value = true only when you want to generate credentials for testing.\n      responses:\n        '200':\n          description: Success\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  access_token:\n                    type: string\n                    example: 'APP_USR-4934588586838432-XXXXXXXX-241983636'\n                    description: Security code that identifies the user, their privileges and an application used in different requests from public sources to access protected resources. Its validity is determined by the expires_in parameter and is similar to APP_USR-1585551492-030918-25######3458-2880736, which is composed of\n                    x-description-i18n:\n                      eng: Security code that identifies the user, their privileges and an application used in different requests from public sources to access protected resources. Its validity is determined by the expires_in parameter and is similar to APP_USR-1585551492-030918-25######3458-2880736, which is composed of\n                      spa: Código de seguridad que identifica al usuario, sus privilegios y una aplicación utilizada en diferentes solicitudes de origen público para acceder a los recursos protegidos. Su validez está determinada por el parámetro expires_in y es similar a APP_USR-1585551492-030918-25######3458-2880736 estando compuesto por\n                      por: Código de segurança que identifica o usuário, seus privilégios e uma aplicação utilizado nas diferentes requests de origem pública para ter acesso a recursos protegidos. Tem sua validade determinada pelo parâmetro expires_in e são semelhantes a APP_USR-1585551492-030918-25######3458-2880736 sendo compostos por\n                    enum:\n                      - Access token type -- APP_USR (application on behalf of a user), TEST (test, only valid in sandbox)\n                      - Client ID -- 1585551492\n                      - Creation date (MMddHH) -- 030918\n                      - Security hash -- 25######3458\n                      - User ID -- 2880736\n                  token_type:\n                    type: string\n                    example: 'bearer'\n                    description: necessary information for the token to be used correctly to access protected resources. The token of type \"bearer\" is the only one supported by the authorization server and is used when the access token is included as plain text in the request. It is understood that the bearer has direct access to the token.\n                    x-description-i18n:\n                      eng: necessary information for the token to be used correctly to access protected resources. The token of type \"bearer\" is the only one supported by the authorization server and is used when the access token is included as plain text in the request. It is understood that the bearer has direct access to the token.\n                      spa: información necesaria para que el token se utilice correctamente para acceder a los recursos protegidos. El token de tipo \"bearer\" es el único admitido por el servidor de autorización y se utiliza cuando el access token se incluye como texto sin formato en la solicitud. Se entiende que el bearer tiene acceso directo al token.\n                      por: informações necessárias para que o token seja usado corretamente para acessar recursos protegidos. O token do tipo \"bearer\" é o único suportado pelo servidor de autorização e é usado quando o access token é incluído como texto simples na solicitação. Entende-se que o portador tem acesso direto ao token.\n                  expires_in:\n                    type: number\n                    example: 15552000\n                    description: Fixed access_token expiration time expressed in seconds. By default, the expiration time is 180 days (15552000 seconds).\n                    x-description-i18n:\n                      eng: Fixed access_token expiration time expressed in seconds. By default, the expiration time is 180 days (15552000 seconds).\n                      spa: Tiempo de caducidad de access_token fijo expresado en segundos. De forma predeterminada, el tiempo de caducidad es de 180 días (15552000 segundos).\n                      por: Tempo fixo de expiração do access_token expresso em segundos. Por padrão o tempo de expiração é 180 dias (15552000 segundos).\n                  scope:\n                    type: string\n                    example: 'offline_access read write'\n                    description: Scopes are used in the API authorization and consent process and allow you to determine what access the application requests and what access the user grants. By default, the scopes associated with the token are the ones determined when creating the original token and configuring the application.\n                    x-description-i18n:\n                      eng: Scopes are used in the API authorization and consent process and allow you to determine what access the application requests and what access the user grants. By default, the scopes associated with the token are the ones determined when creating the original token and configuring the application.\n                      spa: Los scopes se utilizan en el proceso de autorización y consentimiento de la API y permiten determinar qué acceso solicita la aplicación y qué acceso otorga el usuario. De forma predeterminada, los ámbitos asociados con el token son los que se determinaron al crear el token original y configurar la aplicación.\n                      por: Scopes são utilizados no processo de autorização e consentimento das APIs e permitem determinar ao que o acesso está sendo solicitado por parte da aplicação e ao que se está concedendo acesso por parte do usuário. Por padrão, os scopes associados ao token são os que foram determinados no momento de criação do token original e configuração da aplicação.\n                  user_id:\n                    type: number\n                    example: 241983636\n                    description: Identification number (Mercado Pago ID) generated automatically when creating a Mercado Pago account. It is a unique number that identifies the Mercado Pago seller and is the owner of the application.\n                    x-description-i18n:\n                      eng: Identification number (Mercado Pago ID) generated automatically when creating a Mercado Pago account. It is a unique number that identifies the Mercado Pago seller and is the owner of the application.\n                      spa: Número de identificación (Mercado Pago ID) generado automáticamente al crear una cuenta de Mercado Pago. Es un número único que identifica al vendedor de Mercado Pago y es el owner de la aplicación.\n                      por: Número de identificação (Mercado Pago ID) gerado automaticamente na criação da conta no Mercado Pago. É um número único que identifica o vendedor Mercado Pago e é o owner da aplicação.\n                  refresh_token:\n                    type: string\n                    example: 'TG-XXXXXXXX-241983636'\n                    description: temporal grants code used to obtain access tokens so that authorization and access to resources remain valid before the end of the access token's validity period. They define an ID used to retrieve authorization information. Unlike access tokens, refresh tokens can only be used for calls on the authorization server and are never sent to resource servers.\n                    x-description-i18n:\n                      eng: temporal grants code used to obtain access tokens so that authorization and access to resources remain valid before the end of the access token's validity period. They define an ID used to retrieve authorization information. Unlike access tokens, refresh tokens can only be used for calls on the authorization server and are never sent to resource servers.\n                      spa: Código de temporal grants utilizadas para obtener access tokens para que la autorización y el acceso a los recursos sigan siendo válidos antes del final del período de validez del access token. Definen un ID utilizado para recuperar información de autorización. A diferencia de los access tokens, los refresh tokens solo se pueden usar para llamadas en el servidor de autorización y nunca se envían a los servidores de recursos.\n                      por: Código de temporal grants usadas para obter access tokens de modo que a autorização e acesso a recursos continuem válidos antes do final do período de validade do access token. Definem um ID usado para recuperar informações de autorização. Ao contrário dos access tokens, os tokens de atualização só podem ser usados ​​para chamadas no servidor de autorização e nunca são enviados para servidores de recursos.\n                  public_key:\n                    type: string\n                    example: 'APP_USR-d0a26210-XXXXXXXX-479f0400869e'\n                    description: Public key of the application that will normally be used in the frontend and will allow, for example, knowing the means of payment and encrypting the card data. One of the keys in the pair that make up the credentials that identify an application/integration in your account.\n                    x-description-i18n:\n                      eng: Public key of the application that will normally be used in the frontend and will allow, for example, knowing the means of payment and encrypting the card data. One of the keys in the pair that make up the credentials that identify an application/integration in your account.\n                      spa: Clave pública de la aplicación que normalmente se utilizará en el frontend y permitirá, por ejemplo, conocer el medio de pago y cifrar los datos de la tarjeta. Una de las claves del par que componen las credenciales que identifican una aplicación/integración en tu cuenta.\n                      por: Chave pública da aplicação que normalmente será usada no frontend e permitirá, por exemplo, conhecer os meios de pagamento e criptografar os dados do cartão. Uma das chaves do par que compõe as credenciais que identifica uma aplicação/integração na sua conta.\n                  live_mode: \n                    type: boolean\n                    example: true\n                    description: Indicates whether the application is in production or test mode.\n                    x-description-i18n:\n                      eng: Indicates whether the application is in production or test mode.\n                      spa: Indica si la aplicación está en modo de producción o de prueba.\n                      por: indica se a aplicação está em modo de produção ou de teste.\n        '400':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  message:\n                    type: string\n                    example: 'Error validating grant. Your authorization code or refresh token may be expired or it was already used.'\n                  status:\n                    type: number\n                    example: 400\n                  errorKey:\n                    type: string\n                    example: 'expired_grant'\n                    enum:\n                      - invalid_client -- The provided client_id and/or client_secret of your app is invalid.\n                      - invalid_grant -- There are several reasons for this error, it could be because the authorization_code or refresh_token is invalid, expired or revoked, was sent in an incorrect flow, belongs to another client, or the redirect_uri used in the authorization flow does not match what your application has configured.\n                      - invalid_scope -- The requested scope is invalid, unknown, or wrongly formed. The allowed values for the scope parameter are “offline_access”, ”write”, ”read”.\n                      - invalid_request -- The request does not include a required parameter, includes an unsupported parameter or parameter value, has a duplicated value, or is otherwise malformed.\n                      - unsupported_grant_type -- Allowed values for grant_type are “authorization_code” or “refresh_token”.\n                      - forbidden -- The call does not authorize access, possibly another user's token is being used.\n                      - unauthorized_client -- The application does not have a grant with the user or the permissions (scopes) that the application has with this user do not allow creating a token.\n                  cause:\n                    type: array\n                    items:\n                      type: string\n                    example: []\n  ",
			"canonicalURL": "/github.com/mercadopago/devsite-docs@1b13e24fc597cadeceae34c2f368ecf18b8479e7/-/blob/reference/api/oauth.yaml",
			"externalURLs": [
				{
					"url": "https://github.com/mercadopago/devsite-docs/blob/1b13e24fc597cadeceae34c2f368ecf18b8479e7/reference/api/oauth.yaml",
					"serviceKind": "GITHUB"
				}
			]
		}
	},
	"Error": "unmarshal: yaml: unmarshal errors:\n  yaml: line 1: cannot unmarshal !!bool `true` into []string; yaml: line 1: cannot unmarshal !!map into string; yaml: line 1: cannot unmarshal !!map into string; yaml: line 1: cannot unmarshal !!map into string"
}