{
	"File": {
		"__typename": "FileMatch",
		"repository": {
			"name": "github.com/strohne/Facepager"
		},
		"file": {
			"name": "TwitterStreaming.v1_1.oa3.json",
			"size": 0,
			"path": "apis/TwitterStreaming.v1_1.oa3.json",
			"byteSize": 39086,
			"content": "{\n    \"openapi\": \"3.0.0\",\n    \"x-facepager-module\": \"Twitter Streaming\",\n\n    \"x-facepager-extract\" : null,\n\t\"x-facepager-objectid\" : \"id\",\n\t\"x-facepager-pagination\": {\n\t\t\"method\" : \"stream\"\n\t},\n    \n    \"info\": {\n        \"title\": \"Twitter Streaming API\",\n        \"description\": \"The Twitter Streaming API let you streams live tweets and get user information.\",\n        \"termsOfService\": \"https://developer.twitter.com/en/developer-terms\",\n        \"version\": \"1.1\"\n    },\n    \"externalDocs\": {\n        \"url\": \"https://developer.twitter.com/en/docs/api-reference-index\"\n    },\n    \"servers\": [{\n            \"url\": \"https://stream.twitter.com/1.1\",\n            \"x-facepager-suffix\": \".json\"\n        }\n    ],\n\t\"paths\":{\n        \"/statuses/filter\": {\n            \"get\": {\n                \"summary\": \"Returns public statuses that match one or more filter predicates. Multiple parameters may be specified which allows most clients to use a single connection to the Streaming API. Both GET and POST requests are supported, but GET requests with too many parameters may cause the request to be rejected for excessive URL length. Use a POST request to avoid long URLs..\",\n                \"externalDocs\": {\n                    \"url\": \"https://developer.twitter.com/en/docs/tweets/filter-realtime/api-reference/post-statuses-filter\"\n                },\n                \"parameters\": [\n                    {\n                        \"name\": \"follow\",\n                        \"in\": \"query\",\n                        \"description\": \"A comma separated list of user IDs, indicating the users to return statuses for in the stream.\",\n                        \"schema\": {\n                            \"type\": \"string\"\n                        }\n                    }, {\n                        \"name\": \"track\",\n                        \"in\": \"query\",\n                        \"description\": \"Keywords to track. Phrases of keywords are specified by a comma-separated list.\",\n                        \"schema\": {\n                            \"type\": \"string\"\n                        },\n                        \"example\": \"\u003cObject ID\u003e\"\n                    }, {\n                        \"name\": \"locations\",\n                        \"in\": \"query\",\n                        \"description\": \"Specifies a set of bounding boxes to track.\",\n                        \"schema\": {\n                            \"type\": \"string\"\n                        }\n                    }, {\n                        \"name\": \"delimited\",\n                        \"in\": \"query\",\n                        \"description\": \"Specifies whether messages should be length-delimited.\",\n                        \"schema\": {\n                            \"type\": \"string\"\n                        }\n                    }, {\n                        \"name\": \"stall_warnings\",\n                        \"in\": \"query\",\n                        \"description\": \"Specifies whether stall warnings should be delivered.\",\n                        \"schema\": {\n                            \"type\": \"string\"\n                        }\n                    }\n                ],\n                \"responses\": {\n                    \"200\": {\n                        \"description\": \"Returns public statuses that match one or more filter predicates.\",\n                        \"content\": {\n                            \"application/json\": {\n                                \"schema\": {\n                                    \"type\":\"object\",\n                                    \"properties\": {\n                                        \"$ref\" : \"#components/schema/tweet/properties\"\n                                    }\n                                }\n                            }\n                        }\n                    }\n                }\n            }\n        },\n\n        \"/statuses/sample\": {\n            \"get\": {\n                \"summary\": \"Returns a small random sample of all public statuses via a stream. The Tweets returned by the default access level are the same, so if two different clients connect to this endpoint, they will see the same Tweets.\",\n                \"externalDocs\": {\n                    \"url\": \"https://developer.twitter.com/en/docs/tweets/sample-realtime/api-reference/get-statuses-sample\"\n                },\n                \"parameters\": [\n                    {\n                        \"name\": \"delimited\",\n                        \"in\": \"query\",\n                        \"description\": \"Specifies whether messages should be length-delimited. \",\n                        \"schema\": {\n                            \"type\": \"string\"\n                        }\n                    }, {\n                        \"name\": \"stall_warnings\",\n                        \"in\": \"query\",\n                        \"description\": \"Specifies whether stall warnings should be delivered.\",\n                        \"schema\": {\n                            \"type\": \"string\"\n                        }\n                    }\n\n                ],\n                \"responses\": {\n                    \"200\": {\n                        \"description\": \"Returns public statuses that match one or more filter predicates.\",\n                        \"content\": {\n                            \"application/json\": {\n                                \"schema\": {\n                                    \"type\":\"object\",\n                                    \"properties\": {\n                                        \"$ref\" : \"#components/schema/tweet/properties\"\n                                    }\n                                }\n                            }\n                        }\n                    }\n                }\n            }\n            },\n       \"/labs/1/tweets/stream/sample\": {\n            \"get\": {\n                \"summary\": \"Streams about 1% of all Tweets in real-time.\",\n                \"externalDocs\": {\n                    \"url\": \"https://developer.twitter.com/en/docs/labs/sampled-stream/api-reference/get-tweets-stream-sample\"\n                },\n                \"parameters\": [{\n                        \"name\": \"expansions\",\n                        \"in\": \"query\",\n                        \"description\": \"Comma-separated list of fields to expand. Expansions enable requests to expand an ID into a full object in the includes response object.\",\n                        \"schema\": {\n                            \"type\": \"string\"\n                        }\n                    }, {\n                        \"name\": \"format\",\n                        \"in\": \"query\",\n                        \"description\": \"Format for all the objects returned as part of the response, including those returned in expansions.\",\n                        \"schema\": {\n                            \"type\": \"string\"\n                        }\n                    }, {\n                        \"name\": \"place.format\",\n                        \"in\": \"query\",\n                        \"description\": \"Format for all Place objects returned in response. Can be used together with other format parameters to expand or reduce Place objects only.\",\n                        \"schema\": {\n                            \"type\": \"string\"\n                        }\n                    }, {\n                        \"name\": \"tweet.format\",\n                        \"in\": \"query\",\n                        \"description\": \"Format for all Tweet objects returned in response. Can be used together with other format parameters to expand or reduce Tweet objects only.\",\n                        \"schema\": {\n                            \"type\": \"string\"\n                        }\n                    }, {\n                        \"name\": \"user.format\",\n                        \"in\": \"query\",\n                        \"description\": \"Format for all User objects returned in response. Can be used together with other format parameters to expand or reduce User objects only.\",\n                        \"schema\": {\n                            \"type\": \"string\"\n                        }\n                    }\n                ],\n                \"responses\": {\n                    \"200\": {\n                        \"description\": \"All Information about 1% of all Tweets in real-time\",\n                        \"content\": {\n                            \"application/json\": {\n                                \"schema\": {\n\t\t\t\t\t\t\t\t\t\t\"type\":\"object\",\n\t\t\t\t\t\t\t\t\t\t\"properties\": {\n\t\t\t\t\t\t\t\t\t\t\t\"$ref\" : \"#components/schema/tweet/properties\"\n\t\t\t\t\t\t\t\t\t\t}\n                                }\n                            }\n                        }\n                    }\n                }\n            \n          }\n        }            \n      },\n\"components\": {\n    \"schema\": {\n        \"tweet\": {\n            \"properties\": {\n                \"created_at\": {\n                    \"description\": \"UTC time when this Tweet was created.\"\n                },\n                \"id\": {\n                    \"description\": \"The integer representation of the unique identifier for this Tweet. This number is greater than 53 bits and some programming languages may have difficulty/silent defects in interpreting it. Using a signed 64 bit integer for storing this identifier is safe. Use id_str for fetching the identifier to stay on the safe side. See Twitter IDs, JSON and Snowflake.\"\n                },\n                \"id_str\": {\n                    \"description\": \"The string representation of the unique identifier for this Tweet. Implementations should use this rather than the large integer in id.\"\n                },\n                \"text\": {\n                    \"description\": \"The actual UTF-8 text of the status update. See twitter-text for details on what characters are currently considered valid.\"\n                },\n                \"source\": {\n                    \"description\": \"Utility used to post the Tweet, as an HTML-formatted string. Tweets from the Twitter website have a source value of web.\"\n                },\n                \"truncated\": {\n                    \"description\": \"Indicates whether the value of the text parameter was truncated, for example, as a result of a retweet exceeding the original Tweet text length limit of 140 characters. Truncated text will end in ellipsis, like this ... Since Twitter now rejects long Tweets vs truncating them, the large majority of Tweets will have this set to false . Note that while native retweets may have their toplevel text property shortened, the original text will be available under the retweeted_status object and the truncated parameter will be set to the value of the original status (in most cases, false ).\"\n                },\n                \"in_reply_to_status_id\": {\n                    \"description\": \"Nullable. If the represented Tweet is a reply, this field will contain the integer representation of the original Tweet's ID.\"\n                },\n                \"in_reply_to_status_id_str\": {\n                    \"description\": \"Nullable. If the represented Tweet is a reply, this field will contain the string representation of the original Tweet's ID. \"\n                },\n                \"in_reply_to_user_id\": {\n                    \"description\": \"Nullable. If the represented Tweet is a reply, this field will contain the integer representation of the original Tweet's author ID. This will not necessarily always be the user directly mentioned in the Tweet.\"\n                },\n                \"in_reply_to_user_id_str\": {\n                    \"description\": \"Nullable. If the represented Tweet is a reply, this field will contain the string representation of the original Tweet's author ID. This will not necessarily always be the user directly mentioned in the Tweet.\"\n                },\n                \"in_reply_to_screen_name\": {\n                    \"description\": \"Nullable. If the represented Tweet is a reply, this field will contain the screen name of the original Tweet's author.\"\n                },\n                \"user\": {\n                    \"description\": \"The user who posted this Tweet. See User data dictionary for complete list of attributes.\",\n                    \"type\": \"object\",\n                    \"properties\": {\n                        \"$ref\": \"#components/schema/user/properties\"\n                    }\n                },\n                \"coordinates\": {\n                    \"description\": \"Nullable. Represents the geographic location of this Tweet as reported by the user or client application. The inner coordinates array is formatted as geoJSON (longitude first, then latitude).\",\n                    \"type\": \"object\",\n                    \"properties\": {\n                        \"$ref\": \"#components/schema/coordinates/properties\"\n                    }\n                },\n                \"place\": {\n                    \"description\": \"Nullable When present, indicates that the tweet is associated (but not necessarily originating from) a Place.\",\n                    \"type\": \"object\",\n                    \"properties\": {\n                        \"$ref\": \" #components/schema/place/properties\"\n                    }\n                },\n                \"quoted_status_id\": {\n                    \"description\": \"This field only surfaces when the Tweet is a quote Tweet. This field contains the integer value Tweet ID of the quoted Tweet.\"\n                },\n                \"quoted_status_id_str\": {\n                    \"description\": \"This field only surfaces when the Tweet is a quote Tweet. This is the string representation Tweet ID of the quoted Tweet.\"\n                },\n                \"is_quote_status\": {\n                    \"description\": \"Indicates whether this is a Quoted Tweet.\"\n                },\n                \"quoted_status\": {\n                    \"description\": \"This field only surfaces when the Tweet is a quote Tweet. This attribute contains the Tweet object of the original Tweet that was quoted.\"\n                },\n                \"retweeted_status\": {\n                    \"description\": \"Users can amplify the broadcast of Tweets authored by other users by retweeting . Retweets can be distinguished from typical Tweets by the existence of a retweeted_status attribute. This attribute contains a representation of the original Tweet that was retweeted. Note that retweets of retweets do not show representations of the intermediary retweet, but only the original Tweet. (Users can also unretweet a retweet they created by deleting their retweet.)\"\n                },\n                \"quote_count\": {\n                    \"description\": \"Nullable. Indicates approximately how many times this Tweet has been quoted by Twitter users. Note: This object is only available with the Premium and Enterprise tier product.\"\n                },\n                \"reply_count\": {\n                    \"description\": \"Number of times this Tweet has been replied to. Note:This object is only available with the Premium and Enterprise tier products.\"\n                },\n                \"retweet_count\": {\n                    \"description\": \"Number of times this Tweet has been retweeted.\"\n                },\n                \"favorite_count\": {\n                    \"description\": \"Nullable. Indicates approximately how many times this Tweet has been liked by Twitter users.\"\n                },\n                \"entities\": {\n                    \"description\": \"Entities which have been parsed out of the text of the Tweet. Additionally see Entities in Twitter Objects.\",\n                    \"type\": \"object\",\n                    \"properties\": {\n                        \"$ref\": \"#components/schema/entities/properties\"\n                    }\n                },\n                \"extended_entities\": {\n                    \"description\": \"When between one and four native photos or one video or one animated GIF are in Tweet, contains an array 'media' metadata. This is also available in Quote Tweets. Additionally see Entities in Twitter Objects.\"\n                },\n                \"favorited\": {\n                    \"description\": \"Nullable. Indicates whether this Tweet has been liked by the authenticating user.\"\n                },\n                \"retweeted\": {\n                    \"description\": \"Indicates whether this Tweet has been Retweeted by the authenticating user.\"\n                },\n                \"possibly_sensitive\": {\n                    \"description\": \"Nullable. This field only surfaces when a Tweet contains a link. The meaning of the field doesn't pertain to the Tweet content itself, but instead it is an indicator that the URL contained in the Tweet may contain content or media identified as sensitive content.\"\n                },\n                \"filter_level\": {\n                    \"description\": \"Indicates the maximum value of the filter_level parameter which may be used and still stream this Tweet. So a value of medium will be streamed on none, low, and medium streams.\"\n                },\n                \"lang\": {\n                    \"description\": \"Nullable. When present, indicates a BCP 47 language identifier corresponding to the machine-detected language of the Tweet text, or und if no language could be detected.\"\n                },\n                \"matching_rules\": {\n                    \"description\": \"Present in filtered products such as Twitter Search and PowerTrack. Provides the id and tag associated with the rule that matched the Tweet. With PowerTrack, more than one rule can match a Tweet.\"\n                }\n            }\n        },\n        \"user\": {\n            \"properties\": {\n                \"id\": {\n                    \"description\": \"The integer representation of the unique identifier for this User. This number is greater than 53 bits and some programming languages may have difficulty/silent defects in interpreting it. Using a signed 64 bit integer for storing this identifier is safe. Use id_str for fetching the identifier to stay on the safe side. See Twitter IDs, JSON and Snowflake.\"\n                },\n                \"id_str\": {\n                    \"description\": \"The string representation of the unique identifier for this User. Implementations should use this rather than the large, possibly un-consumable integer in id.\"\n                },\n                \"name\": {\n                    \"description\": \"The name of the user, as they've defined it. Not necessarily a person's name. Typically capped at 50 characters, but subject to change.\"\n                },\n                \"screen_name\": {\n                    \"description\": \"The screen name, handle, or alias that this user identifies themselves with. screen_names are unique but subject to change. Use id_str as a user identifier whenever possible. Typically a maximum of 15 characters long, but some historical accounts may exist with longer names.\"\n                },\n                \"location\": {\n                    \"description\": \"Nullable . The user-defined location for this account's profile. Not necessarily a location, nor machine-parseable. This field will occasionally be fuzzily interpreted by the Search service.\"\n                },\n                \"derived\": {\n                    \"description\": \"Enterprise APIs only Collection of Enrichment metadata derived for user. Provides the Profile Geo Enrichment metadata. See referenced documentation for more information, including JSON data dictionaries.\"\n                },\n                \"url\": {\n                    \"description\": \"Nullable . A URL provided by the user in association with their profile.\"\n                },\n                \"description\": {\n                    \"description\": \"Nullable . The user-defined UTF-8 string describing their account.\"\n                },\n                \"protected\": {\n                    \"description\": \"When true, indicates that this user has chosen to protect their Tweets. See About Public and Protected Tweets.\"\n                },\n                \"verified\": {\n                    \"description\": \"When true, indicates that the user has a verified account. See Verified Accounts.\"\n                },\n                \"followers_count\": {\n                    \"description\": \"The number of followers this account currently has. Under certain conditions of duress, this field will temporarily indicate '0'. \"\n                },\n                \"frieds_count\": {\n                    \"description\": \"The number of users this account is following (AKA their \\\"followings\\\"). Under certain conditions of duress, this field will temporarily indicate '0'.\"\n                },\n                \"listed_count\": {\n                    \"description\": \"The number of public lists that this user is a member of.\"\n                },\n                \"favourites_count\": {\n                    \"description\": \"The number of Tweets this user has liked in the account's lifetime. British spelling used in the field name for historical reasons.\"\n                },\n                \"statuses_count\": {\n                    \"description\": \"The number of Tweets (including retweets) issued by the user.\"\n                },\n                \"created_at\": {\n                    \"description\": \"The UTC datetime that the user account was created on Twitter.\"\n                },\n                \"profile_banner_url\": {\n                    \"description\": \"The HTTPS-based URL pointing to the standard web representation of the user's uploaded profile banner. By adding a final path element of the URL, it is possible to obtain different image sizes optimized for specific displays. For size variants, please see User Profile Images and Banners.\"\n                },\n                \"profile_image_url_https\": {\n                    \"description\": \"A HTTPS-based URL pointing to the user's profile image.\"\n                },\n                \"default_profile\": {\n                    \"description\": \"When true, indicates that the user has not altered the theme or background of their user profile.\"\n                },\n                \"default_profile_image\": {\n                    \"description\": \"When true, indicates that the user has not uploaded their own profile image and a default image is used instead.\"\n                },\n                \"withheld_in_countries\": {\n                    \"description\": \"When present, indicates a list of uppercase two-letter country codes this content is withheld from. Twitter supports the following non-country values for this field: \\\"XX\\\" - Content is withheld in all countries \\\"XY\\\" - Content is withheld due to a DMCA request.\"\n                },\n                \"withheld_scope\": {\n                    \"description\": \"When present, indicates that the content being withheld is a \\\"user.\\\"\"\n                }\n            }\n        },\n        \"entities\": {\n            \"properties\": {\n                \"hashtags\": {\n                    \"description\": \"Represents hashtags which have been parsed out of the Tweet text.\",\n                    \"type\": \"object\",\n                    \"properties\": {\n                        \"indices\": {\n                            \"description\": \"An array of integers indicating the offsets within the Tweet text where the hashtag begins and ends. The first integer represents the location of the # character in the Tweet text string. The second integer represents the location of the first character after the hashtag. Therefore the difference between the two numbers will be the length of the hashtag name plus one (for the '#' character).\"\n                        },\n                        \"text\": {\n                            \"description\": \"Name of the hashtag, minus the leading '#' character.\"\n                        }\n                    }\n                },\n                \"media\": {\n                    \"description\": \"Represents media elements uploaded with the Tweet.\",\n                    \"type\": \"object\",\n                    \"properties\": {\n                        \"display_url\": {\n                            \"description\": \"URL of the media to display to clients.\"\n                        },\n                        \"expanded_url\": {\n                            \"description\": \"An expanded version of display_url. Links to the media display page.\"\n                        },\n                        \"id\": {\n                            \"description\": \"ID of the media expressed as a 64-bit integer. \"\n                        },\n                        \"id_str\": {\n                            \"description\": \"ID of the media expressed as a string.\"\n                        },\n                        \"indices\": {\n                            \"description\": \"An array of integers indicating the offsets within the Tweet text where the URL begins and ends. The first integer represents the location of the first character of the URL in the Tweet text. The second integer represents the location of the first non-URL character occurring after the URL (or the end of the string if the URL is the last part of the Tweet text).\"\n                        },\n                        \"media_url\": {\n                            \"description\": \"An http:// URL pointing directly to the uploaded media file.For media in direct messages, media_url is the same https URL as media_url_https and must be accessed by signing a request with the user's access token using OAuth 1.0A.It is not possible to access images via an authenticated twitter.com session. Please visit this page to learn how to account for these recent change. You cannot directly embed these images in a web page. See Photo Media URL formatting for how to format a photo's URL, such as media_url_https, based on the available sizes.\"\n                        },\n                        \"media_url_https\": {\n                            \"description\": \"An https:// URL pointing directly to the uploaded media file, for embedding on https pages. For media in direct messages, media_url_https must be accessed by signing a request with the user's access token using OAuth 1.0A. It is not possible to access images via an authenticated twitter.com session. Please visit this page to learn how to account for these recent change.  You cannot directly embed these images in a web page. See Photo Media URL formatting for how to format a photo's URL, such as media_url_https, based on the available sizes.\"\n                        },\n                        \"sizes\": {\n                            \"description\": \"An object showing available sizes for the media file. See Photo Media URL formatting for how to format a photo's URL, such as media_url_https, based on the available sizes.\",\n                            \"type\": \"object\",\n                            \"properties\": {\n                                \"thumb\": {\n                                    \"description\": \"Information for a thumbnail-sized version of the media.Thumbnail-sized photo media will be limited to fill a 150x150 boundary and cropped.\",\n                                    \"type\": \"object\",\n                                    \"properties\": {\n                                        \"w\": {\n                                            \"description\": \"Width in pixels of this size.\"\n                                        },\n                                        \"h\": {\n                                            \"description\": \"Height in pixels of this size.\"\n                                        },\n                                        \"resize\": {\n                                            \"description\": \"Resizing method used to obtain this size. A value of fit means that the media was resized to fit one dimension, keeping its native aspect ratio. A value of crop means that the media was cropped in order to fit a specific resolution.\"\n                                        }\n                                    },\n                                    \"large\": {\n                                        \"description\": \"Information for a large-sized version of the media. Small-sized photo media will be limited to fit within a 680x680 boundary.\",\n                                        \"type\": \"object\",\n                                        \"properties\": {\n                                            \"w\": {\n                                                \"description\": \"Width in pixels of this size.\"\n                                            },\n                                            \"h\": {\n                                                \"description\": \"Height in pixels of this size.\"\n                                            },\n                                            \"resize\": {\n                                                \"description\": \"Resizing method used to obtain this size. A value of fit means that the media was resized to fit one dimension, keeping its native aspect ratio. A value of crop means that the media was cropped in order to fit a specific resolution.\"\n                                            }\n                                        }\n                                    },\n                                    \"medium\": {\n                                        \"description\": \"Information for a medium-sized version of the media. Medium-sized photo media will be limited to fit within a 1200x1200 boundary.\",\n                                        \"type\": \"object\",\n                                        \"properties\": {\n                                            \"w\": {\n                                                \"description\": \"Width in pixels of this size.\"\n                                            },\n                                            \"h\": {\n                                                \"description\": \"Height in pixels of this size.\"\n                                            },\n                                            \"resize\": {\n                                                \"description\": \"Resizing method used to obtain this size. A value of fit means that the media was resized to fit one dimension, keeping its native aspect ratio. A value of crop means that the media was cropped in order to fit a specific resolution.\"\n                                            }\n                                        }\n                                    },\n                                    \"small\": {\n                                        \"description\": \"Information for a small-sized version of the media.Large-sized photo media will be limited to fit within a 2048x2048 boundary.\",\n                                        \"type\": \"object\",\n                                        \"properties\": {\n                                            \"w\": {\n                                                \"description\": \"Width in pixels of this size.\"\n                                            },\n                                            \"h\": {\n                                                \"description\": \"Height in pixels of this size.\"\n                                            },\n                                            \"resize\": {\n                                                \"description\": \"Resizing method used to obtain this size. A value of fit means that the media was resized to fit one dimension, keeping its native aspect ratio. A value of crop means that the media was cropped in order to fit a specific resolution.\"\n                                            }\n                                        }\n                                    }\n                                }\n                            },\n                            \"source_status_id\": {\n                                \"description\": \"Nullable. For Tweets containing media that was originally associated with a different tweet, this ID points to the original Tweet. \"\n                            },\n                            \"source_status_id_str\": {\n                                \"description\": \"Nullable. For Tweets containing media that was originally associated with a different tweet, this string-based ID points to the original Tweet.\"\n                            },\n                            \"type\": {\n                                \"description\": \"Type of uploaded media. Possible types include photo, video, and animated_gif.\"\n                            },\n                            \"url\": {\n                                \"description\": \"Wrapped URL for the media link. This corresponds with the URL embedded directly into the raw Tweet text, and the values for the indices parameter.\"\n                            }\n                        }\n                    }\n                },\n                \"urls\": {\n                    \"description\": \"Represents URLs included in the text of a Tweet.\",\n                    \"type\": \"object\",\n                    \"properties\": {\n                        \"display_url\": {\n                            \"description\": \"URL pasted/typed into Tweet.\"\n                        },\n                        \"expanded_url\": {\n                            \"description\": \"Expanded version of `` display_url`` .\"\n                        },\n                        \"indices\": {\n                            \"description\": \"An array of integers representing offsets within the Tweet text where the URL begins and ends. The first integer represents the location of the first character of the URL in the Tweet text. The second integer represents the location of the first non-URL character after the end of the URL.\"\n                        },\n                        \"url\": {\n                            \"description\": \"Wrapped URL, corresponding to the value embedded directly into the raw Tweet text, and the values for the indices parameter.\"\n                        }\n                    }\n                },\n                \"user_mentions\": {\n                    \"description\": \"Represents other Twitter users mentioned in the text of the Tweet.\",\n                    \"type\": \"object\",\n                    \"properties\": {\n                        \"id\": {\n                            \"description\": \"ID of the mentioned user, as an integer.\"\n                        },\n                        \"id_str\": {\n                            \"description\": \"If of the mentioned user, as a string.\"\n                        },\n                        \"indices\": {\n                            \"description\": \"An array of integers representing the offsets within the Tweet text where the user reference begins and ends. The first integer represents the location of the '@' character of the user mention. The second integer represents the location of the first non-screenname character following the user mention.\"\n                        },\n                        \"name\": {\n                            \"description\": \"Display name of the referenced user.\"\n                        },\n                        \"screen_name\": {\n                            \"description\": \"Screen name of the referenced user.\"\n                        }\n                    }\n                },\n                \"symbols\": {\n                    \"description\": \"Represents symbols, i.e. $cashtags, included in the text of the Tweet.\",\n                    \"type\": \"object\",\n                    \"properties\": {\n                        \"indices\": {\n                            \"description\": \"An array of integers indicating the offsets within the Tweet text where the symbol/cashtag begins and ends. The first integer represents the location of the $ character in the Tweet text string. The second integer represents the location of the first character after the cashtag. Therefore the difference between the two numbers will be the length of the hashtag name plus one (for the '$' character).\"\n                        },\n                        \"text\": {\n                            \"description\": \"Name of the cashhtag, minus the leading '$' character.\"\n                        }\n                    }\n                },\n                \"polls\": {\n                    \"description\": \"Represents Twitter Polls included in the Tweet.\",\n                    \"type\": \"object\",\n                    \"properties\": {\n                        \"options\": {\n                            \"description\": \"An array of options, each having a poll position, and the text for that position.\"\n                        },\n                        \"end_datetime\": {\n                            \"description\": \"Time stamp (UTC) of when poll ends.\"\n                        },\n                        \"duration_minutes\": {\n                            \"description\": \"Duration of poll in minutes.\"\n                        }\n                    }\n                }\n            }\n        },\n        \"place\": {\n            \"properties\": {\n                \"id\": {\n                    \"description\": \"ID representing this place. Note that this is represented as a string, not an integer.\"\n                },\n                \"url\": {\n                    \"description\": \"URL representing the location of additional place metadata for this place. \"\n                },\n                \"place_type\": {\n                    \"description\": \"The type of location represented by this place.\"\n                },\n                \"name\": {\n                    \"description\": \"Short human-readable representation of the place's name.\"\n                },\n                \"full_name\": {\n                    \"description\": \"Full human-readable representation of the place's name.\"\n                },\n                \"country_code\": {\n                    \"description\": \"Shortened country code representing the country containing this place.\"\n                },\n                \"country\": {\n                    \"description\": \"Name of the country containing this place.\"\n                },\n                \"bounding_box\": {\n                    \"description\": \"A bounding box of coordinates which encloses this place.\",\n                    \"type\": \"object\",\n                    \"properties\": {\n                        \"coordinates\": {\n                            \"description\": \"A series of longitude and latitude points, defining a box which will contain the Place entity this bounding box is related to. Each point is an array in the form of [longitude, latitude]. Points are grouped into an array per bounding box. Bounding box arrays are wrapped in one additional array to be compatible with the polygon notation.\"\n                        },\n                        \"type\": {\n                            \"description\": \"The type of data encoded in the coordinates property. This will be \\\"Polygon\\\" for bounding boxes and \\\"Point\\\" for Tweets with exact coordinates.\"\n                        }\n                    }\n                },\n                \"attributes\": {\n                    \"description\": \"When using PowerTrack, 30-Day and Full-Archive Search APIs, and Volume Streams this hash is null.\"\n                }\n            }\n        },\n        \"coordinates\": {\n            \"properties\": {\n                \"coordinates\": {\n                    \"description\": \"The longitude and latitude of the Tweet's location, as a collection in the form [longitude, latitude].\"\n                },\n                \"type\": {\n                    \"description\": \"The type of data encoded in the coordinates property. This will be \\\"Point\\\" for Tweet coordinates fields.\"\n                }\n            }\n        }\n\t}\n\t}\n}\n",
			"canonicalURL": "/github.com/strohne/Facepager@8fcfa388805a5e93e74f32b284d49abc8e92340c/-/blob/apis/TwitterStreaming.v1_1.oa3.json",
			"externalURLs": [
				{
					"url": "https://github.com/strohne/Facepager/blob/8fcfa388805a5e93e74f32b284d49abc8e92340c/apis/TwitterStreaming.v1_1.oa3.json",
					"serviceKind": "GITHUB"
				}
			]
		}
	},
	"Error": "unmarshal: json: line 3:12: callback: json: cannot unmarshal string into Go value of type ogen.Schema"
}