{
	"File": {
		"__typename": "FileMatch",
		"repository": {
			"name": "github.com/mercadopago/devsite-docs"
		},
		"file": {
			"name": "oauth.yaml",
			"size": 0,
			"path": "reference/api/oauth.yaml",
			"byteSize": 8120,
			"content": "openapi: 3.0.0\nservers:\n  - url: https://api.mercadopago.com\ninfo:\n  title: Mercado Pago API Reference\n  version: '1.0'\npaths:\n  /oauth/token:\n    post:\n      tags:\n        - $ref: '#/tags/checkout-pro'\n        - $ref: '#/tags/mobile-checkout'\n        - $ref: '#/tags/subscriptions'\n      summary: Create and refresh token\n      description: To create or refresh the necessary token to operate your application in the name of a seller\n      requestBody:\n        content:\n          application/json:\n            schema:\n              type: object\n              properties:\n                client_secret:\n                  type: string\n                  description: Private key to be used in some plugins to generate payments. One of the keys in the pair that make up the credentials that identify an application/integration in your account. \n                  required: true\n                  example: 'client_secret'\n                client_id:\n                  type: string\n                  description: Unique ID that identifies your application/integration. One of the keys in the pair that make up the credentials that identify an application/integration in your account. \n                  required: true\n                  example: 'client_id'\n                grant_type:\n                  type: string\n                  description: Specifies the type of operation to perform. There are two possible operations.\n                  required: true\n                  example: 'authorization_code'\n                  enum:\n                    - authorization_code -- used to get the access token for the first time.\n                    - refresh_token -- it is used to refresh an existing token.\n                code:\n                  type: string\n                  description: Code provided by the authentication server so that the application can obtain an access token and an associated refresh token. It is valid for 10 minutes counted from its generation. Required when grant_type=authorization_code.\n                  example: 'TG-XXXXXXXX-241983636'\n                redirect_uri:\n                  type: string\n                  description: URL reported in the Redirect URL field of your application. Required only when grant_type=authorization_code.\n                refresh_token:\n                  type: string\n                  description: Value received when the access token is created. Only required when grant_type=refresh_token.\n      responses:\n        '200':\n          description: Success\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  access_token:\n                    type: string\n                    example: 'APP_USR-4934588586838432-XXXXXXXX-241983636'\n                    description: Security code that identifies the user, their privileges and an application used in different requests from public sources to access protected resources. Its validity is determined by the expires_in parameter and is similar to APP_USR-1585551492-030918-25######3458-2880736, which is composed of\n                    enum:\n                      - Access token type -- APP_USR (application on behalf of a user), TEST (test, only valid in sandbox)\n                      - Client ID -- 1585551492\n                      - Creation date (MMddHH) -- 030918\n                      - Security hash -- 25######3458\n                      - User ID -- 2880736\n                  token_type:\n                    type: string\n                    example: 'bearer'\n                    description: necessary information for the token to be used correctly to access protected resources. The token of type \"bearer\" is the only one supported by the authorization server and is used when the access token is included as plain text in the request. It is understood that the bearer has direct access to the token.\n                  expires_in:\n                    type: number\n                    example: 15552000\n                    description: Fixed access_token expiration time expressed in seconds. By default, the expiration time is 180 days (15552000 seconds).\n                  scope:\n                    type: string\n                    example: 'offline_access read write'\n                    description: Scopes are used in the API authorization and consent process and allow you to determine what access the application requests and what access the user grants. By default, the scopes associated with the token are the ones determined when creating the original token and configuring the application.\n                  user_id:\n                    type: number\n                    example: 241983636\n                    description: Identification number (Mercado Pago ID) generated automatically when creating a Mercado Pago account. It is a unique number that identifies the Mercado Pago seller and is the owner of the application.\n                  refresh_token:\n                    type: string\n                    example: 'TG-XXXXXXXX-241983636'\n                    description: temporal grants code used to obtain access tokens so that authorization and access to resources remain valid before the end of the access token's validity period. They define an ID used to retrieve authorization information. Unlike access tokens, refresh tokens can only be used for calls on the authorization server and are never sent to resource servers.\n                  public_key:\n                    type: string\n                    example: 'APP_USR-d0a26210-XXXXXXXX-479f0400869e'\n                    description: Public key of the application that will normally be used in the frontend and will allow, for example, knowing the means of payment and encrypting the card data. One of the keys in the pair that make up the credentials that identify an application/integration in your account.\n                  live_mode: \n                    type: boolean\n                    example: true\n                    description: Indicates whether the application is in production or test mode.\n        '400':\n          description: Error\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  message:\n                    type: string\n                    example: 'Error validating grant. Your authorization code or refresh token may be expired or it was already used.'\n                  status:\n                    type: number\n                    example: 400\n                  errorKey:\n                    type: string\n                    example: 'expired_grant'\n                    enum:\n                      - invalid_client -- The provided client_id and/or client_secret of your app is invalid.\n                      - invalid_grant -- There are several reasons for this error, it could be because the authorization_code or refresh_token is invalid, expired or revoked, was sent in an incorrect flow, belongs to another client, or the redirect_uri used in the authorization flow does not match what your application has configured.\n                      - invalid_scope -- The requested scope is invalid, unknown, or wrongly formed. The allowed values for the scope parameter are “offline_access”, ”write”, ”read”.\n                      - invalid_request -- The request does not include a required parameter, includes an unsupported parameter or parameter value, has a duplicated value, or is otherwise malformed.\n                      - unsupported_grant_type -- Allowed values for grant_type are “authorization_code” or “refresh_token”.\n                      - forbidden -- The call does not authorize access, possibly another user's token is being used.\n                      - unauthorized_client -- The application does not have a grant with the user or the permissions (scopes) that the application has with this user do not allow creating a token.\n                  cause:\n                    type: array\n                    items:\n                      type: string\n                    example: []\n  \n"
		}
	},
	"Error": "unmarshal: callback: json: cannot unmarshal bool into Go struct field Schema.required of type []string"
}