{
	"File": {
		"__typename": "FileMatch",
		"repository": {
			"name": "github.com/mercadopago/devsite-docs"
		},
		"file": {
			"name": "subscriptions.yaml",
			"size": 0,
			"path": "reference/api/subscriptions.yaml",
			"byteSize": 290885,
			"content": "openapi: 3.0.0\nservers:\n  - url: https://api.mercadopago.com\ninfo:\n  title: Mercado Pago API Reference\n  version: '1.0'\npaths:\n  /preapproval:\n    post:\n      tags:\n        - $ref: \"#/tags/subscriptions\"\n      summary: Create a subscription\n      x-summary-i18n:\n        eng: Create a subscription\n        spa: Crear suscripción\n        por: Criar assinatura\n      description: A subscription is the union between a plan and a customer. The main characteristic of this contract is that it has a configured a payment method and is the basis for creating the invoices. You can also create a subscription without a plan\n      x-description-i18n:\n        eng: A subscription is the union between a plan and a customer. The main characteristic of this contract is that it has a configured a payment method and is the basis for creating the invoices. You can also create a subscription without a plan\n        spa: Una suscripción es la unión entre un plan y un cliente. La principal característica de este contrato es que tiene configurada una forma de pago y es la base para la creación de las facturas. También puedes crear una suscripción sin un plan\n        por: Uma assinatura é a união entre um plano e um cliente. Sua característica principal é ter um meio de pagamento configurado que servirá como base para criar faturas. Também é possível criar assinaturas sem plano\n      requestBody:\n        content:\n          application/json:\n            schema:\n              type: object\n              properties:\n                preapproval_plan_id:\n                  type: string\n                  description: Unique subscription plan identifier. This is an optional field. Our model supports creating subscriptions with or without a plan. If you create a subscription with plan we will take the recurring settings from the plan to create the subscription. When you edit the plan we will update the subscriptions. Decide your best model depending on your business.\n                  x-description-i18n:\n                    eng: Unique subscription plan identifier. This is an optional field. Our model supports creating subscriptions with or without a plan. If you create a subscription with plan we will take the recurring settings from the plan to create the subscription. When you edit the plan we will update the subscriptions. Decide your best model depending on your business.\n                    spa: Identificador único del plan de suscripción. Este campo es opcional. Nuestro modelo soporta la creación de suscripciones con o sin plan asociado. Si creas una suscripción con un plan, tomaremos la configuración recurrente del plan para crear la suscripción. Cuando edites el plan, actualizaremos las suscripciones. Decide tu mejor modelo en función de tu negocio.\n                    por: Identificador único do plano de assinatura. Este é um campo opcional. Nosso modelo suporta a criação de assinaturas com ou sem plano associado. Se você criar uma assinatura com plano, usaremos as configurações recorrentes do plano para criar a assinatura. Quando você editar o plano, atualizaremos as assinaturas. Escolha o melhor modelo dependendo do seu negócio.\n                  example: 2c938084726fca480172750000000000\n                reason:\n                  type: string\n                  description: It is a short description that the subscriber will see during the checkout process and in the notifications. It is only required for subscriptions without a plan.\n                  x-description-i18n:\n                    eng: It is a short description that the subscriber will see during the checkout process and in the notifications. It is only required for subscriptions without a plan.\n                    spa: Es una breve descripción que el suscriptor verá durante el proceso de checkout y en las notificaciones. Solo se requiere para suscripciones sin plan asociado.\n                    por: É uma breve descrição que o assinante verá durante o processo de checkout e nas notificações. É obrigatório apenas para assinaturas sem plano associado.\n                  example: Yoga classes\n                external_reference:\n                  type: string\n                  description: Reference to sync with your system. This is a free text field to help you with your integration to link the entities. It is only required for subscriptions without a plan.\n                  x-description-i18n:\n                    eng: Reference to sync with your system. This is a free text field to help you with your integration to link the entities. It is only required for subscriptions without a plan.\n                    spa: Referencia para sincronizar con tu sistema. Este es un campo de texto libre para ayudarte con tu integración, para vincular las entidades. Solo se requiere para suscripciones sin plan asociado.\n                    por: Referência para sincronizar com seu sistema. Este é um campo de texto livre que ajudará na integração com as entidades. Este campo é obrigatório apenas para assinaturas sem plano associado.\n                  example: YG-1234\n                payer_email:\n                  required: true\n                  type: string\n                  description: To create a subscription it is necessary to link it with an email. Then you will get a unique identifier to identify the subscriber.\n                  x-description-i18n:\n                    eng: To create a subscription it is necessary to link it with an email. Then you will get a unique identifier to identify the subscriber.\n                    spa: Para crear una suscripción es necesario vincularla con un correo electrónico. Luego obtendrás un identificador único para identificar al suscriptor.\n                    por: Para criar uma assinatura, é necessário associá-la a um e-mail. Feito isso, você terá acesso a um identificador único para identificar o assinante.\n                  example: test_user@testuser.com\n                card_token_id:\n                  type: string\n                  description: Unique card token identifier \n                  example: e3ed6f098462036dd2cbabe314b9de2a\n                auto_recurring:\n                  type: object\n                  description: Configuration data for recurrence It is only required for subscriptions without a plan.\n                  x-description-i18n:\n                    eng: Configuration data for recurrence It is only required for subscriptions without a plan.\n                    spa: Datos de configuración para recurrencia. Solo se requiere para suscripciones sin plan asociado.\n                    por: Configuração de recorrência. É obrigatório apenas para assinaturas sem plano associado.\n                  properties:\n                    frequency:\n                      required: true\n                      type: number\n                      description: Indicates the frequency value. Along with frequency_type they define the invoice cycle that a subscription will have.\n                      x-description-i18n:\n                        eng: Indicates the frequency value. Along with frequency_type they define the invoice cycle that a subscription will have.\n                        spa: Indica el valor de la frecuencia. Junto con frequency_type definen el ciclo de facturación que tendrá una suscripción.\n                        por: Indica o valor de frequência. Junto com o frequency_type, define o ciclo de faturamento que uma assinaturá terá.\n                      example: 1\n                    frequency_type:\n                      required: true\n                      type: string\n                      description: Indicates the type of frequency. Along with frequency they define the invoice cycle that a subscription will have.\n                      x-description-i18n:\n                        eng: Indicates the type of frequency. Along with frequency they define the invoice cycle that a subscription will have.\n                        spa: Indica el tipo de frecuencia. Junto con frequency definen el ciclo de facturación que tendrá una suscripción.\n                        por: Indica o valor de frequência. Junto com o frequency, define o ciclo de faturamento que uma assinaturá terá.\n                      example: months\n                      enum:\n                        - days -- Indicate a frequency in units of days\n                        - months -- Indicate a frequency in units of months\n                    start_date:\n                      type: string\n                      format: date\n                      description: Date from which the subscription will be active and we start collecting invoices.\n                      x-description-i18n:\n                        eng: Date from which the subscription will be active and we start collecting invoices.\n                        spa: Fecha a partir de la cual la suscripción estará activa y se empiezan a cobrar las facturas.\n                        por: Data que indica o momento em que a assinatura será ativada e começará a cobrança das faturas.\n                      example: \"2020-06-02T13:07:14.260Z\"\n                    end_date:\n                      type: string\n                      format: date\n                      description: Date until which the subscription will be active and we will stop charging invoices.\n                      x-description-i18n:\n                        eng: Date until which the subscription will be active and we will stop charging invoices.\n                        spa: Fecha hasta la cual la suscripción estará activa y se dejan de cobrar las facturas.\n                        por: Data que indica o fim da assinatura e o momento em que a cobrança não será mais realizada.\n                      example: \"2022-07-20T15:59:52.581Z\"\n                    transaction_amount:\n                      type: number\n                      description: Amount we will charge on each invoice.\n                      x-description-i18n:\n                        eng: Amount we will charge on each invoice.\n                        spa: Suma que se cobrará en cada factura.\n                        por: Valor que será cobrado em cada fatura.\n                      example: 10\n                    currency_id:\n                      required: true\n                      type: string\n                      description: ID of the currency used in the payment.\n                      x-description-i18n:\n                        eng: ID of the currency used in the payment.\n                        spa: Identificador de la moneda utilizada en el pago\n                        por: Identificador da moeda utilizada no pagamento\n                      example: ARS\n                      enum:\n                        - ARS -- Argentine peso.\n                        - BRL -- Brazilian real.\n                        - CLP -- Chilean peso.\n                        - MXN -- Mexican peso.\n                        - COP -- Colombian peso.\n                        - PEN -- Peruvian sol.\n                        - UYU -- Uruguayan peso.\n                back_url:\n                  required: true\n                  type: string\n                  description: Successful return url. Use this setting to redirect your customers  to your site after our checkout. It is only required for subscriptions without a plan.\n                  x-description-i18n:\n                    eng: Successful return url. Use this setting to redirect your customers  to your site after our checkout. It is only required for subscriptions without a plan.\n                    spa: URL de retorno exitosa. Usa esta configuración para redirigir a tus clientes a tu sitio después de nuestro checkout. Solo se requiere para suscripciones sin plan asociado.\n                    por: URL de retorno de sucesso. Use esta configuração para redirecionar o cliente para seu site após o checkout. É obrigatório apenas para assinaturas sem plano associado.\n                  example: https://www.mercadopago.com.ar\n                status:\n                  type: string\n                  description: When you create a subscription, you can make it pending or authorized. Authorized status requires you to indicate a payment method. A pending subscription is waiting for a payment method, that the customer can load into our checkout or by your integration tokenizing a card and adding it to the subscription.\n                  x-description-i18n:\n                    eng: When you create a subscription, you can make it pending or authorized. Authorized status requires you to indicate a payment method. A pending subscription is waiting for a payment method, that the customer can load into our checkout or by your integration tokenizing a card and adding it to the subscription.\n                    spa: Cuando creas una suscripción, puedes dejarla pending o authorized. El estado authorized requiere que indiques un método de pago. Una suscripción pending está esperando un método de pago, que el cliente puede cargar en nuestro checkout o mediante tu integración tokenizando una tarjeta y agregándola a la suscripción.\n                    por: Quando você cria uma assinatura, pode fazê-la com pagamento pending ou authorized. Status Authorized requer que você indique um meio de pagamento. Uma assinatura com pagamento pending fica aguardando por um meio de pagamento, até que o cliente acesse o checkout ou através da integtração tokenizando um cartão e adicionando-o à assinatura.\n                  example: authorized\n                  enum:\n                    - pending -- Subscription without a payment method\n                    - authorized -- Subscription with a payment method\n      responses:\n        '200':\n          description: Success\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  id:\n                    type: string\n                    example: 2c938084726fca480172750000000000\n                    description: Unique subscription identifier.\n                    x-description-i18n:\n                      eng: Unique subscription identifier.\n                      spa: Identificador único de suscripción.\n                      por: Identificador único de assinatura\n                  version:\n                    type: number\n                    example: 0\n                    description: How many times the subscription was modified.\n                    x-description-i18n:\n                      eng: How many times the subscription was modified.\n                      spa: Cantidad de veces que esta suscripción fue modificada.\n                      por: Quantas vezes a assinatura foi modificada\n                  application_id:\n                    type: number\n                    example: 1234567812345678\n                    description: Unique ID that identifies your application/integration. One of the keys in the pair that make up the credentials that identify an application/integration in your account.\n                    x-description-i18n:\n                      eng: Unique ID that identifies your application/integration. One of the keys in the pair that make up the credentials that identify an application/integration in your account.\n                      spa: ID único que identifica tu aplicación/integración. Una de las claves del par que componen las credenciales que identifican una aplicación/integración en tu cuenta.\n                      por: ID único que identifica sua aplicação/integração. Uma das chaves do par que compõe as credenciais que identifica uma aplicação/integração na sua conta.\n                  collector_id:\n                    type: number\n                    example: 100200300\n                    description: Unique ID that identifies your user as a seller. This ID matches your User ID in our ecosystem.\n                    x-description-i18n:\n                      eng: Unique ID that identifies your user as a seller. This ID matches your User ID in our ecosystem.\n                      spa: ID único que identifica a tu usuario como vendedor. Este ID coincide con tu User ID en nuestro ecosistema.\n                      por: ID único que identifica seu usuário como vendedor. Este ID corresponde ao seu User ID em nosso ecossistema. \n                  preapproval_plan_id:\n                    type: string\n                    description: Unique plan identifier.\n                    x-description-i18n:\n                      eng: Unique plan identifier.\n                      spa: Identificador único del plan.\n                      por: Identificador único do plano.\n                    example: 2c938084726fca480172750000000000\n                  reason:\n                    type: string\n                    example: Yoga classes.\n                    description: It is a short description that the subscriber will see during the checkout process and in the notifications. It is only required for subscriptions without a plan.\n                    x-description-i18n:\n                      eng: It is a short description that the subscriber will see during the checkout process and in the notifications. It is only required for subscriptions without a plan.\n                      spa: Es una breve descripción que el suscriptor verá durante el proceso de checkout y en las notificaciones. Solo se requiere para suscripciones sin plan asociado.\n                      por: É uma breve descrição que o assinante verá durante o processo de checkout e nas notificações. É obrigatório apenas para assinaturas sem plano associado.\n                  external_reference:\n                    type: string\n                    example: 23546246234\n                    description: Reference to sync with your system. This is a free text field to help you with your integration to link the entities.\n                    x-description-i18n:\n                      eng: Reference to sync with your system. This is a free text field to help you with your integration to link the entities.\n                      spa: Referencia para sincronizar con tu sistema. Este es un campo de texto libre para ayudarte con tu integración para vincular las entidades.\n                      por: Referência para sincronizar com seu sistema. Este é um campo de texto livre para ajudar com a integração para vincular as entidades.\n                  back_url:\n                    type: string\n                    example: https://www.mercadopago.com.ar\n                    description: Successful return URL. Use this setting to redirect your customers to your site after our checkout.\n                    x-description-i18n:\n                      eng: Successful return URL. Use this setting to redirect your customers to your site after our checkout.\n                      spa: URL de retorno exitosa. Use esta configuración para redirigir a tus clientes a su sitio después de nuestro checkout.\n                      por: URL de retorno de sucesso. Use esta configuração para redirecionar seus clientes para o seu site após o checkout.\n                  init_point:\n                    type: string\n                    example: https://www.mercadopago.com.ar/subscriptions/checkout?preapproval_id=2c938084726fca480172750000000000\n                    description: URL to checkout to add or modify payment method.\n                    x-description-i18n:\n                      eng: URL to checkout to add or modify payment method.\n                      spa: URL al checkout para agregar o modificar el método de pago.\n                      por: URL para o checkout para adicionar ou modificar um meio de pagamento.\n                  auto_recurring:\n                    type: object\n                    description: Configuration data for recurrence.\n                    x-description-i18n:\n                      eng: Configuration data for recurrence.\n                      spa: Información de configuración para la recurrencia.\n                      por: Configuração da data para recorrência.\n                    properties:\n                      frequency:\n                        type: number\n                        description: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                        x-description-i18n:\n                          eng: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                          spa: Indica el valor de la frecuencia. Junto con frequency_type definen el ciclo de facturación que tendrá una suscripción.\n                          por: Indica o valor de frequência. Junto com frequency_type define o ciclo de cobrança que a assinaturá terá.\n                        example: 1\n                      frequency_type:\n                        type: string\n                        description: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                        x-description-i18n:\n                          eng: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                          spa: Indica el tipo de frecuencia. Junto con frequency definen el ciclo de facturación que tendrá una suscripción.\n                          por: Indica o tipo de frequência. Junto com frequency, definem o ciclo de cobrança que a assinatura terá.\n                        example: months\n                        enum:\n                          - days -- Indicate a frequency in units of days\n                          - months -- Indicate a frequency in units of months\n                      start_date:\n                        type: string\n                        format: date\n                        description: Date from which the subscription will be active and we start collecting invoices.\n                        x-description-i18n:\n                          eng: Date from which the subscription will be active and we start collecting invoices.\n                          spa: Fecha a partir de la cual la suscripción estará activa y se empiezan a cobrar las facturas.\n                          por: Data que indica o momento em que a assinatura será ativada e começará a cobrança das faturas.\n                        example: \"2020-06-02T13:07:14.260Z\"\n                      end_date:\n                        type: string\n                        format: date\n                        description: Date until which the subscription will be active and we will stop charging invoices.\n                        x-description-i18n:\n                          eng: Date until which the subscription will be active and we will stop charging invoices.\n                          spa: Fecha hasta la cual la suscripción estará activa y se dejan de cobrar las facturas.\n                          por: Data que indica o fim da assinatura e o momento em que a cobrança não será mais realizada.\n                        example: \"2022-07-20T15:59:52.581Z\"\n                      currency_id:\n                        type: string\n                        description: ID of the currency used in the payment.\n                        x-description-i18n:\n                          eng: ID of the currency used in the payment.\n                          spa: Identificador de la moneda utilizada en el pago\n                          por: Identificador da moeda utilizada no pagamento\n                        example: ARS\n                        enum:\n                          - ARS -- Argentine peso.\n                          - BRL -- Brazilian real.\n                          - CLP -- Chilean peso.\n                          - MXN -- Mexican peso.\n                          - COP -- Colombian peso.\n                          - PEN -- Peruvian sol.\n                          - UYU -- Uruguayan peso.\n                      transaction_amount:\n                        type: number\n                        description: Amount we will charge on each invoice.\n                        x-description-i18n:\n                          eng: Amount we will charge on each invoice.\n                          spa: Suma que se cobrará en cada factura.\n                          por: Valor que será cobrado em cada fatura.\n                        example: 10\n                      free_trial:\n                        type: object\n                        description: Free trial data.\n                        x-description-i18n:\n                          eng: Free trial data.\n                          spa: Información sobre prueba gratuita.\n                          por: Informação de teste grátis\n                        properties:\n                          frequency:\n                            type: number\n                            description: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                            x-description-i18n:\n                              eng: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                              spa: Indica el valor de la frecuencia. Junto con frequency_type definen el ciclo de facturación que tendrá una suscripción.\n                              por: Indica o valor de frequência. Junto com frequency_type define o ciclo de cobrança que a assinaturá terá.\n                            example: 1\n                          frequency_type:\n                            type: string\n                            description: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                            x-description-i18n:\n                              eng: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                              spa: Indica el tipo de frecuencia. Junto con frequency definen el ciclo de facturación que tendrá una suscripción.\n                              por: Indica o tipo de frequência. Junto com frequency, definem o ciclo de cobrança que a assinatura terá.\n                            example: months\n                            enum:\n                              - days -- Indicate a frequency in units of days\n                              - months -- Indicate a frequency in units of months\n                  payer_id:\n                    type: number\n                    example: 123123123\n                    description: Unique customer identifier. This is created from the email you used to create the subscription.\n                    x-description-i18n:\n                      eng: Unique customer identifier. This is created from the email you used to create the subscription.\n                      spa: Identificador único de cliente. Se crea a partir del correo electrónico que utilizaste para crear la suscripción.\n                      por: Identificador único do cliente. É criado a partir do e-mail utilizado para criar a assinatura.\n                  card_id:\n                    type: number\n                    example: 123123123\n                    description: Unique identifier to retrieve data from the card used as a payment method.\n                    x-description-i18n:\n                      eng: Unique identifier to retrieve data from the card used as a payment method.\n                      spa: Identificador único para recuperar datos de la tarjeta utilizada como medio de pago.\n                      por: Identificador único para recuperar dados do cartão utilizado como meio de pagamento.\n                  payment_method_id:\n                    type: number\n                    example: 123123123\n                    description: Payment method configured.\n                    x-description-i18n:\n                      eng: Payment method configured.\n                      spa: Método de pago configurado.\n                      por: Meio de pagamento configurado.\n                  next_payment_date:\n                    type: string\n                    example: \"2022-01-01T11:12:25.892-04:00\"\n                    description: Date of the next payment debit.\n                    x-description-i18n:\n                      eng: Date of the next payment debit.\n                      spa: Fecha del próximo débito.\n                      por: Data do próximo débito.\n                  date_created:\n                    type: string\n                    example: \"2022-01-01T11:12:25.892-04:00\"\n                    description: Creation date\n                    x-description-i18n:\n                      eng: Creation date\n                      spa: Fecha de creación\n                      por: Data de criação\n                  last_modified:\n                    type: string\n                    example: \"2022-01-01T11:12:25.892-04:00\"\n                    description: Date of last modification\n                    x-description-i18n:\n                      eng: Date of last modification\n                      spa: Fecha de última modificación.\n                      por: Data da última modificação.\n                  status:\n                    type: string\n                    example: pending\n                    description: Status\n                    enum:\n                      - pending -- Subscription without a payment method\n                      - authorized -- Subscription with a payment method\n        '400':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 400--Bad-Request--Subscriptions are not available for this country yet\n                      - 400--Bad-Request--The payment method account money is not available in your country\n                      - 400--Bad-Request--Collector and Application cannot be from different countries\n                      - 400--Bad-Request--Field card_token_id is required\n                      - 400--Bad-Request--Field payer_email is required\n                      - 400--Bad-Request--Invalid value for payer_email, must be a valid email address\n                      - 400--Bad-Request--Invalid value for transaction amount, must be a positive number\n                      - 400--Bad-Request--Invalid value for transaction amount, only two decimals are allowed\n                      - 400--Bad-Request--Invalid value for auto_recurring.currency_id\n                      - 400--Bad-Request--Invalid value for auto_recurring.end_date, the date must be after today\n                      - 400--Bad-Request--Invalid value for auto_recurring.frequency, must be a positive integer\n                      - 400--Bad-Request--Invalid value for auto_recurring.frequency_type, valid ones are days, months\n                      - 400--Bad-Request--Invalid value for auto_recurring.start_date, the date must be after today\n                      - 400--Bad-Request--Invalid format in auto_recurring.start_date or auto_recurring.end_date\n                      - 400--Bad-Request--Invalid value for back_url, must be a valid URL\n                      - 400--Bad-Request--Field reason has more than 255 characters\n                      - 400--Bad-Request--Field reason has unsupported characters\n                      - 400--Bad-Request--Field auto_recurring.frequency is required\n                      - 400--Bad-Request--Field auto_recurring.frequency_type is required\n                      - 400--Bad-Request--Field auto_recurring.transaction_amount is required\n                      - 400--Bad-Request--Field auto_recurring.currency_id is required\n                      - 400--Bad-Request--Field auto_recurring.end_date must be after auto_recurring.start_date\n                      - 400--Bad-Request--Field external_reference has more than 255 characters\n                      - 400--Bad-Request--Field external_reference has unsupported characters\n                      - 400--Bad-Request--Already exists a preapproval for user \u003cpayer_email\u003e and application \u003capplication_id\u003e\n                      - 400--Bad-Request--Payer and collector cannot be the same user\n                      - 400--Bad-Request--Both payer and collector must be real or test users\n                      - 400--Bad-Request--This preapproval cannot be created. The seller does not accept account_money\n                      - 400--Bad-Request--This preapproval cannot be created only with payment method account_money\n                      - 400--Bad-Request--Cannot operate between different countries\n                      - 400--Bad-Request--Cannot create preapproval pending, the feature with account money is disabled for your country.\n                      - 400--Bad-Request--Cannot pay an amount lower than min\n                      - 400--Bad-Request--Cannot pay an amount greater than max\n                      - 400--Bad-Request--You cannot create a preapproval with payment_method in status pending\n                      - 400--Bad-Request--You cannot create a new preapproval from a cancelled or inactive template\n                      - 400--Bad-Request--The transaction_amount must be the same as preapproval_plan\n                      - 400--Bad-Request--Card token was used, please generate new\n                      - 400--Bad-Request--Card token was generated without cvv validation\n                      - 400--Bad-Request--Invalid request data\n        '401':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 401--Unauthorized--CC_VAL_433 Credit card validation has failed\n                      - 401--Unauthorized--Verification of collectors personal data is in process, come back later\n                      - 401--Unauthorized--Unauthorized access to resource\n                      - 401--Unauthorized--This app cannot create subscriptions without a plan\n        '403':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 403--Forbidden--The collector does not meet the personal data verification requirements\n                      - 403--Forbidden--The caller is not authorized to access this resource\n                      - 403--Forbidden--Unauthorized seller for this feature AM_VAL_01\n        '500':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 500--Error--Internal server error\n  /preapproval_plan:\n    post:\n      tags:\n        - $ref: \"#/tags/subscriptions\"\n      summary: Create a subscription plan\n      x-summary-i18n:\n        eng: Create a subscription plan\n        spa: Crear un plan de suscripción\n        por: Criar um plano de assinatura\n      description: A plan is a template to create subscriptions thats tell how often and how much to charge your customers. Plans can be created with free trials, biiling cycles and more. The subscriptions created from a plan are related to it and allows synchronizing modifications such as reason or amount\n      x-description-i18n:\n        eng: A plan is a template to create subscriptions thats tell how often and how much to charge your customers. Plans can be created with free trials, biiling cycles and more. The subscriptions created from a plan are related to it and allows synchronizing modifications such as reason or amount\n        spa: Un plan es un template para crear suscripciones que indican con qué frecuencia y cuánto cobrar a tus clientes. Se pueden crear planes con pruebas gratuitas, ciclos de facturación y más. Las suscripciones creadas a partir de un plan están relacionadas con el mismo y permiten sincronizar modificaciones como reason o amount\n        por: Um plano é um template para criar assinaturas que informa a frequência e valor que deverão ser cobrados dos seus clientes. Planos podem ser criados com testes grátis, ciclos de cobrança, entre outros. As assinaturas criadas a partir de um plano são relacioadas a ele e permitem sincronizar informações como reason e amount\n      requestBody:\n        content:\n          application/json:\n            schema:\n              type: object\n              properties:\n                reason:\n                  required: true\n                  type: string\n                  description: It is a short description that the subscriber will see during the checkout process and in the notifications.\n                  x-description-i18n:\n                    eng: It is a short description that the subscriber will see during the checkout process and in the notifications.\n                    spa: Es una breve descripción que el suscriptor verá durante el checkout y en las notificaciones.\n                    por: É uma breve descrição que o assinante verá durante o processo de checkout e nas notificações.\n                  example: Yoga classes\n                auto_recurring:\n                  type: object\n                  description: Configuration data for recurrence.\n                  x-description-i18n:\n                    eng: Configuration data for recurrence.\n                    spa: Información de configuración para la recurrencia.\n                    por: Configuração da data para recorrência.\n                  properties:\n                    frequency:\n                      required: true\n                      type: number\n                      description: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                      x-description-i18n:\n                        eng: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                        spa: Indica el valor de la frecuencia. Junto con frequency_type definen el ciclo de facturación que tendrá una suscripción.\n                        por: Indica o valor de frequência. Junto com frequency_type define o ciclo de cobrança que a assinaturá terá.\n                      example: 1\n                    frequency_type:\n                      required: true\n                      type: string\n                      description: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                      x-description-i18n:\n                        eng: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                        spa: Indica el tipo de frecuencia. Junto con frequency definen el ciclo de facturación que tendrá una suscripción.\n                        por: Indica o tipo de frequência. Junto com frequency, definem o ciclo de cobrança que a assinatura terá.\n                      example: months\n                      enum:\n                        - days -- Indicate a frequency in units of days\n                        - months -- Indicate a frequency in units of months\n                    repetitions:\n                      type: number\n                      description: It is optional and is used to create a limited subscription. Indicates the number of times that we will repeat the recurrence cycle. If this param is not defined, subscription does not end until some of the parties cancel it.\n                      x-description-i18n:\n                        eng: It is optional and is used to create a limited subscription. Indicates the number of times that we will repeat the recurrence cycle. If this param is not defined, subscription does not end until some of the parties cancel it.\n                        spa: Es opcional y se utiliza para crear una suscripción limitada. Indica el número de veces que repetiremos el ciclo de recurrencia. Si no se define este param, la suscripción no finaliza hasta que alguna de las partes la cancela.\n                        por: É opcional e utilizado para criar uma assinatura limitada. Indica o número de itens que serão repetidos no ciclo de recorrência. Se este parâmetro não for definido, a assinatura não será finaliza até que uma das partes cancele.\n                      example: 12\n                    billing_day:\n                      type: number\n                      description: Day of the month that the subscription will always be charged. It only accepts values between 1 and 28. This setting is only available for subscriptions with a plan associated.\n                      x-description-i18n:\n                        eng: Day of the month that the subscription will always be charged. It only accepts values between 1 and 28. This setting is only available for subscriptions with a plan associated.\n                        spa: Día del mes en que se cobrará la suscripción. Solo acepta valores entre 1 y 28. Esta configuración solo está disponible para suscripciones con un plan asociado.\n                        por: Dia do mês que a assinatura será comprada. Apenas aceita valores entre 1 e 28. Esta configuração está disponível somente para assinaturas com plano associado.\n                      example: 10\n                    billing_day_proportional:\n                      type: boolean\n                      description: Charge a proportional amount to the billing day at the time of registration.\n                      x-description-i18n:\n                        eng: Charge a proportional amount to the billing day at the time of registration.\n                        spa: Cobra una suma proporcional al día de facturación en el momento del registro.\n                        por: Cobra um valor proporcional ao dia do faturamento no momento do cadastro.\n                      example: true\n                      enum:\n                        - true -- Charge a proportional amount based on the days remaining in the next billing cycle. Billing cycles are always calculated on a 30-day basis.\n                        - false -- Charge the amount of the subscription regardless of when in the billing cycle customer subscribe.\n                    free_trial:\n                      type: object\n                      description: Free trial data.\n                      x-description-i18n:\n                        eng: Free trial data.\n                        spa: Información sobre prueba gratuita.\n                        por: Informação de teste grátis\n                      properties:\n                        frequency:\n                          type: number\n                          description: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                          x-description-i18n:\n                            eng: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                            spa: Indica el valor de la frecuencia. Junto con frequency_type definen el ciclo de facturación que tendrá una suscripción.\n                            por: Indica o valor de frequência. Junto com frequency_type define o ciclo de cobrança que a assinaturá terá.\n                          example: 1\n                        frequency_type:\n                          type: string\n                          description: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                          x-description-i18n:\n                            eng: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                            spa: Indica el tipo de frecuencia. Junto con frequency definen el ciclo de facturación que tendrá una suscripción.\n                            por: Indica o tipo de frequência. Junto com frequency, definem o ciclo de cobrança que a assinatura terá.\n                          example: months\n                          enum:\n                            - days -- Indicate a frequency in units of days\n                            - months -- Indicate a frequency in units of months\n                    transaction_amount:\n                      type: number\n                      description: Amount that will be charged on each invoice.\n                      x-description-i18n:\n                        eng: Amount that will be charged on each invoice.\n                        spa: Importe que se cobrará en cada factura.\n                        por: Valor que será cobrado em cada fatura.\n                      example: 10\n                    currency_id:\n                      required: true\n                      type: string\n                      description: ID of the currency used in the payment.\n                      x-description-i18n:\n                        eng: ID of the currency used in the payment.\n                        spa: Identificador de la moneda utilizada en el pago\n                        por: Identificador da moeda utilizada no pagamento\n                      example: ARS\n                      enum:\n                        - ARS -- Argentine peso.\n                        - BRL -- Brazilian real.\n                        - CLP -- Chilean peso.\n                        - MXN -- Mexican peso.\n                        - COP -- Colombian peso.\n                        - PEN -- Peruvian sol.\n                        - UYU -- Uruguayan peso.\n                payment_methods_allowed:\n                  type: object\n                  description: Payment methods enabled at checkout.\n                  x-description-i18n:\n                    eng: Payment methods enabled at checkout.\n                    spa: Métodos de pago habilitados en el checkout.\n                    por: Meios de pagamento habilitados no checkout.\n                  properties:\n                    payment_types:\n                      type: array\n                      description: Payment types allowed in the payment flow.\n                      x-description-i18n:\n                        eng: Payment types allowed in the payment flow.\n                        spa: Tipos de pago permitidos en el flujo de pago.\n                        por: Tipos de pagamento permitidos no fluxo de pagamento.\n                      properties:\n                        id:\n                          type: string\n                          description: Payment type identifier.\n                          x-description-i18n:\n                            eng: Payment type identifier.\n                            spa: Identificador de tipo de pago.\n                            por: Identificador do tipo de pagamento.\n                          example: credit_card\n                    payment_methods:\n                      type: array\n                      description: Payment methods allowed in the payment flow.\n                      x-description-i18n:\n                        eng: Payment methods allowed in the payment flow.\n                        spa: Métodos de pago permitidos en el flujo de pago.\n                        por: Meios de pagamento permitidos no fluxo de pagamento.\n                      properties:\n                        id:\n                          type: string\n                          description: Payment method identifier.\n                          x-description-i18n:\n                            eng: Payment method identifier.\n                            spa: Identificador del medio de pago\n                            por: Id do meio de pagamento\n                          example: bolbradesco\n                back_url:\n                  required: true\n                  type: string\n                  description: Successful return URL. Use this setting to redirect your customers to your site after our checkout.\n                  x-description-i18n:\n                    eng: Successful return URL. Use this setting to redirect your customers to your site after our checkout.\n                    spa: URL de retorno exitosa. Use esta configuración para redirigir a tus clientes a su sitio después de nuestro checkout.\n                    por: URL de retorno de sucesso. Use esta configuração para redirecionar seus clientes para o seu site após o checkout.\n                  example: https://www.yoursite.com\n      responses:\n        '200':\n          description: Success\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  id:\n                    type: string\n                    example: 2c938084726fca480172750000000000\n                    description: Unique subscription plan identifier.\n                    x-description-i18n:\n                      eng: Unique subscription plan identifier.\n                      spa: Identificador único del plan de suscripción.\n                      por: Identificador único do plano de assinatura\n                  application_id:\n                    type: number\n                    example: 1234567812345678\n                    description: Unique ID that identifies your application/integration. One of the keys in the pair that make up the credentials that identify an application/integration in your account.\n                    x-description-i18n:\n                      eng: Unique ID that identifies your application/integration. One of the keys in the pair that make up the credentials that identify an application/integration in your account.\n                      spa: ID único que identifica tu aplicación/integración. Una de las claves del par que componen las credenciales que identifican una aplicación/integración en tu cuenta.\n                      por: ID único que identifica sua aplicação/integração. Uma das chaves do par que compõe as credenciais que identifica uma aplicação/integração na sua conta.\n                  collector_id:\n                    type: number\n                    example: 100200300\n                    description: Unique ID that identifies your user as a seller. This ID matches your User ID in our ecosystem.\n                    x-description-i18n:\n                      eng: Unique ID that identifies your user as a seller. This ID matches your User ID in our ecosystem.\n                      spa: ID único que identifica a tu usuario como vendedor. Este ID coincide con tu User ID en nuestro ecosistema.\n                      por: ID único que identifica seu usuário como vendedor. Este ID corresponde ao seu User ID em nosso ecossistema. \n                  reason:\n                    type: string\n                    description: It is a short description that the subscriber will see during the checkout process and in the notifications.\n                    x-description-i18n:\n                      eng: It is a short description that the subscriber will see during the checkout process and in the notifications.\n                      spa: Es una breve descripción que el suscriptor verá durante el checkout y en las notificaciones.\n                      por: É uma breve descrição que o assinante verá durante o processo de checkout e nas notificações.\n                    example: Yoga classes\n                  auto_recurring:\n                    type: object\n                    description: Configuration data for recurrence.\n                    x-description-i18n:\n                      eng: Configuration data for recurrence.\n                      spa: Información de configuración para la recurrencia.\n                      por: Configuração da data para recorrência.\n                    properties:\n                      frequency:\n                        type: number\n                        description: Indicates the frequency value. Along with frequency_type they define the invoice cycle that a subscription will have.\n                        x-description-i18n:\n                          eng: Indicates the frequency value. Along with frequency_type they define the invoice cycle that a subscription will have.\n                          spa: Indica el valor de la frecuencia. Junto con frequency_type definen el ciclo de facturación que tendrá una suscripción.\n                          por: Indica o valor de frequência. Junto com o frequency_type, define o ciclo de faturamento que uma assinaturá terá.\n                        example: 1\n                      frequency_type:\n                        type: string\n                        description: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                        x-description-i18n:\n                          eng: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                          spa: Indica el tipo de frecuencia. Junto con frequency definen el ciclo de facturación que tendrá una suscripción.\n                          por: Indica o tipo de frequência. Junto com frequency, definem o ciclo de cobrança que a assinatura terá.\n                        example: months\n                        enum:\n                          - days -- Indicate a frequency in units of days\n                          - months -- Indicate a frequency in units of months\n                      repetitions:\n                        type: number\n                        description: It is optional and is used to create a limited subscription. Indicates the number of times that we will repeat the recurrence cycle. If this param is not defined, subscription does not end until some of the parties cancel it.\n                        x-description-i18n:\n                          eng: It is optional and is used to create a limited subscription. Indicates the number of times that we will repeat the recurrence cycle. If this param is not defined, subscription does not end until some of the parties cancel it.\n                          spa: Es opcional y se utiliza para crear una suscripción limitada. Indica el número de veces que repetiremos el ciclo de recurrencia. Si no se define este param, la suscripción no finaliza hasta que alguna de las partes la cancela.\n                          por: É opcional e utilizado para criar uma assinatura limitada. Indica o número de itens que serão repetidos no ciclo de recorrência. Se este parâmetro não for definido, a assinatura não será finaliza até que uma das partes cancele.\n                        example: 12\n                      billing_day:\n                        type: number\n                        description: Day of the month that the subscription will always be charged. It only accepts values between 1 and 28.\n                        x-description-i18n:\n                          eng: Day of the month that the subscription will always be charged. It only accepts values between 1 and 28.\n                          spa: Día del mes en que siempre se cobrará la suscripción. Solo acepta valores entre 1 y 28.\n                          por: Dia do mês no qual a assinatura será cobrada. Aceita apenas valores entre 1 e 28.\n                        example: 10\n                      billing_day_proportional:\n                        type: boolean\n                        description: Charge a proportional amount to the billing day at the time of registration.\n                        x-description-i18n:\n                          eng: Charge a proportional amount to the billing day at the time of registration.\n                          spa: Cobra una suma proporcional al día de facturación en el momento del registro.\n                          por: Cobra um valor proporcional ao dia do faturamento no momento do cadastro.\n                        example: true\n                        enum:\n                          - true -- Charge a proportional amount based on the days remaining in the next billing cycle. Billing cycles are always calculated on a 30-day basis.\n                          - false -- Charge the amount of the subscription regardless of when in the billing cycle customer subscribe.\n                      free_trial:\n                        type: object\n                        description: Free trial data.\n                        x-description-i18n:\n                          eng: Free trial data.\n                          spa: Información sobre prueba gratuita.\n                          por: Informação de teste grátis\n                        properties:\n                          frequency:\n                            type: number\n                            description: Indicates the frequency value. Along with frequency_type they define the invoice cycle that a subscription will have.\n                            x-description-i18n:\n                              eng: Indicates the frequency value. Along with frequency_type they define the invoice cycle that a subscription will have.\n                              spa: Indica el valor de la frecuencia. Junto con frequency_type definen el ciclo de facturación que tendrá una suscripción.\n                              por: Indica o valor de frequência. Junto com o frequency_type, define o ciclo de faturamento que uma assinaturá terá.\n                            example: 1\n                          frequency_type:\n                            type: string\n                            description: Indicates the type of frequency. Along with frequency they define the invoice cycle that a subscription will have.\n                            x-description-i18n:\n                              eng: Indicates the type of frequency. Along with frequency they define the invoice cycle that a subscription will have.\n                              spa: Indica el tipo de frecuencia. Junto con frequency definen el ciclo de facturación que tendrá una suscripción.\n                              por: Indica o valor de frequência. Junto com o frequency, define o ciclo de faturamento que uma assinaturá terá.\n                            example: months\n                            enum:\n                              - days -- Indicate a frequency in units of days\n                              - months -- Indicate a frequency in units of months\n                      transaction_amount:\n                        type: number\n                        description: Amount that will be charged on each invoice.\n                        x-description-i18n:\n                          eng: Amount that will be charged on each invoice.\n                          spa: Importe que se cobrará en cada factura.\n                          por: Valor que será cobrado em cada fatura.\n                        example: 10\n                      currency_id:\n                        type: string\n                        description: ID of the currency used in the payment.\n                        x-description-i18n:\n                          eng: ID of the currency used in the payment.\n                          spa: Identificador de la moneda utilizada en el pago\n                          por: Identificador da moeda utilizada no pagamento\n                        enum:\n                          - ARS -- Argentine peso.\n                          - BRL -- Brazilian real.\n                          - CLP -- Chilean peso.\n                          - MXN -- Mexican peso.\n                          - COP -- Colombian peso.\n                          - PEN -- Peruvian sol.\n                          - UYU -- Uruguayan peso.\n                        example: ARS\n                  payment_methods_allowed:\n                    type: object\n                    description: Payment methods enabled at checkout.\n                    x-description-i18n:\n                      eng: Payment methods enabled at checkout.\n                      spa: Métodos de pago habilitados en el checkout.\n                      por: Meios de pagamento habilitados no checkout.\n                    properties:\n                      payment_types:\n                        type: array\n                        description: Payment types allowed in the payment flow.\n                        x-description-i18n:\n                          eng: Payment types allowed in the payment flow.\n                          spa: Tipos de pago permitidos en el flujo de pago.\n                          por: Tipos de pagamento permitidos no fluxo de pagamento.\n                        properties:\n                          id:\n                            type: string\n                            description: Payment type identifier.\n                            x-description-i18n:\n                              eng: Payment type identifier.\n                              spa: Identificador de tipo de pago.\n                              por: Identificador do tipo de pagamento.\n                            example: credit_card\n                      payment_methods:\n                        type: array\n                        description: Payment methods allowed in the payment flow.\n                        x-description-i18n:\n                          eng: Payment methods allowed in the payment flow.\n                          spa: Métodos de pago permitidos en el flujo de pago.\n                          por: Meios de pagamento permitidos no fluxo de pagamento.\n                        properties:\n                          id:\n                            type: string\n                            description: Payment method identifier.\n                            x-description-i18n:\n                              eng: Payment method identifier.\n                              spa: Identificador del medio de pago\n                              por: Id do meio de pagamento\n                            example: bolbradesco\n                    back_url:\n                      type: string\n                      description: Successful return URL. Use this setting to redirect your customers to your site after our checkout.\n                      x-description-i18n:\n                        eng: Successful return URL. Use this setting to redirect your customers to your site after our checkout.\n                        spa: URL de retorno exitosa. Use esta configuración para redirigir a tus clientes a su sitio después de nuestro checkout.\n                        por: URL de retorno de sucesso. Use esta configuração para redirecionar seus clientes para o seu site após o checkout.\n                      example: https://www.mercadopago.com.ar\n                  back_url:\n                    type: string\n                    description: Successful return URL. Use this setting to redirect your customers to your site after our checkout.\n                    x-description-i18n:\n                      eng: Successful return URL. Use this setting to redirect your customers to your site after our checkout.\n                      spa: URL de retorno exitosa. Use esta configuración para redirigir a tus clientes a su sitio después de nuestro checkout.\n                      por: URL de retorno de sucesso. Use esta configuração para redirecionar seus clientes para o seu site após o checkout.\n                    example: https://www.mercadopago.com.ar\n                  external_reference:\n                    type: string\n                    example: 23546246234\n                    description: Reference to sync with your system. This is a free text field to help you with your integration to link the entities.\n                    x-description-i18n:\n                      eng: Reference to sync with your system. This is a free text field to help you with your integration to link the entities.\n                      spa: Referencia para sincronizar con tu sistema. Este es un campo de texto libre para ayudarte con tu integración para vincular las entidades.\n                      por: Referência para sincronizar com seu sistema. Este é um campo de texto livre para ajudar com a integração para vincular as entidades.\n                  init_point:\n                    type: string\n                    example: https://www.mercadopago.com.ar/subscriptions/checkout?preapproval_plan_id=2c938084726fca480172750000000000\n                    description: Url to checkout to add payment method\n                    x-description-i18n:\n                      eng: Url to checkout to add payment method\n                      spa: URL al checkout para agregar el método de pago\n                      por: URL de checkout para adicionar um meio de pagamento\n                  date_created:\n                    type: string\n                    example: 2022-01-01T11:12:25.892-04:00\n                    description: Creation date\n                    x-description-i18n:\n                      eng: Creation date\n                      spa: Fecha de creación\n                      por: Data de criação\n                  last_modified:\n                    type: string\n                    example: 2022-01-01T11:12:25.892-04:00\n                    description: Date of last modification\n                    x-description-i18n:\n                      eng: Date of last modification\n                      spa: Fecha de última modificación.\n                      por: Data da última modificação.\n                  status:\n                    type: string\n                    example: active\n                    description: Status of the plan.\n                    x-description-i18n:\n                      eng: Status of the plan.\n                      spa: Estado del plan.\n                      por: Status do plano.\n                    enum:\n                      - active -- Plan available to create subscriptions\n                      - cancelled -- Plan not available to create subscriptions\n        '400':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 400--Bad-Request--Parameter back_url is required\n                      - 400--Bad-Request--Parameter reason is required\n                      - 400--Bad-Request--Parameter external_reference has unsupported characters\n                      - 400--Bad-Request--Parameter auto_recurring is required\n                      - 400--Bad-Request--Parameters frequency and frequency_type are required in the recurring payments scheme\n                      - 400--Bad-Request--Invalid value for back_url. Must be a valid URL\n                      - 400--Bad-Request--Invalid value for status. Valid ones ar active, inactive, cancelled.\n                      - 400--Bad-Request--Invalid value for transaction_amount, must be a positive number\n                      - 400--Bad-Request--Invalid value for transaction_amount, must be a positive integer\n                      - 400--Bad-Request--Invalid value for transaction_amount, only two decimals are allowed\n                      - 400--Bad-Request--Invalid value for payer_email, must be a valid email address\n                      - 400--Bad-Request--Invalid value for currency_id\n                      - 400--Bad-Request--Invalid value for frequency, must be a positive integer\n                      - 400--Bad-Request--Invalid value for frequency_type\n                      - 400--Bad-Request--Invalid value for frequency_type, valid ones are days or months\n                      - 400--Bad-Request--Invalid value for repetitions, mus be a positive integer\n                      - 400--Bad-Request--Cannot pay an amount greater than max\n                      - 400--Bad-Request--Cannot pay an amount lower than min\n                      - 400--Bad-Request--Cannot operate with this currency_id in this site\n                      - 400--Bad-Request--Cannot operate between diferent countries\n                      - 400--Bad-Request--Field currency_id is required\n                      - 400--Bad-Request--Reason has unsupported characters\n                      - 400--Bad-Request--Plan are not available for this country yet\n        '401':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 401--Unauthorized--Must provide your access_token to proceed\n        '404':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 404--Not-Found--The application id does not exist\n        '500':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 500--Error--Internal server error\n  /preapproval/{id}:\n    get:\n      tags:\n        - $ref: \"#/tags/subscriptions\"\n      summary: Get a subscription\n      x-summary-i18n:\n        eng: Get a subscription\n        spa: Obtener suscripción\n        por: Obter assinatura\n      description: Obtains all the information of a subscription from its ID\n      x-description-i18n:\n        eng: Obtains all the information of a subscription from its ID\n        spa: Obtiene toda la información de una suscripción a partir de su ID\n        por: Obter todas as informações de uma assinatura a partir de seu ID\n      parameters:\n        - name: id\n          in: path\n          description: Subscription identifier\n          x-description-i18n:\n            eng: Subscription identifier\n            spa: Identificador de suscripción\n            por: Identificador de assinatura\n          required: true\n          schema:\n            type: string\n            example: 2c938084726fca480172750000000000\n      responses:\n        '200':\n          description: Success\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  id:\n                    type: string\n                    example: 2c938084726fca480172750000000000\n                    description: Unique subscription identifier.\n                    x-description-i18n:\n                      eng: Unique subscription identifier.\n                      spa: Identificador único de suscripción.\n                      por: Identificador único de assinatura\n                  version:\n                    type: number\n                    example: 0\n                    description: Indicates how many times the subscription was modified\n                    x-description-i18n:\n                      eng: Indicates how many times the subscription was modified\n                      spa: Indica cuántas veces se modificó la suscripción\n                      por: Indica quantas vezes uma assinatura foi modificada\n                  application_id:\n                    type: number\n                    example: 1234567812345678\n                    description: Unique ID that identifies your application/integration. One of the keys in the pair that make up the credentials that identify an application/integration in your account.\n                    x-description-i18n:\n                      eng: Unique ID that identifies your application/integration. One of the keys in the pair that make up the credentials that identify an application/integration in your account.\n                      spa: ID único que identifica tu aplicación/integración. Una de las claves del par que componen las credenciales que identifican una aplicación/integración en tu cuenta.\n                      por: ID único que identifica sua aplicação/integração. Uma das chaves do par que compõe as credenciais que identifica uma aplicação/integração na sua conta.\n                  collector_id:\n                    type: number\n                    example: 100200300\n                    description: Unique ID that identifies your user as a seller. This ID matches your User ID in our ecosystem.\n                    x-description-i18n:\n                      eng: Unique ID that identifies your user as a seller. This ID matches your User ID in our ecosystem.\n                      spa: ID único que identifica a tu usuario como vendedor. Este ID coincide con tu User ID en nuestro ecosistema.\n                      por: ID único que identifica seu usuário como vendedor. Este ID corresponde ao seu User ID em nosso ecossistema. \n                  preapproval_plan_id:\n                    type: string\n                    description: Unique subscription plan identifier. This parameter is only available when it is a subscription with a plan and indicates from which plan the subscription was created.\n                    x-description-i18n:\n                      eng: Unique subscription plan identifier. This parameter is only available when it is a subscription with a plan and indicates from which plan the subscription was created.\n                      spa: Identificador único del plan de suscripción. Este parámetro solo está disponible cuando se trata de una suscripción con plan asociado e indica desde qué plan se creó la suscripción.\n                      por: Identificador único de plano de assinatura. Este parâmetro só está disponível quando se trata de uma assinatura com um plano associado e indica a partir de qual plano a assinatura foi criada. \n                    example: 2c938084726fca480172750000000000\n                  reason:\n                    type: string\n                    example: Yoga classes.\n                    description: It is a short description that the subscriber will see during the checkout process and in the notifications. It is only required for subscriptions without a plan.\n                    x-description-i18n:\n                      eng: It is a short description that the subscriber will see during the checkout process and in the notifications. It is only required for subscriptions without a plan.\n                      spa: Es una breve descripción que el suscriptor verá durante el proceso de checkout y en las notificaciones. Solo se requiere para suscripciones sin plan asociado.\n                      por: É uma breve descrição que o assinante verá durante o processo de checkout e nas notificações. É obrigatório apenas para assinaturas sem plano associado.\n                  external_reference:\n                    type: string\n                    example: 23546246234\n                    description: Reference to sync with your system. This is a free text field to help you with your integration to link the entities.\n                    x-description-i18n:\n                      eng: Reference to sync with your system. This is a free text field to help you with your integration to link the entities.\n                      spa: Referencia para sincronizar con tu sistema. Este es un campo de texto libre para ayudarte con tu integración para vincular las entidades.\n                      por: Referência para sincronizar com seu sistema. Este é um campo de texto livre para ajudar com a integração para vincular as entidades.\n                  back_url:\n                    type: string\n                    example: https://www.mercadopago.com.ar\n                    description: Successful return URL. Use this setting to redirect your customers to your site after our checkout.\n                    x-description-i18n:\n                      eng: Successful return URL. Use this setting to redirect your customers to your site after our checkout.\n                      spa: URL de retorno exitosa. Use esta configuración para redirigir a tus clientes a su sitio después de nuestro checkout.\n                      por: URL de retorno de sucesso. Use esta configuração para redirecionar seus clientes para o seu site após o checkout.\n                  init_point:\n                    type: string\n                    example: https://www.mercadopago.com.ar/subscriptions/checkout?preapproval_id=2c938084726fca480172750000000000\n                    description: URL to checkout to add or modify payment method.\n                    x-description-i18n:\n                      eng: URL to checkout to add or modify payment method.\n                      spa: URL al checkout para agregar o modificar el método de pago.\n                      por: URL para o checkout para adicionar ou modificar um meio de pagamento.\n                  auto_recurring:\n                    type: object\n                    description: Configuration data for recurrence.\n                    x-description-i18n:\n                      eng: Configuration data for recurrence.\n                      spa: Información de configuración para la recurrencia.\n                      por: Configuração da data para recorrência.\n                    properties:\n                      frequency:\n                        type: number\n                        description: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                        x-description-i18n:\n                          eng: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                          spa: Indica el valor de la frecuencia. Junto con frequency_type definen el ciclo de facturación que tendrá una suscripción.\n                          por: Indica o valor de frequência. Junto com frequency_type define o ciclo de cobrança que a assinaturá terá.\n                        example: 1\n                      frequency_type:\n                        type: string\n                        description: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                        x-description-i18n:\n                          eng: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                          spa: Indica el tipo de frecuencia. Junto con frequency definen el ciclo de facturación que tendrá una suscripción.\n                          por: Indica o tipo de frequência. Junto com frequency, definem o ciclo de cobrança que a assinatura terá.\n                        example: months\n                        enum:\n                          - days -- Indicate a frequency in units of days\n                          - months -- Indicate a frequency in units of months\n                      start_date:\n                        type: string\n                        format: date\n                        description: Date from which the subscription will be active and we start collecting invoices.\n                        x-description-i18n:\n                          eng: Date from which the subscription will be active and we start collecting invoices.\n                          spa: Fecha a partir de la cual la suscripción estará activa y se empiezan a cobrar las facturas.\n                          por: Data que indica o momento em que a assinatura será ativada e começará a cobrança das faturas.\n                        example: \"2020-06-02T13:07:14.260Z\"\n                      end_date:\n                        type: string\n                        format: date\n                        description: Date until which the subscription will be active and we will stop charging invoices.\n                        x-description-i18n:\n                          eng: Date until which the subscription will be active and we will stop charging invoices.\n                          spa: Fecha hasta la cual la suscripción estará activa y se dejan de cobrar las facturas.\n                          por: Data que indica o fim da assinatura e o momento em que a cobrança não será mais realizada.\n                        example: \"2022-07-20T15:59:52.581Z\"\n                      currency_id:\n                        type: string\n                        description: ID of the currency used in the payment.\n                        x-description-i18n:\n                          eng: ID of the currency used in the payment.\n                          spa: Identificador de la moneda utilizada en el pago\n                          por: Identificador da moeda utilizada no pagamento\n                        example: ARS\n                        enum:\n                          - ARS -- Argentine peso.\n                          - BRL -- Brazilian real.\n                          - CLP -- Chilean peso.\n                          - MXN -- Mexican peso.\n                          - COP -- Colombian peso.\n                          - PEN -- Peruvian sol.\n                          - UYU -- Uruguayan peso.\n                      transaction_amount:\n                        type: number\n                        description: Amount we will charge on each invoice.\n                        x-description-i18n:\n                          eng: Amount we will charge on each invoice.\n                          spa: Suma que se cobrará en cada factura.\n                          por: Valor que será cobrado em cada fatura.\n                        example: 10\n                      free_trial:\n                        type: object\n                        description: Free trial data.\n                        x-description-i18n:\n                          eng: Free trial data.\n                          spa: Información sobre prueba gratuita.\n                          por: Informação de teste grátis\n                        properties:\n                          frequency:\n                            type: number\n                            description: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                            x-description-i18n:\n                              eng: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                              spa: Indica el valor de la frecuencia. Junto con frequency_type definen el ciclo de facturación que tendrá una suscripción.\n                              por: Indica o valor de frequência. Junto com frequency_type define o ciclo de cobrança que a assinaturá terá.\n                            example: 1\n                          frequency_type:\n                            type: string\n                            description: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                            x-description-i18n:\n                              eng: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                              spa: Indica el tipo de frecuencia. Junto con frequency definen el ciclo de facturación que tendrá una suscripción.\n                              por: Indica o tipo de frequência. Junto com frequency, definem o ciclo de cobrança que a assinatura terá.\n                            example: months\n                            enum:\n                              - days -- Indicate a frequency in units of days\n                              - months -- Indicate a frequency in units of months\n                  first_invoice_offset:\n                    type: number\n                    description: Number of days to collect the first invoice\n                    x-description-i18n:\n                      eng: Number of days to collect the first invoice\n                      spa: Número de días para cobrar la primera factura\n                      por: Número de dias para cobrar a primeira fatura\n                    example: 7\n                  payer_id:\n                    type: number\n                    example: 123123123\n                    description: Unique customer identifier. This is created from the email you used to create the subscription.\n                    x-description-i18n:\n                      eng: Unique customer identifier. This is created from the email you used to create the subscription.\n                      spa: Identificador único de cliente. Se crea a partir del correo electrónico que utilizaste para crear la suscripción.\n                      por: Identificador único do cliente. É criado a partir do e-mail utilizado para criar a assinatura.\n                  card_id:\n                    type: number\n                    example: 123123123\n                    description: Unique identifier to retrieve data from the card used as a payment method.\n                    x-description-i18n:\n                      eng: Unique identifier to retrieve data from the card used as a payment method.\n                      spa: Identificador único para recuperar datos de la tarjeta utilizada como medio de pago.\n                      por: Identificador único para recuperar dados do cartão utilizado como meio de pagamento.\n                  payment_method_id:\n                    type: string\n                    example: account_money\n                    description: Payment method configured.\n                    x-description-i18n:\n                      eng: Payment method configured.\n                      spa: Método de pago configurado.\n                      por: Meio de pagamento configurado.\n                  next_payment_date:\n                    type: string\n                    example: \"2022-01-01T11:12:25.892-04:00\"\n                    description: Date of the next payment debit.\n                    x-description-i18n:\n                      eng: Date of the next payment debit.\n                      spa: Fecha del próximo débito.\n                      por: Data do próximo débito.\n                  date_created:\n                    type: string\n                    example: \"2022-01-01T11:12:25.892-04:00\"\n                    description: Creation date\n                    x-description-i18n:\n                      eng: Creation date\n                      spa: Fecha de creación\n                      por: Data de criação\n                  last_modified:\n                    type: string\n                    example: \"2022-01-01T11:12:25.892-04:00\"\n                    description: Date of last modification.\n                  summarized:\n                    type: object\n                    description: Summary information on subscription invoices and charges\n                    x-description-i18n:\n                      eng: Summary information on subscription invoices and charges\n                      spa: Información resumida sobre facturas y cargos de suscripción\n                      por: Informações resumidas sobre faturas e cobranças de assinatura\n                    properties:\n                      quotas:\n                        type: number\n                        description: How many payments are going to be made.\n                        x-description-i18n:\n                          eng: How many payments are going to be made.\n                          spa: Cantidad de pagos que se realizarán.\n                          por: Quantos pagamentos serão feitos.\n                        example: 6\n                      charged_quantity:\n                        type: number\n                        description: Total charged of charged quotas.\n                        x-description-i18n:\n                          eng: Total charged of charged quotas.\n                          spa: Total cobrado de cuotas.\n                          por: Total cobrado de parcelas\n                        example: 3\n                      charged_amount:\n                        type: number\n                        description: Total amount collected to date.\n                        x-description-i18n:\n                          eng: Total amount collected to date.\n                          spa: Importe total recaudado hasta la fecha.\n                          por: Valor total cobrado até o momento.\n                        example: 1000.00\n                      pending_charge_quantity:\n                        type: number\n                        description: Pending quotas to charge.\n                        x-description-i18n:\n                          eng: Pending quotas to charge.\n                          spa: Cuotas pendientes a ser cobradas.\n                          por: Parcelas pendentes a serem cobradas.\n                        example: 1\n                      pending_charge_amount:\n                        type: number\n                        description: Amount pending collection.\n                        x-description-i18n:\n                          eng: Amount pending collection.\n                          spa: Importe pendiente de cobro.\n                          por: Valor pendente de cobrança\n                        example: 200.00\n                      last_charged_date:\n                        type: number\n                        description: Date of last charge.\n                        x-description-i18n:\n                          eng: Date of last charge.\n                          spa: Fecha de último cobro.\n                          por: Data da última cobrança.\n                        example: \"2022-01-01T11:12:25.892-04:00\"\n                      last_charged_amount:\n                        type: number\n                        description: Date of last charged amount.\n                        x-description-i18n:\n                          eng: Date of last charged amount.\n                          spa: Fecha de último importe cobrado.\n                          por: Data do último valor cobrado.\n                        example: 100.00\n                      semaphore:\n                        type: number\n                        description: Subscription collection status summary.\n                        x-description-i18n:\n                          eng: Subscription collection status summary.\n                          spa: Resumen del estado de la cobranza de suscripciones.\n                          por: Resumo do status de cobrança de assinaturas.\n                        example: green\n                        enum:\n                          - green -- All collections made.\n                          - yellow -- With collection problems. We are trying to collect an invoice.\n                          - red -- With pending collections. An invoice could not be collected.\n                          - blank -- Discounted collection.\n                  status:\n                    type: string\n                    example: pending\n                    description: Status\n                    enum:\n                      - pending -- Preapproval without a payment method\n                      - authorized -- Preapproval with a valid payment method\n                      - paused -- Preapproval with temporally discontinued collection of payments\n                      - cancelled -- Preapproval terminated. This is an irreversible state\n        '400':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 400--Bad-Request--Invalid value {id}, Field 'id' must match this pattern '[a-f0-9-]+'\n        '403':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 403--Forbidden--The caller is not authorized to access this resource\n        '404':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 404--Not-found--The preapproval with id {id} does not exist\n        '500':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 500--Error--Internal server error\n    put:\n      tags:\n        - $ref: \"#/tags/subscriptions\"\n      summary: Update a subscription\n      x-summary-i18n:\n        eng: Update a subscription\n        spa: Actualizar suscripción\n        por: Atualizar assinatura\n      description: Renew the data of a subscription. Indicate the preapproval ID and send the body with the information you want to update. You can update reason, amount, payment method and status and more \n      parameters:\n        - name: id\n          in: path\n          description: Unique subscription identifier you want to modify.\n          x-description-i18n:\n            eng: Unique subscription identifier you want to modify.\n            spa: Identificador único de suscripción que deseas modificar.\n            por: Identificador de assinatura exclusivo que deseja modificar.\n          required: true\n          schema:\n            type: string\n            example: 2c938084726fca480172750000000000\n      requestBody:\n        content:\n          application/json:\n            schema:\n              type: object\n              properties:\n                reason:\n                  type: string\n                  example: Yoga classes.\n                  description: It is a short description that the subscriber will see during the checkout process and in the notifications. It is only required for subscriptions without a plan.\n                  x-description-i18n:\n                    eng: It is a short description that the subscriber will see during the checkout process and in the notifications. It is only required for subscriptions without a plan.\n                    spa: Es una breve descripción que el suscriptor verá durante el proceso de checkout y en las notificaciones. Solo se requiere para suscripciones sin plan asociado.\n                    por: É uma breve descrição que o assinante verá durante o processo de checkout e nas notificações. É obrigatório apenas para assinaturas sem plano associado.\n                external_reference:\n                  type: string\n                  example: 23546246234\n                  description: Reference to sync with your system. This is a free text field to help you with your integration to link the entities.\n                  x-description-i18n:\n                    eng: Reference to sync with your system. This is a free text field to help you with your integration to link the entities.\n                    spa: Referencia para sincronizar con tu sistema. Este es un campo de texto libre para ayudarte con tu integración para vincular las entidades.\n                    por: Referência para sincronizar com seu sistema. Este é um campo de texto livre para ajudar com a integração para vincular as entidades.\n                back_url:\n                  type: string\n                  example: https://www.mercadopago.com.ar\n                  description: Successful return URL. Use this setting to redirect your customers after our checkout to your site.\n                  x-description-i18n:\n                    eng: Successful return URL. Use this setting to redirect your customers after our checkout to your site.\n                    spa: URL de retorno exitosa. Use esta configuración para redirigir a tus clientes después de nuestro checkout a tu sitio.\n                    por: URL de retorno de sucesso. Use esta configuração para redirecionar seus clientes ao seu site após o checkout.\n                auto_recurring:\n                  type: object\n                  description: Configuration data for recurrence.\n                  x-description-i18n:\n                    eng: Configuration data for recurrence.\n                    spa: Información de configuración para la recurrencia.\n                    por: Configuração da data para recorrência.\n                  properties:\n                    transaction_amount:\n                      type: number\n                      description: Amount we will charge on each invoice.\n                      x-description-i18n:\n                        eng: Amount we will charge on each invoice.\n                        spa: Suma que se cobrará en cada factura.\n                        por: Valor que será cobrado em cada fatura.\n                      example: 10\n                    currency_id:\n                      type: string\n                      description: ID of the currency used in the payment.\n                      x-description-i18n:\n                        eng: ID of the currency used in the payment.\n                        spa: Identificador de la moneda utilizada en el pago\n                        por: Identificador da moeda utilizada no pagamento\n                      example: ARS\n                      enum:\n                          - ARS -- Argentine peso.\n                          - BRL -- Brazilian real.\n                          - CLP -- Chilean peso.\n                          - MXN -- Mexican peso.\n                          - COP -- Colombian peso.\n                          - PEN -- Peruvian sol.\n                          - UYU -- Uruguayan peso.\n                card_token_id:\n                  type: number\n                  example: 123123123\n                  description: Unique identifier to retrieve data from the card used as a payment method.\n                  x-description-i18n:\n                    eng: Unique identifier to retrieve data from the card used as a payment method.\n                    spa: Identificador único para recuperar datos de la tarjeta utilizada como medio de pago.\n                    por: Identificador único para recuperar dados do cartão utilizado como meio de pagamento.\n                status:\n                  type: string\n                  example: pending\n                  description: Status\n                  enum:\n                    - pending -- Preapproval without a payment method\n                    - authorized -- Preapproval with a valid payment method\n                    - paused -- Preapproval with temporally discontinued collection of payments\n                    - cancelled -- Preapproval terminated. This is an irreversible state.\n      responses:\n        '200':\n          description: Success\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  id:\n                    type: string\n                    example: 2c938084726fca480172750000000000\n                    description: Unique subscription identifier.\n                    x-description-i18n:\n                      eng: Unique subscription identifier.\n                      spa: Identificador único de suscripción.\n                      por: Identificador único de assinatura\n                  version:\n                    type: number\n                    example: 0\n                    description: How many times the subscription was modified\n                  application_id:\n                    type: number\n                    example: 1234567812345678\n                    description: Unique ID that identifies your application/integration. One of the keys in the pair that make up the credentials that identify an application/integration in your account.\n                    x-description-i18n:\n                      eng: Unique ID that identifies your application/integration. One of the keys in the pair that make up the credentials that identify an application/integration in your account.\n                      spa: ID único que identifica tu aplicación/integración. Una de las claves del par que componen las credenciales que identifican una aplicación/integración en tu cuenta.\n                      por: ID único que identifica sua aplicação/integração. Uma das chaves do par que compõe as credenciais que identifica uma aplicação/integração na sua conta.\n                  collector_id:\n                    type: number\n                    example: 100200300\n                    description: Unique ID that identifies your user as a seller. This ID matches your User ID in our ecosystem.\n                    x-description-i18n:\n                      eng: Unique ID that identifies your user as a seller. This ID matches your User ID in our ecosystem.\n                      spa: ID único que identifica a tu usuario como vendedor. Este ID coincide con tu User ID en nuestro ecosistema.\n                      por: ID único que identifica seu usuário como vendedor. Este ID corresponde ao seu User ID em nosso ecossistema. \n                  preapproval_plan_id:\n                    type: string\n                    description: Unique subscription plan identifier. This parameter is only available when it is a subscription with a plan and indicates from which plan the subscription was created.\n                    x-description-i18n:\n                      eng: Unique subscription plan identifier. This parameter is only available when it is a subscription with a plan and indicates from which plan the subscription was created.\n                      spa: Identificador único del plan de suscripción. Este parámetro solo está disponible cuando se trata de una suscripción con plan asociado e indica desde qué plan se creó la suscripción.\n                      por: Identificador único de plano de assinatura. Este parâmetro só está disponível quando se trata de uma assinatura com um plano associado e indica a partir de qual plano a assinatura foi criada. \n                    example: 2c938084726fca480172750000000000\n                  reason:\n                    type: string\n                    example: Yoga classes.\n                    description: It is a short description that the subscriber will see during the checkout process and in the notifications. It is only required for subscriptions without a plan.\n                    x-description-i18n:\n                      eng: It is a short description that the subscriber will see during the checkout process and in the notifications. It is only required for subscriptions without a plan.\n                      spa: Es una breve descripción que el suscriptor verá durante el proceso de checkout y en las notificaciones. Solo se requiere para suscripciones sin plan asociado.\n                      por: É uma breve descrição que o assinante verá durante o processo de checkout e nas notificações. É obrigatório apenas para assinaturas sem plano associado.\n                  external_reference:\n                    type: string\n                    example: 23546246234\n                    description: Reference to sync with your system. This is a free text field to help you with your integration to link the entities.\n                    x-description-i18n:\n                      eng: Reference to sync with your system. This is a free text field to help you with your integration to link the entities.\n                      spa: Referencia para sincronizar con tu sistema. Este es un campo de texto libre para ayudarte con tu integración para vincular las entidades.\n                      por: Referência para sincronizar com seu sistema. Este é um campo de texto livre para ajudar com a integração para vincular as entidades.\n                  back_url:\n                    type: string\n                    example: https://www.mercadopago.com.ar\n                    description: Successful return URL. Use this setting to redirect your customers to your site after our checkout.\n                    x-description-i18n:\n                      eng: Successful return URL. Use this setting to redirect your customers to your site after our checkout.\n                      spa: URL de retorno exitosa. Use esta configuración para redirigir a tus clientes a su sitio después de nuestro checkout.\n                      por: URL de retorno de sucesso. Use esta configuração para redirecionar seus clientes para o seu site após o checkout.\n                  init_point:\n                    type: string\n                    example: https://www.mercadopago.com.ar/subscriptions/checkout?preapproval_id=2c938084726fca480172750000000000\n                    description: URL to checkout to add or modify payment method.\n                    x-description-i18n:\n                      eng: URL to checkout to add or modify payment method.\n                      spa: URL al checkout para agregar o modificar el método de pago.\n                      por: URL para o checkout para adicionar ou modificar um meio de pagamento.\n                  auto_recurring:\n                    type: object\n                    description: Configuration data for recurrence.\n                    x-description-i18n:\n                      eng: Configuration data for recurrence.\n                      spa: Información de configuración para la recurrencia.\n                      por: Configuração da data para recorrência.\n                    properties:\n                      frequency:\n                        type: number\n                        description: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                        x-description-i18n:\n                          eng: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                          spa: Indica el valor de la frecuencia. Junto con frequency_type definen el ciclo de facturación que tendrá una suscripción.\n                          por: Indica o valor de frequência. Junto com frequency_type define o ciclo de cobrança que a assinaturá terá.\n                        example: 1\n                      frequency_type:\n                        type: string\n                        description: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                        x-description-i18n:\n                          eng: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                          spa: Indica el tipo de frecuencia. Junto con frequency definen el ciclo de facturación que tendrá una suscripción.\n                          por: Indica o tipo de frequência. Junto com frequency, definem o ciclo de cobrança que a assinatura terá.\n                        example: months\n                        enum:\n                          - days -- Indicate a frequency in units of days\n                          - months -- Indicate a frequency in units of months\n                      start_date:\n                        type: string\n                        format: date\n                        description: Date from which the subscription will be active and we start collecting invoices.\n                        x-description-i18n:\n                          eng: Date from which the subscription will be active and we start collecting invoices.\n                          spa: Fecha a partir de la cual la suscripción estará activa y se empiezan a cobrar las facturas.\n                          por: Data que indica o momento em que a assinatura será ativada e começará a cobrança das faturas.\n                        example: \"2020-06-02T13:07:14.260Z\"\n                      end_date:\n                        type: string\n                        format: date\n                        description: Date until which the subscription will be active and we will stop charging invoices.\n                        x-description-i18n:\n                          eng: Date until which the subscription will be active and we will stop charging invoices.\n                          spa: Fecha hasta la cual la suscripción estará activa y se dejan de cobrar las facturas.\n                          por: Data que indica o fim da assinatura e o momento em que a cobrança não será mais realizada.\n                        example: \"2022-07-20T15:59:52.581Z\"\n                      currency_id:\n                        type: string\n                        description: ID of the currency used in the payment.\n                        x-description-i18n:\n                          eng: ID of the currency used in the payment.\n                          spa: Identificador de la moneda utilizada en el pago\n                          por: Identificador da moeda utilizada no pagamento\n                        example: ARS\n                        enum:\n                          - ARS -- Argentine peso.\n                          - BRL -- Brazilian real.\n                          - CLP -- Chilean peso.\n                          - MXN -- Mexican peso.\n                          - COP -- Colombian peso.\n                          - PEN -- Peruvian sol.\n                          - UYU -- Uruguayan peso.\n                      transaction_amount:\n                        type: number\n                        description: Amount that will be charged on each invoice.\n                        x-description-i18n:\n                          eng: Amount that will be charged on each invoice.\n                          spa: Importe que se cobrará en cada factura.\n                          por: Valor que será cobrado em cada fatura.\n                        example: 10\n                      free_trial:\n                        type: object\n                        description: Free trial data.\n                        x-description-i18n:\n                          eng: Free trial data.\n                          spa: Información sobre prueba gratuita.\n                          por: Informação de teste grátis\n                        properties:\n                          frequency:\n                            type: number\n                            description: Indicates the frequency value. Along with frequency_type they define the invoice cycle that a subscription will have.\n                            x-description-i18n:\n                              eng: Indicates the frequency value. Along with frequency_type they define the invoice cycle that a subscription will have.\n                              spa: Indica el valor de la frecuencia. Junto con frequency_type definen el ciclo de facturación que tendrá una suscripción.\n                              por: Indica o valor de frequência. Junto com o frequency_type, define o ciclo de faturamento que uma assinaturá terá.\n                            example: 1\n                          frequency_type:\n                            type: string\n                            description: Indicates the type of frequency. Along with frequency they define the invoice cycle that a subscription will have.\n                            x-description-i18n:\n                              eng: Indicates the type of frequency. Along with frequency they define the invoice cycle that a subscription will have.\n                              spa: Indica el tipo de frecuencia. Junto con frequency definen el ciclo de facturación que tendrá una suscripción.\n                              por: Indica o valor de frequência. Junto com o frequency, define o ciclo de faturamento que uma assinaturá terá.\n                            example: months\n                            enum:\n                              - days -- Indicate a frequency in units of days\n                              - months -- Indicate a frequency in units of months\n                  first_invoice_offset:\n                    type: number\n                    description: Number of days to collect the first invoice\n                    x-description-i18n:\n                      eng: Number of days to collect the first invoice\n                      spa: Número de días para cobrar la primera factura\n                      por: Número de dias para cobrar a primeira fatura\n                    example: 7\n                  payer_id:\n                    type: number\n                    example: 123123123\n                    description: Unique customer identifier. This is created from the email you used to create the subscription.\n                    x-description-i18n:\n                      eng: Unique customer identifier. This is created from the email you used to create the subscription.\n                      spa: Identificador único de cliente. Se crea a partir del correo electrónico que utilizaste para crear la suscripción.\n                      por: Identificador único do cliente. É criado a partir do e-mail utilizado para criar a assinatura.\n                  card_id:\n                    type: number\n                    example: 123123123\n                    description: Unique identifier to retrieve data from the card used as a payment method.\n                    x-description-i18n:\n                      eng: Unique identifier to retrieve data from the card used as a payment method.\n                      spa: Identificador único para recuperar datos de la tarjeta utilizada como medio de pago.\n                      por: Identificador único para recuperar dados do cartão utilizado como meio de pagamento.\n                  payment_method_id:\n                    type: string\n                    example: account_money\n                    description: Payment method configured.\n                    x-description-i18n:\n                      eng: Payment method configured.\n                      spa: Método de pago configurado.\n                      por: Meio de pagamento configurado.\n                  next_payment_date:\n                    type: string\n                    example: \"2022-01-01T11:12:25.892-04:00\"\n                    description: Date of the next payment debit.\n                    x-description-i18n:\n                      eng: Date of the next payment debit.\n                      spa: Fecha del próximo débito.\n                      por: Data do próximo débito.\n                  date_created:\n                    type: string\n                    example: \"2022-01-01T11:12:25.892-04:00\"\n                    description: Creation date\n                    x-description-i18n:\n                      eng: Creation date\n                      spa: Fecha de creación\n                      por: Data de criação\n                  last_modified:\n                    type: string\n                    example: \"2022-01-01T11:12:25.892-04:00\"\n                    description: Date of last modification\n                    x-description-i18n:\n                      eng: Date of last modification\n                      spa: Fecha de última modificación.\n                      por: Data da última modificação.\n                  summarized:\n                    type: object\n                    description: Summary information on subscription invoices and charges\n                    x-description-i18n:\n                      eng: Summary information on subscription invoices and charges\n                      spa: Información resumida sobre facturas y cargos de suscripción\n                      por: Informações resumidas sobre faturas e cobranças de assinatura\n                    properties:\n                      quotas:\n                        type: number\n                        description: How many payments are going to be made.\n                        x-description-i18n:\n                          eng: How many payments are going to be made.\n                          spa: Cantidad de pagos que se realizarán.\n                          por: Quantos pagamentos serão feitos.\n                        example: 6\n                      charged_quantity:\n                        type: number\n                        description: Total charged of charged quotas.\n                        x-description-i18n:\n                          eng: Total charged of charged quotas.\n                          spa: Total cobrado de cuotas.\n                          por: Total cobrado de parcelas\n                        example: 3\n                      charged_amount:\n                        type: number\n                        description: Total amount collected to date.\n                        x-description-i18n:\n                          eng: Total amount collected to date.\n                          spa: Importe total recaudado hasta la fecha.\n                          por: Valor total cobrado até o momento.\n                        example: 1000.00\n                      pending_charge_quantity:\n                        type: number\n                        description: Pending quotas to charge.\n                        x-description-i18n:\n                          eng: Pending quotas to charge.\n                          spa: Cuotas pendientes a ser cobradas.\n                          por: Parcelas pendentes a serem cobradas.\n                        example: 1\n                      pending_charge_amount:\n                        type: number\n                        description: Amount pending collection.\n                        x-description-i18n:\n                          eng: Amount pending collection.\n                          spa: Importe pendiente de cobro.\n                          por: Valor pendente de cobrança\n                        example: 200.00\n                      last_charged_date:\n                        type: number\n                        description: Date of last charge.\n                        x-description-i18n:\n                          eng: Date of last charge.\n                          spa: Fecha de último cobro.\n                          por: Data da última cobrança.\n                        example: \"2022-01-01T11:12:25.892-04:00\"\n                      last_charged_amount:\n                        type: number\n                        description: Date of last charged amount.\n                        x-description-i18n:\n                          eng: Date of last charged amount.\n                          spa: Fecha de último importe cobrado.\n                          por: Data do último valor cobrado.\n                        example: 100.00\n                      semaphore:\n                        type: number\n                        description: Subscription collection status summary.\n                        x-description-i18n:\n                          eng: Subscription collection status summary.\n                          spa: Resumen del estado de la cobranza de suscripciones.\n                          por: Resumo do status de cobrança de assinaturas.\n                        example: green\n                        enum:\n                          - green -- All collections made.\n                          - yellow -- With collection problems. We are trying to collect an invoice.\n                          - red -- With pending collections. An invoice could not be collected.\n                          - blank -- Discounted collection.\n                  status:\n                    type: string\n                    example: pending\n                    description: Status\n                    enum:\n                      - pending -- Preapproval without a payment method\n                      - authorized -- Preapproval with a valid payment method\n                      - paused -- Preapproval with temporally discontinued collection of payments\n                      - cancelled -- Preapproval terminated. This is an irreversible state\n        '400':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 400--Bad-request--Invalid transition from cancelled to authorized\n                      - 400--Bad-request--You can not modify a cancelled preapproval.\n                      - 400--Bad-request--You can not modify a paused subscription.\n                      - 400--Bad-request--This preapproval can not be authorized with a credit card\n                      - 400--Bad-request--This preapproval can not disable account_money\n                      - 400--Bad-request--This preapproval can not be authorized only with account_money\n                      - 400--Bad-request--This preapproval require account_money to be authorized\n                      - 400--Bad-request--You must provide a card_id\n                      - 400--Bad-request--preapproval without another payment method\n        '401':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 401--Unauthorized--Unauthorized access to resource\n        '500':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 500--Error--Internal server error\n  /preapproval/export:\n    get:\n      tags:\n        - $ref: \"#/tags/subscriptions\"\n      summary: Export subscriptions\n      x-summary-i18n:\n        eng: Export subscriptions\n        spa: Exportar suscripciones\n        por: Exportar assinaturas\n      description: Downloads a CSV file with all the subscriptions that match the search request\n      x-description-i18n:\n        eng: Downloads a CSV file with all the subscriptions that match the search request\n        spa: Descarga un archivo CSV con todas las suscripciones que coinciden con la solicitud de búsqueda\n        por: Baixar um arquivo CSV com todas as assinaturas que correspondem a solicitação de busca\n      parameters:\n        - name: collector_id\n          in: path\n          required: true\n          description: ID of the collector requesting the subscriptions.\n          x-description-i18n:\n            eng: ID of the collector requesting the subscriptions.\n            spa: ID del collector que solicita las suscripciones.\n            por: ID do collector solicitando a assinatura\n          schema:\n            type: number\n            example: 38524206\n        - name: preapproval_plan_id\n          in: path\n          description: Specifies a Plan ID for filtering results from the export.\n          x-description-i18n:\n            eng: Specifies a Plan ID for filtering results from the export.\n            spa: Especifica un Plan ID para filtrar los resultados de la exportación.\n            por: Especifica um Plan ID para filtrar os resultados da exportação.\n          schema:\n            type: string\n            example: 2c938084726fca480172750000000000\n        - name: status\n          in: path\n          description: Specifies a status for filtering results from the export. Can be null, one or more than one.\n          x-description-i18n:\n            eng: Specifies a status for filtering results from the export. Can be null, one or more than one.\n            spa: Especifica un status para filtrar los resultados exportados. Puede ser null, uno o más de uno.\n            por: Especifica um Plan ID para filtrar os resultados da exportação. Pode ser null, um ou mais do que um.\n          schema:\n            type: string\n            example: authorized,cancelled,paused\n            enum:\n              - pending -- Preapproval without a payment method.\n              - authorized -- Preapproval with a valid payment method.\n              - paused -- Preapproval with temporally discontinued collection of payments.\n              - cancelled -- Preapproval terminated. This is an irreversible state.\n        - name: sort\n          in: path\n          description: Specifies the type of sorting selected to retrieve the subscriptions. You must indicate a field and a sort type with the following format field_name:sort_type.\n          x-description-i18n:\n            eng: Specifies the type of sorting selected to retrieve the subscriptions. You must indicate a field and a sort type with the following format field_name:sort_type.\n            spa: Especifica el tipo de clasificación seleccionado para recuperar las suscripciones. Debes indicar un campo y un tipo de clasificación con el siguiente formato ield_name:sort_type.\n            por: Especifica o tipo de classificação selecionado para recuperar as assinaturas. Você deve indicar um campo e um tipo de classificação com o seguinte formato field_name:sort_type.\n          schema:\n            type: string\n            example: payer_id:asc\n            enum:\n              - asc - Ascending sort\n              - desc - Descending sort\n      responses:\n        '200':\n          description: Success\n          headers:\n            Content-Disposition:\n              schema:\n                type: string\n              description: the format is `attachment; filename=\"preapprovals.zip\"`\n          content:\n            application/octet-stream:\n              schema:\n                type: string\n                format: binary\n                properties:\n                  id:\n                    type: number\n                    example: 2c9380847cc2c422017cc489094f0001\n                    description: Unique subscription identifier.\n                    x-description-i18n:\n                      eng: Unique subscription identifier.\n                      spa: Identificador único de suscripción.\n                      por: Identificador único de assinatura\n                  payer_id:\n                    type: number\n                    example: 123123123\n                    description: Unique customer identifier. This is created from the email you used to create the subscription.\n                    x-description-i18n:\n                      eng: Unique customer identifier. This is created from the email you used to create the subscription.\n                      spa: Identificador único de cliente. Se crea a partir del correo electrónico que utilizaste para crear la suscripción.\n                      por: Identificador único do cliente. É criado a partir do e-mail utilizado para criar a assinatura.\n                  back_url:\n                    required: true\n                    type: string\n                    description: Successful return URL. Use this setting to redirect your customers to your site after our checkout.\n                    x-description-i18n:\n                      eng: Successful return URL. Use this setting to redirect your customers to your site after our checkout.\n                      spa: URL de retorno exitosa. Use esta configuración para redirigir a tus clientes a su sitio después de nuestro checkout.\n                      por: URL de retorno de sucesso. Use esta configuração para redirecionar seus clientes para o seu site após o checkout.\n                    example: https://www.yoursite.com\n                  application_id:\n                    type: number\n                    example: 1234567812345678\n                    description: Unique ID that identifies your application/integration. One of the keys in the pair that make up the credentials that identify an application/integration in your account.\n                    x-description-i18n:\n                      eng: Unique ID that identifies your application/integration. One of the keys in the pair that make up the credentials that identify an application/integration in your account.\n                      spa: ID único que identifica tu aplicación/integración. Una de las claves del par que componen las credenciales que identifican una aplicación/integración en tu cuenta.\n                      por: ID único que identifica sua aplicação/integração. Uma das chaves do par que compõe as credenciais que identifica uma aplicação/integração na sua conta.\n                  status:\n                    type: string\n                    example: pending\n                    description: Status\n                    enum:\n                      - pending -- Preapproval without a payment method.\n                      - authorized -- Preapproval with a valid payment method.\n                      - paused -- Preapproval with temporally discontinued collection of payments.\n                      - cancelled -- Preapproval terminated. This is an irreversible state.\n                  reason:\n                    required: true\n                    type: string\n                    description: It is a short description that the subscriber will see during the checkout process and in the notifications.\n                    x-description-i18n:\n                      eng: It is a short description that the subscriber will see during the checkout process and in the notifications.\n                      spa: Es una breve descripción que el suscriptor verá durante el checkout y en las notificaciones.\n                      por: É uma breve descrição que o assinante verá durante o processo de checkout e nas notificações.\n                    example: Yoga classes\n                  external_reference:\n                    type: string\n                    example: 23546246234\n                    description: Reference to sync with your system. This is a free text field to help you with your integration to link the entities.\n                    x-description-i18n:\n                      eng: Reference to sync with your system. This is a free text field to help you with your integration to link the entities.\n                      spa: Referencia para sincronizar con tu sistema. Este es un campo de texto libre para ayudarte con tu integración para vincular las entidades.\n                      por: Referência para sincronizar com seu sistema. Este é um campo de texto livre para ajudar com a integração para vincular as entidades.\n                  date_created:\n                    type: string\n                    example: \"2022-01-01T11:12:25.892-04:00\"\n                    description: Creation date\n                    x-description-i18n:\n                      eng: Creation date\n                      spa: Fecha de creación\n                      por: Data de criação\n                  last_modified:\n                    type: string\n                    example: \"2022-01-01T11:12:25.892-04:00\"\n                    description: Date of last modification\n                    x-description-i18n:\n                      eng: Date of last modification\n                      spa: Fecha de última modificación.\n                      por: Data da última modificação.\n                  init_point:\n                    type: string\n                    example: https://www.mercadopago.com.ar/subscriptions/checkout?preapproval_plan_id=2c938084726fca480172750000000000\n                    description: URL to checkout to add or modify payment method.\n                    x-description-i18n:\n                      eng: URL to checkout to add or modify payment method.\n                      spa: URL al checkout para agregar o modificar el método de pago.\n                      por: URL para o checkout para adicionar ou modificar um meio de pagamento.\n                  preapproval_plan_id:\n                    type: string\n                    description: Unique preapproval plan identifier. This parameter is only available when it is a subscription with a plan and indicates from which plan the subscription was created.\n                    x-description-i18n:\n                      eng: Unique preapproval plan identifier. This parameter is only available when it is a subscription with a plan and indicates from which plan the subscription was created.\n                      spa: Identificador único de la suscripción. Este parámetro solo está disponible cuando se trata de una suscripción con plan asociado e indica desde qué plan se creó la suscripción.\n                      por: Identificador único do plano de assinatura. Este parâmetro está disponível somente quando se trata de uma assinatura com um plano associado e indica a partir de qual plano foi criado.\n                    example: 2c938084726fca480172750000000000\n                  frequency:\n                    type: number\n                    description: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                    x-description-i18n:\n                      eng: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                      spa: Indica el valor de la frecuencia. Junto con frequency_type definen el ciclo de facturación que tendrá una suscripción.\n                      por: Indica o valor de frequência. Junto com frequency_type define o ciclo de cobrança que a assinaturá terá.\n                    example: 1\n                  frequency_type:\n                    type: string\n                    description: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                    x-description-i18n:\n                      eng: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                      spa: Indica el tipo de frecuencia. Junto con frequency definen el ciclo de facturación que tendrá una suscripción.\n                      por: Indica o tipo de frequência. Junto com frequency, definem o ciclo de cobrança que a assinatura terá.\n                    example: months\n                    enum:\n                      - days - Indicate a frequency in units of days\n                      - months - Indicate a frequency in units of months\n                  transaction_amount:\n                    type: number\n                    description: Amount we will charge on each invoice.\n                    x-description-i18n:\n                      eng: Amount we will charge on each invoice.\n                      spa: Suma que se cobrará en cada factura.\n                      por: Valor que será cobrado em cada fatura.\n                    example: 10\n                  currency_id:\n                    type: string\n                    description: ID of the currency used in the payment.\n                    x-description-i18n:\n                      eng: ID of the currency used in the payment.\n                      spa: Identificador de la moneda utilizada en el pago\n                      por: Identificador da moeda utilizada no pagamento\n                    example: ARS\n                    enum:\n                      - ARS -- Argentine peso.\n                      - BRL -- Brazilian real.\n                      - CLP -- Chilean peso.\n                      - MXN -- Mexican peso.\n                      - COP -- Colombian peso.\n                      - PEN -- Peruvian sol.\n                      - UYU -- Uruguayan peso.\n                  start_date:\n                    type: string\n                    format: date\n                    description: Date from which the subscription will be active and we start collecting invoices.\n                    x-description-i18n:\n                      eng: Date from which the subscription will be active and we start collecting invoices.\n                      spa: Fecha a partir de la cual la suscripción estará activa y se empiezan a cobrar las facturas.\n                      por: Data que indica o momento em que a assinatura será ativada e começará a cobrança das faturas.\n                    example: \"2020-06-02T13:07:14.260Z\"\n                  end_date:\n                    type: string\n                    format: date\n                    description: Date until which the subscription will be active and we will stop charging invoices.\n                    x-description-i18n:\n                      eng: Date until which the subscription will be active and we will stop charging invoices.\n                      spa: Fecha hasta la cual la suscripción estará activa y se dejan de cobrar las facturas.\n                      por: Data que indica o fim da assinatura e o momento em que a cobrança não será mais realizada.\n                    example: \"2022-07-20T15:59:52.581Z\"\n                  has_billing_day:\n                    type: boolean\n                    description: Indicates if the subscription has a billing day or not.\n                    example: false\n                  billing_day:\n                    type: number\n                    description: Day of the month that the subscription will always be charged. It only accepts values between 1 and 28.\n                    x-description-i18n:\n                      eng: Day of the month that the subscription will always be charged. It only accepts values between 1 and 28.\n                      spa: Día del mes en que siempre se cobrará la suscripción. Solo acepta valores entre 1 y 28.\n                      por: Dia do mês no qual a assinatura será cobrada. Aceita apenas valores entre 1 e 28.\n                    example: 10\n                  billing_day_proportional:\n                    type: boolean\n                    description: Charge a proportional amount to the billing day at the time of registration.\n                    x-description-i18n:\n                      eng: Charge a proportional amount to the billing day at the time of registration.\n                      spa: Cobra una suma proporcional al día de facturación en el momento del registro.\n                      por: Cobra um valor proporcional ao dia do faturamento no momento do cadastro.\n                    example: true\n                    enum:\n                      - true -- Charge a proportional amount based on the days remaining in the next billing cycle. Billing cycles are always calculated on a 30-day basis.\n                      - false -- Charge the amount of the subscription regardless of when in the billing cycle customer subscribe.\n                  quotas:\n                    type: number\n                    description: How many payments are going to be made.\n                    x-description-i18n:\n                      eng: How many payments are going to be made.\n                      spa: Cantidad de pagos que se realizarán.\n                      por: Quantos pagamentos serão feitos.\n                    example: 10\n                  charged_quantity:\n                    type: number\n                    description: Total charged of charged quotas.\n                    x-description-i18n:\n                      eng: Total charged of charged quotas.\n                      spa: Total cobrado de cuotas.\n                      por: Total cobrado de parcelas\n                    example: 20\n                  pending_charged_quantity:\n                    type: number\n                    description: Pending quotas to charge.\n                    x-description-i18n:\n                      eng: Pending quotas to charge.\n                      spa: Cuotas pendientes a ser cobradas.\n                      por: Parcelas pendentes a serem cobradas.\n                    example: 20\n                  charge_amount:\n                    type: number\n                    description: Total amount collected to date.\n                    x-description-i18n:\n                      eng: Total amount collected to date.\n                      spa: Importe total recaudado hasta la fecha.\n                      por: Valor total cobrado até o momento.\n                    example: 20\n                  pending_charge_amount:\n                    type: number\n                    description: Amount pending collection.\n                    x-description-i18n:\n                      eng: Amount pending collection.\n                      spa: Importe pendiente de cobro.\n                      por: Valor pendente de cobrança\n                    example: 20\n                  semaphore:\n                    type: number\n                    description: Preapproval collection status summary.\n                    example: green\n                    enum:\n                      - green -- All collections made.\n                      - yellow -- With collection problems. We are trying to collect an invoice.\n                      - red -- With pending collections. An invoice could not be collected.\n                      - blank -- Discounted collection.\n                  last_charge_date:\n                    type: number\n                    description: Date of last time a payment of this subscription.was made.\n                    example: 24-2-2021\n                  last_charge_amount:\n                    type: number\n                    description: Amount of last payment of this subscription.\n                    x-description-i18n:\n                      eng: Amount of last payment of this subscription.\n                      spa: Importe del último pago de esta suscripción.\n                      por: Valor do último pagamento desta assinatura.\n                    example: 1900\n                  next_payment_date:\n                    type: date\n                    description: Date of the next payment debit.\n                    x-description-i18n:\n                      eng: Date of the next payment debit.\n                      spa: Fecha del próximo débito.\n                      por: Data do próximo débito.\n                    example: 24-3-2021\n                  payment_method_id:\n                    type: string\n                    description: Payment method configured.\n                    x-description-i18n:\n                      eng: Payment method configured.\n                      spa: Método de pago configurado.\n                      por: Meio de pagamento configurado.\n                    example: account_money\n                  card_id:\n                    type: number\n                    description: Unique identifier to retrieve data from the card used as a payment method.\n                    x-description-i18n:\n                      eng: Unique identifier to retrieve data from the card used as a payment method.\n                      spa: Identificador único para recuperar datos de la tarjeta utilizada como medio de pago.\n                      por: Identificador único para recuperar dados do cartão utilizado como meio de pagamento.\n                    example: 434319883\n                  version:\n                    type: number\n                    description: How many times preapproval was modified.\n                    example: 4\n                  payer_first_name:\n                    type: string\n                    description: Customer name.\n                    x-description-i18n:\n                      eng: Customer name.\n                      spa: Nombre del cliente.\n                      por: Nome do cliente.\n                    example: Jorge\n                  payer_last_name:\n                    type: string\n                    description: Customer lastname.\n                    x-description-i18n:\n                      eng: Customer lastname.\n                      spa: Apellido del cliente.\n                      por: Sobrenome do cliente\n                    example: Smith\n        '401':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 401--Unauthorized--Unauthorized access to resource\n        '500':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 500--Error--Internal server error\n  /authorized_payments/{id}:\n     get:\n      tags:\n        - $ref: \"#/tags/subscriptions\"\n      summary: Get invoices data\n      x-summary-i18n:\n        eng: Get invoices data\n        spa: Obtener información de facturas\n        por: Obter dados de fatura\n      description: Obtains all the information of a invoice from its ID. Invoices are automatically schedules and charged based on the recurrence defined in the subscription\n      x-description-i18n:\n        eng: Obtains all the information of a invoice from its ID. Invoices are automatically schedules and charged based on the recurrence defined in the subscription\n        spa: Obtiene toda la información de una factura a partir de su ID. Las facturas se programan automáticamente y se cobran en función de la recurrencia definida en la suscripción\n        por: Obtenha todas as informações de uma fatura a partir de seu ID. As faturas são agendadas e cobradas automaticamente com base na recorrência definida na assinatura\n      parameters:\n        - name: id\n          in: path\n          description: Authorized payment identifier\n          x-description-i18n:\n            eng: Authorized payment identifier\n            spa: Identificador de pago autorizado\n            por: Identificador de pagamento autorizado\n          required: true\n          schema:\n            type: number\n            example: 3950169598\n      responses:\n        '200':\n          description: Success\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  id:\n                    type: number\n                    description: Unique invoice identifier.\n                    x-description-i18n:\n                      eng: Unique invoice identifier.\n                      spa: Identificador único de factura.\n                      por: Identificador único de fatura\n                    example: 6114264375\n                  type:\n                    type: string\n                    description: Type of invoice generated based on recurrence.\n                    x-description-i18n:\n                      eng: Type of invoice generated based on recurrence.\n                      spa: Tipo de factura generada en base a la recurrencia.\n                      por: Tipo de fatura gerada com base na recorrência.\n                    example: scheduled\n                    enum:\n                      - scheduled -- Automatically generated and scheduled by the recurrence engine\n                  date_created:\n                    type: string\n                    description: Invoice creation date.\n                    x-description-i18n:\n                      eng: Invoice creation date.\n                      spa: Fecha de creación de la factura.\n                      por: Data de criação da fatura.\n                    example: \"2022-01-01T11:12:25.892-04:00\"\n                  last_modified:\n                    type: string\n                    description: Invoice last modified date. An invoice is modified when an update occurs in collection attempts or payment.\n                    x-description-i18n:\n                      eng: Invoice last modified date. An invoice is modified when an update occurs in collection attempts or payment.\n                      spa: Fecha de última modificación de la factura. Una factura se modifica cuando se produce una actualización en los intentos de cobro o pago.\n                      por: Data da última modificação da fatura. Uma fatura é modificada quando ocorre uma atualização nas tentativas de cobrança ou pagamento.\n                    example: \"2022-01-01T11:12:25.892-04:00\"\n                  preapproval_id:\n                    type: string\n                    description: Subscription ID for which the invoice was created.\n                    x-description-i18n:\n                      eng: Subscription ID for which the invoice was created.\n                      spa: ID de suscripción para el que se creó la factura.\n                      por: ID de assinatura para qual a fatura foi criada.\n                    example: 2c938084726fca480172750000000000\n                  reason:\n                    type: string\n                    description: It is a short description that the subscriber will see during the checkout process and in the notifications.\n                    x-description-i18n:\n                      eng: It is a short description that the subscriber will see during the checkout process and in the notifications.\n                      spa: Es una breve descripción que el suscriptor verá durante el checkout y en las notificaciones.\n                      por: É uma breve descrição que o assinante verá durante o processo de checkout e nas notificações.\n                    example: Yoga classes\n                  external_reference:\n                    type: string\n                    example: 23546246234\n                    description: Reference to sync with your system. This is a free text field to help you with your integration to link the entities.\n                    x-description-i18n:\n                      eng: Reference to sync with your system. This is a free text field to help you with your integration to link the entities.\n                      spa: Referencia para sincronizar con tu sistema. Este es un campo de texto libre para ayudarte con tu integración para vincular las entidades.\n                      por: Referência para sincronizar com seu sistema. Este é um campo de texto livre para ajudar com a integração para vincular as entidades.\n                  currency_id:\n                    type: string\n                    description: ID of the currency used in the payment.\n                    x-description-i18n:\n                      eng: ID of the currency used in the payment.\n                      spa: Identificador de la moneda utilizada en el pago\n                      por: Identificador da moeda utilizada no pagamento\n                    example: ARS\n                    enum:\n                      - ARS -- Argentine peso.\n                      - BRL -- Brazilian real.\n                      - CLP -- Chilean peso.\n                      - MXN -- Mexican peso.\n                      - COP -- Colombian peso.\n                      - PEN -- Peruvian sol.\n                      - UYU -- Uruguayan peso.\n                  transaction_amount:\n                    type: number\n                    description: Amount we will charge on each invoice.\n                    x-description-i18n:\n                      eng: Amount we will charge on each invoice.\n                      spa: Suma que se cobrará en cada factura.\n                      por: Valor que será cobrado em cada fatura.\n                    example: 10\n                  debit_date:\n                    type: date\n                    description: Date on which we will try to make the payment.\n                    x-description-i18n:\n                      eng: Date on which we will try to make the payment.\n                      spa: Fecha en la que intentaremos realizar el pago.\n                      por: Data na qual tentaremos realizar o pagamento.\n                    example: \"2022-01-01T11:12:25.892-04:00\"\n                  retry_attempt:\n                    type: number\n                    description: How many times we try to collect the invoice.\n                    x-description-i18n:\n                      eng: How many times we try to collect the invoice.\n                      spa: Cantidad de veces que intentaremos cobrar la factura.\n                      por: Quantidade de que vezes tentamos cobrar a fatura.\n                    example: 4\n                  status:\n                    type: string\n                    description: Status of the invoice.\n                    x-description-i18n:\n                      eng: Status of the invoice.\n                      spa: Estado de la factura.\n                      por: Status da fatura.\n                    example: scheduled\n                    enum:\n                      - scheduled -- Authorized payment scheduled to collect\n                      - processed -- Authorized payment collected or exceeded retries\n                      - recycling -- Authorized payment in attempt to collect\n                      - cancelled -- Authorized payment canceled\n                  summarized:\n                    type: string\n                    description: Summarization status of the invoice result in the subscription.\n                    x-description-i18n:\n                      eng: Summarization status of the invoice result in the subscription.\n                      spa: Estado de resumen del resultado de la factura en la suscripción.\n                      por: Resumo do status da fatura na assinatura\n                    example: pending\n                    enum:\n                      - pending -- Pending summary in the subscription.\n                      - done -- Summarized result in the subscription.\n                  payment:\n                    type: object\n                    description: Payment status related to the invoice.\n                    x-description-i18n:\n                      eng: Payment status related to the invoice.\n                      spa: Estado de pago relacionado con la factura.\n                      por: Status do pagamento relacionado à fatura.\n                    properties:\n                      id:\n                        type: number\n                        description: Unique payment identifier.\n                        x-description-i18n:\n                          eng: Unique payment identifier.\n                          spa: Identificador único del pago.\n                          por: Identificador único de pagamento.\n                        example: 19951521071\n                      status:\n                        type: string\n                        description: Payment status.\n                        x-description-i18n:\n                          eng: Payment status.\n                          spa: Estado del pago\n                          por: Estado do pagamento\n                        example: approved\n                        enum:\n                          - pending -- The user has not yet completed the payment process\n                          - approved -- The payment has been approved and accredited\n                          - authorized -- The payment has been authorized but not captured yet\n                          - in_process -- Payment is being reviewed\n                          - in_mediation -- Users have initiated a dispute\n                          - rejected -- Payment was rejected. The user may retry payment\n                          - cancelled -- Payment was cancelled by one of the parties or because time for payment has expired\n                          - refunded -- Payment was refunded to the user\n                          - charged_back -- Was made a chargeback in the buyer’s credit card\n                      status_detail:\n                        type: string\n                        description: Payment status detail.\n                        x-description-i18n:\n                          eng: Payment status detail.\n                          spa: Detalle del estado de pago.\n                          por: Detalhe do status de pagamento.\n                        example: accredited\n        '400':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 400--Bad-request--Binding exception, parameters passed are invalid\n        '401':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 401--Unauthorized--Unauthorized access to resource\n        '500':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 500--Error--Internal server error\n  /authorized_payments/search:\n    get:\n      tags:\n        - $ref: \"#/tags/subscriptions\"\n      summary: Search invoices\n      x-summary-i18n:\n        eng: Search invoices\n        spa: Buscar en facturas\n        por: Buscar em faturas\n      description: Search the invoices of a subscriptions by different parameters. You can search by subscription, payment or customer ID\n      x-description-i18n:\n        eng: Search the invoices of a subscriptions by different parameters. You can search by subscription, payment or customer ID\n        spa: Busca las facturas de una suscripción mediante diferentes parámetros. Puedes buscar por suscripción, pago o Customer ID.\n        por: Pesquise as faturas de uma assinatura por diferentes parâmetros. Você pode pesquisar por assinatura, pagamento ou Customer ID.\n      parameters:\n        - name: id\n          in: path\n          description: Unique ID that identifies a invoice.\n          x-description-i18n:\n            eng: Unique ID that identifies a invoice.\n            spa: ID único que identifica una factura.\n            por: ID único que identifica uma fatura.\n          required: true\n          schema:\n            type: number\n            example: 3950169598\n        - name: preapproval_id\n          in: path\n          description: Unique subscription ID to find related invoices.\n          x-description-i18n:\n            eng: Unique subscription ID to find related invoices.\n            spa: ID de suscripción único para encontrar facturas relacionadas.\n            por: ID único de assinatura para encontrar faturas relacionadas.\n          required: true\n          schema:\n            type: string\n            example: 2c938084726fca480172750000000000\n        - name: payment_id\n          in: path\n          description: Unique payment ID to find related invoice.\n          x-description-i18n:\n            eng: Unique payment ID to find related invoice.\n            spa: ID único de pago para encontrar la factura relacionada.\n            por: ID único do pagamento para encontrar faturas relacionadas.\n          required: true\n          schema:\n            type: number\n            example: 12476802073\n        - name: payer_id\n          in: path\n          description: Unique payer ID to find your related invoices.\n          x-description-i18n:\n            eng: Unique payer ID to find your related invoices.\n            spa: ID de pagador único para encontrar sus facturas relacionadas.\n            por: ID único do pagamento para encontrar suas notas relacionadas.\n          required: true\n          schema:\n            type: number\n            example: 1054464758\n        - name: offset\n          in: path\n          description: Specifies the offset of the first item in the collection to return.\n          x-description-i18n:\n            eng: Specifies the offset of the first item in the collection to return.\n            spa: Especifica el offset del primer item de la cobranza a ser retornado.\n            por: Especifica o offset do primeiro item da cobrança a ser retornado.\n          schema:\n            type: number\n            example: 20\n        - name: limit\n          in: path\n          description: Specifies the maximum number of items to return.\n          x-description-i18n:\n            eng: Specifies the maximum number of items to return.\n            spa: Especifica el número máximo de ítems a ser retornados.\n            por: Especifica o número máximo de itens a serem retornados.\n          schema:\n            type: number\n            example: 20\n      responses:\n        '200':\n          description: Success\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  paging:\n                    type: object\n                    description: Information for pagination of search results.\n                    x-description-i18n:\n                      eng: Information for pagination of search results.\n                      spa: Información para paginación de resultados de búsqueda.\n                      por: Informações para paginação dos resultados da pesquisa.\n                    properties:\n                      offset:\n                        type: number\n                        description: The offset of the first item in the collection to return.\n                        x-description-i18n:\n                          eng: The offset of the first item in the collection to return.\n                          spa: El offset del primer ítem del cobro a ser retornado.\n                          por: Offset do primeiro item da cobrança a ser retornado.\n                        example: 0\n                      limit:\n                        type: number\n                        description: The maximum number of entries to return.\n                        x-description-i18n:\n                          eng: The maximum number of entries to return.\n                          spa: El número máximo de entradas a ser retornadas.\n                          por: O número máximo de entradas a serem retornadas.\n                        example: 20\n                      total:\n                        type: number\n                        description:  The total number of items in the collection.\n                        example: 100\n                  results:\n                    type: array\n                    items:\n                      type: object\n                      description: Invoices result item.\n                      x-description-i18n:\n                        eng: Invoices result item.\n                        spa: Elemento de resultado de las facturas.\n                        por: Item de resultado de faturas.\n                      properties:\n                        id:\n                          type: number\n                          description: Unique invoice identifier.\n                          x-description-i18n:\n                            eng: Unique invoice identifier.\n                            spa: Identificador único de factura.\n                            por: Identificador único de fatura\n                          example: 6114264375\n                        type:\n                          type: string\n                          description: Type of invoice generated based on recurrence.\n                          x-description-i18n:\n                            eng: Type of invoice generated based on recurrence.\n                            spa: Tipo de factura generada en base a la recurrencia.\n                            por: Tipo de fatura gerada com base na recorrência.\n                          example: scheduled\n                          enum:\n                            - scheduled -- Automatically generated and scheduled by the recurrence engine\n                        date_created:\n                          type: string\n                          description: Invoice creation date.\n                          x-description-i18n:\n                            eng: Invoice creation date.\n                            spa: Fecha de creación de la factura.\n                            por: Data de criação da fatura.\n                          example: \"2022-01-01T11:12:25.892-04:00\"\n                        last_modified:\n                          type: string\n                          description: Invoice last modified date. An invoice is modified when an update occurs in collection attempts or payment.\n                          x-description-i18n:\n                            eng: Invoice last modified date. An invoice is modified when an update occurs in collection attempts or payment.\n                            spa: Fecha de última modificación de la factura. Una factura se modifica cuando se produce una actualización en los intentos de cobro o pago.\n                            por: Data da última modificação da fatura. Uma fatura é modificada quando ocorre uma atualização nas tentativas de cobrança ou pagamento.\n                          example: \"2022-01-01T11:12:25.892-04:00\"\n                        preapproval_id:\n                          type: string\n                          description: Subscription ID for which the invoice was created.\n                          x-description-i18n:\n                            eng: Subscription ID for which the invoice was created.\n                            spa: ID de suscripción para el que se creó la factura.\n                            por: ID de assinatura para qual a fatura foi criada.\n                          example: 2c938084726fca480172750000000000\n                        reason:\n                          type: string\n                          description: It is a short description that the subscriber will see during the checkout process and in the notifications.\n                          x-description-i18n:\n                            eng: It is a short description that the subscriber will see during the checkout process and in the notifications.\n                            spa: Es una breve descripción que el suscriptor verá durante el checkout y en las notificaciones.\n                            por: É uma breve descrição que o assinante verá durante o processo de checkout e nas notificações.\n                          example: Yoga classes\n                        external_reference:\n                          type: string\n                          example: 23546246234\n                          description: Reference to sync with your system. This is a free text field to help you with your integration to link the entities.\n                          x-description-i18n:\n                            eng: Reference to sync with your system. This is a free text field to help you with your integration to link the entities.\n                            spa: Referencia para sincronizar con tu sistema. Este es un campo de texto libre para ayudarte con tu integración para vincular las entidades.\n                            por: Referência para sincronizar com seu sistema. Este é um campo de texto livre para ajudar com a integração para vincular as entidades.\n                        currency_id:\n                          type: string\n                          description: ID of the currency used in the payment.\n                          x-description-i18n:\n                            eng: ID of the currency used in the payment.\n                            spa: Identificador de la moneda utilizada en el pago\n                            por: Identificador da moeda utilizada no pagamento\n                          example: ARS\n                          enum:\n                            - ARS -- Argentine peso.\n                            - BRL -- Brazilian real.\n                            - CLP -- Chilean peso.\n                            - MXN -- Mexican peso.\n                            - COP -- Colombian peso.\n                            - PEN -- Peruvian sol.\n                            - UYU -- Uruguayan peso.\n                        transaction_amount:\n                          type: number\n                          description: Amount we will charge on each invoice.\n                          x-description-i18n:\n                            eng: Amount we will charge on each invoice.\n                            spa: Suma que se cobrará en cada factura.\n                            por: Valor que será cobrado em cada fatura.\n                          example: 10\n                        debit_date:\n                          type: date\n                          description: Date on which we will try to make the payment.\n                          x-description-i18n:\n                            eng: Date on which we will try to make the payment.\n                            spa: Fecha en la que intentaremos realizar el pago.\n                            por: Data na qual tentaremos realizar o pagamento.\n                          example: \"2022-01-01T11:12:25.892-04:00\"\n                        retry_attempt:\n                          type: number\n                          description: How many times we try to collect the authorized payment.\n                          x-description-i18n:\n                            eng: How many times we try to collect the authorized payment.\n                            spa: Cantidad de veces que intentaremos cobrar el pago autorizado.\n                            por: Quantidade de vezes que tentaremos cobrar o pagamento autorizado.\n                          example: 4\n                        status:\n                          type: string\n                          description: Status of the invoice.\n                          x-description-i18n:\n                            eng: Status of the invoice.\n                            spa: Estado de la factura.\n                            por: Status da fatura.\n                          example: scheduled\n                          enum:\n                            - scheduled -- Authorized payment scheduled to collect\n                            - processed -- Authorized payment collected or exceeded retries\n                            - recycling -- Authorized payment in attempt to collect\n                            - cancelled -- Authorized payment canceled\n                        summarized:\n                          type: string\n                          description: Summarization status of the invoice result in the subscription.\n                          x-description-i18n:\n                            eng: Summarization status of the invoice result in the subscription.\n                            spa: Estado de resumen del resultado de la factura en la suscripción.\n                            por: Resumo do status da fatura na assinatura\n                          example: pending\n                          enum:\n                            - pending -- Pending summary in the subscription.\n                            - done -- Summarized result in the subscription.\n                        payment:\n                          type: object\n                          description: Payment status related to the authorized payment.\n                          properties:\n                            id:\n                              type: number\n                              description: Unique payment identifier.\n                              x-description-i18n:\n                                eng: Unique payment identifier.\n                                spa: Identificador único del pago.\n                                por: Identificador único de pagamento.\n                              example: 19951521071\n                            status:\n                              type: string\n                              description: Payment status.\n                              x-description-i18n:\n                                eng: Payment status.\n                                spa: Estado del pago\n                                por: Estado do pagamento\n                              example: approved\n                              enum:\n                                - pending -- The user has not yet completed the payment process\n                                - approved -- The payment has been approved and accredited\n                                - authorized -- The payment has been authorized but not captured yet\n                                - in_process -- Payment is being reviewed\n                                - in_mediation -- Users have initiated a dispute\n                                - rejected -- Payment was rejected. The user may retry payment\n                                - cancelled -- Payment was cancelled by one of the parties or because time for payment has expired\n                                - refunded -- Payment was refunded to the user\n                                - charged_back -- Was made a chargeback in the buyer’s credit card\n                            status_detail:\n                              type: string\n                              description: Payment status detail.\n                              x-description-i18n:\n                                eng: Payment status detail.\n                                spa: Detalle del estado de pago.\n                                por: Detalhe do status de pagamento.\n                              example: accredited\n        '400':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 400--Bad-request--Search parameters are required\n                      - 400--Bad-request--Binding exception, parameters passed are invalid\n        '401':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 401--Unauthorized--Unauthorized access to resource\n        '500':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 500--Error--Internal server error\n  /preapproval_plan/{id}:\n    get:\n      tags:\n        - $ref: \"#/tags/subscriptions\"\n      summary: Get a subscription plan\n      x-summary-i18n:\n        eng: Get a subscription plan\n        spa: Obtener un plan de suscripción\n        por: Obter plano de assinatura\n      description: Obtains all the information of a plan from its ID\n      x-description-i18n:\n        eng: Obtains all the information of a plan from its ID\n        spa: Obtiene toda la información de un plan a partir de su ID\n        por: Obtenha todas as informações de um plano a partir de seu ID\n      parameters:\n        - name: id\n          in: path\n          description: Subscription plan identifier\n          x-description-i18n:\n            eng: Subscription plan identifier\n            spa: Identificador del plan de suscripción\n            por: Identificador do plano de assinatura\n          required: true\n          schema:\n            type: string\n            example: 2c938084726fca480172750000000000\n      responses:\n        '200':\n          description: Success\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  id:\n                    type: string\n                    example: 2c938084726fca480172750000000000\n                    description: Unique subscription plan identifier.\n                    x-description-i18n:\n                      eng: Unique subscription plan identifier.\n                      spa: Identificador único del plan de suscripción.\n                      por: Identificador único do plano de assinatura\n                  application_id:\n                    type: number\n                    example: 1234567812345678\n                    description: Unique ID that identifies your application/integration. One of the keys in the pair that make up the credentials that identify an application/integration in your account.\n                    x-description-i18n:\n                      eng: Unique ID that identifies your application/integration. One of the keys in the pair that make up the credentials that identify an application/integration in your account.\n                      spa: ID único que identifica tu aplicación/integración. Una de las claves del par que componen las credenciales que identifican una aplicación/integración en tu cuenta.\n                      por: ID único que identifica sua aplicação/integração. Uma das chaves do par que compõe as credenciais que identifica uma aplicação/integração na sua conta.\n                  collector_id:\n                    type: number\n                    example: 100200300\n                    description: Unique ID that identifies your user as a seller. This ID matches your User ID in our ecosystem.\n                    x-description-i18n:\n                      eng: Unique ID that identifies your user as a seller. This ID matches your User ID in our ecosystem.\n                      spa: ID único que identifica a tu usuario como vendedor. Este ID coincide con tu User ID en nuestro ecosistema.\n                      por: ID único que identifica seu usuário como vendedor. Este ID corresponde ao seu User ID em nosso ecossistema. \n                  reason:\n                    type: string\n                    description: It is a short description that the subscriber will see during the checkout process and in the notifications.\n                    x-description-i18n:\n                      eng: It is a short description that the subscriber will see during the checkout process and in the notifications.\n                      spa: Es una breve descripción que el suscriptor verá durante el checkout y en las notificaciones.\n                      por: É uma breve descrição que o assinante verá durante o processo de checkout e nas notificações.\n                    example: Yoga classes\n                  auto_recurring:\n                    type: object\n                    description: Configuration data for recurrence.\n                    x-description-i18n:\n                      eng: Configuration data for recurrence.\n                      spa: Información de configuración para la recurrencia.\n                      por: Configuração da data para recorrência.\n                    properties:\n                      frequency:\n                        type: number\n                        description: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                        x-description-i18n:\n                          eng: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                          spa: Indica el valor de la frecuencia. Junto con frequency_type definen el ciclo de facturación que tendrá una suscripción.\n                          por: Indica o valor de frequência. Junto com frequency_type define o ciclo de cobrança que a assinaturá terá.\n                        example: 1\n                      frequency_type:\n                        type: string\n                        description: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                        x-description-i18n:\n                          eng: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                          spa: Indica el tipo de frecuencia. Junto con frequency definen el ciclo de facturación que tendrá una suscripción.\n                          por: Indica o tipo de frequência. Junto com frequency, definem o ciclo de cobrança que a assinatura terá.\n                        example: months\n                        enum:\n                          - days -- Indicate a frequency in units of days\n                          - months -- Indicate a frequency in units of months\n                      repetitions:\n                        type: number\n                        description: It is optional and is used to create a limited subscription. Indicates the number of times that we will repeat the recurrence cycle. If this param is not defined, subscription does not end until some of the parties cancel it.\n                        x-description-i18n:\n                          eng: It is optional and is used to create a limited subscription. Indicates the number of times that we will repeat the recurrence cycle. If this param is not defined, subscription does not end until some of the parties cancel it.\n                          spa: Es opcional y se utiliza para crear una suscripción limitada. Indica el número de veces que repetiremos el ciclo de recurrencia. Si no se define este param, la suscripción no finaliza hasta que alguna de las partes la cancela.\n                          por: É opcional e utilizado para criar uma assinatura limitada. Indica o número de itens que serão repetidos no ciclo de recorrência. Se este parâmetro não for definido, a assinatura não será finaliza até que uma das partes cancele.\n                        example: 12\n                      billing_day:\n                        type: number\n                        description: Day of the month that the subscription will always be charged. It only accepts values between 1 and 28.\n                        x-description-i18n:\n                          eng: Day of the month that the subscription will always be charged. It only accepts values between 1 and 28.\n                          spa: Día del mes en que siempre se cobrará la suscripción. Solo acepta valores entre 1 y 28.\n                          por: Dia do mês no qual a assinatura será cobrada. Aceita apenas valores entre 1 e 28.\n                        example: 10\n                      billing_day_proportional:\n                        type: boolean\n                        description: Charge a proportional amount to the billing day at the time of registration.\n                        x-description-i18n:\n                          eng: Charge a proportional amount to the billing day at the time of registration.\n                          spa: Cobra una suma proporcional al día de facturación en el momento del registro.\n                          por: Cobra um valor proporcional ao dia do faturamento no momento do cadastro.\n                        example: true\n                        enum:\n                          - true -- Charge a proportional amount based on the days remaining in the next billing cycle. Billing cycles are always calculated on a 30-day basis.\n                          - false -- Charge the amount of the subscription regardless of when in the billing cycle customer subscribe.\n                      free_trial:\n                        type: object\n                        description: Free trial data.\n                        x-description-i18n:\n                          eng: Free trial data.\n                          spa: Información sobre prueba gratuita.\n                          por: Informação de teste grátis\n                        properties:\n                          frequency:\n                            type: number\n                            description: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                            x-description-i18n:\n                              eng: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                              spa: Indica el valor de la frecuencia. Junto con frequency_type definen el ciclo de facturación que tendrá una suscripción.\n                              por: Indica o valor de frequência. Junto com frequency_type define o ciclo de cobrança que a assinaturá terá.\n                            example: 7\n                          frequency_type:\n                            type: string\n                            description: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                            x-description-i18n:\n                              eng: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                              spa: Indica el tipo de frecuencia. Junto con frequency definen el ciclo de facturación que tendrá una suscripción.\n                              por: Indica o tipo de frequência. Junto com frequency, definem o ciclo de cobrança que a assinatura terá.\n                            example: months\n                            enum:\n                              - days -- Indicate a frequency in units of days\n                              - months -- Indicate a frequency in units of months\n                          first_invoice_offset:\n                            type: number\n                            description: Number of days to collect the first invoice\n                            x-description-i18n:\n                              eng: Number of days to collect the first invoice\n                              spa: Número de días para cobrar la primera factura\n                              por: Número de dias para cobrar a primeira fatura\n                            example: 7\n                      transaction_amount:\n                        type: number\n                        description: Amount we will charge on each invoice.\n                        x-description-i18n:\n                          eng: Amount we will charge on each invoice.\n                          spa: Suma que se cobrará en cada factura.\n                          por: Valor que será cobrado em cada fatura.\n                        example: 10\n                      currency_id:\n                        type: string\n                        description: ID of the currency used in the payment.\n                        x-description-i18n:\n                          eng: ID of the currency used in the payment.\n                          spa: Identificador de la moneda utilizada en el pago\n                          por: Identificador da moeda utilizada no pagamento\n                        example: ARS\n                        enum:\n                          - ARS -- Argentine peso.\n                          - BRL -- Brazilian real.\n                          - CLP -- Chilean peso.\n                          - MXN -- Mexican peso.\n                          - COP -- Colombian peso.\n                          - PEN -- Peruvian sol.\n                          - UYU -- Uruguayan peso.\n                  payment_methods_allowed:\n                    type: object\n                    description: Payment methods enabled at checkout.\n                    x-description-i18n:\n                      eng: Payment methods enabled at checkout.\n                      spa: Métodos de pago habilitados en el checkout.\n                      por: Meios de pagamento habilitados no checkout.\n                    properties:\n                      payment_types:\n                        type: array\n                        description: Payment types allowed in the payment flow.\n                        x-description-i18n:\n                          eng: Payment types allowed in the payment flow.\n                          spa: Tipos de pago permitidos en el flujo de pago.\n                          por: Tipos de pagamento permitidos no fluxo de pagamento.\n                        properties:\n                          id:\n                            type: string\n                            description: Payment type identifier.\n                            x-description-i18n:\n                              eng: Payment type identifier.\n                              spa: Identificador de tipo de pago.\n                              por: Identificador do tipo de pagamento.\n                            example: credit_card\n                      payment_methods:\n                        type: array\n                        description: Payment methods allowed in the payment flow.\n                        x-description-i18n:\n                          eng: Payment methods allowed in the payment flow.\n                          spa: Métodos de pago permitidos en el flujo de pago.\n                          por: Meios de pagamento permitidos no fluxo de pagamento.\n                        properties:\n                          id:\n                            type: string\n                            description: Payment method identifier.\n                            x-description-i18n:\n                              eng: Payment method identifier.\n                              spa: Identificador del medio de pago\n                              por: Id do meio de pagamento\n                            example: bolbradesco\n                    back_url:\n                      type: string\n                      description: Successful return URL. Use this setting to redirect your customers to your site after our checkout.\n                      x-description-i18n:\n                        eng: Successful return URL. Use this setting to redirect your customers to your site after our checkout.\n                        spa: URL de retorno exitosa. Use esta configuración para redirigir a tus clientes a su sitio después de nuestro checkout.\n                        por: URL de retorno de sucesso. Use esta configuração para redirecionar seus clientes para o seu site após o checkout.\n                      example: https://www.mercadopago.com.ar\n                  back_url:\n                    type: string\n                    description: Successful return URL. Use this setting to redirect your customers to your site after our checkout.\n                    x-description-i18n:\n                      eng: Successful return URL. Use this setting to redirect your customers to your site after our checkout.\n                      spa: URL de retorno exitosa. Use esta configuración para redirigir a tus clientes a su sitio después de nuestro checkout.\n                      por: URL de retorno de sucesso. Use esta configuração para redirecionar seus clientes para o seu site após o checkout.\n                    example: https://www.mercadopago.com.ar\n                  external_reference:\n                    type: string\n                    example: \"23546246234\"\n                    description: Reference to sync with your system. This is a free text field to help you with your integration to link the entities.\n                    x-description-i18n:\n                      eng: Reference to sync with your system. This is a free text field to help you with your integration to link the entities.\n                      spa: Referencia para sincronizar con tu sistema. Este es un campo de texto libre para ayudarte con tu integración para vincular las entidades.\n                      por: Referência para sincronizar com seu sistema. Este é um campo de texto livre para ajudar com a integração para vincular as entidades.\n                  init_point:\n                    type: string\n                    example: https://www.mercadopago.com.ar/subscriptions/checkout?preapproval_plan_id=2c938084726fca480172750000000000\n                    description: URL to start the subscription flow\n                    x-description-i18n:\n                      eng: URL to start the subscription flow\n                      spa: URL para comenzar el flujo de suscripción\n                      por: URL para iniciar o fluxo de assinatura\n                  date_created:\n                    type: string\n                    example: \"2022-01-01T11:12:25.892-04:00\"\n                    description: Creation date\n                    x-description-i18n:\n                      eng: Creation date\n                      spa: Fecha de creación\n                      por: Data de criação\n                  last_modified:\n                    type: string\n                    example: \"2022-01-01T11:12:25.892-04:00\"\n                    description: Date of last modification\n                    x-description-i18n:\n                      eng: Date of last modification\n                      spa: Fecha de última modificación.\n                      por: Data da última modificação.\n                  status:\n                    type: string\n                    example: active\n                    description: Status of the plan.\n                    x-description-i18n:\n                      eng: Status of the plan.\n                      spa: Estado del plan.\n                      por: Status do plano.\n                    enum:\n                      - active -- Plan available to create subscriptions\n                      - cancelled -- Plan not available to create subscriptions       \n        '401':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 401--Unauthorized--Unauthorized access to resource\n        '404':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 404--Not-found--The template with id {id} does not exist\n        '500':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 500--Error--Internal server error\n    put:\n      tags:\n        - $ref: \"#/tags/subscriptions\"\n      summary: Update a subscription plan\n      x-summary-i18n:\n        eng: Update a subscription plan\n        spa: Actualizar plan de suscripción\n        por: Atualizar um plano de assinatura\n      description: Renew the data of a plan. Indicate the plan ID and send the body with the information you want to update\n      x-description-i18n:\n        eng: Renew the data of a plan. Indicate the plan ID and send the body with the information you want to update\n        spa: Actualiza los datos de un plan. Indica el plan ID y envía el body con la información que deseas actualizar\n        por: Atualizar os dados de um plano. Indique o Plan ID e envie o body com as informações que deseja atualizar\n      parameters:\n        - name: id\n          in: path\n          description: Subscription plan identifier\n          x-description-i18n:\n            eng: Subscription plan identifier\n            spa: Identificador del plan de suscripción\n            por: Identificador do plano de assinatura\n          required: true\n          schema:\n            type: string\n            example: 2c938084726fca480172750000000000\n      requestBody:\n        content:\n          application/json:\n            schema:\n              type: object\n              properties:\n                reason:\n                  type: string\n                  description: It is a short description that the subscriber will see during the checkout process and in the notifications.\n                  x-description-i18n:\n                    eng: It is a short description that the subscriber will see during the checkout process and in the notifications.\n                    spa: Es una breve descripción que el suscriptor verá durante el checkout y en las notificaciones.\n                    por: É uma breve descrição que o assinante verá durante o processo de checkout e nas notificações.\n                  example: Yoga classes\n                auto_recurring:\n                  type: object\n                  description: Configuration data for recurrence.\n                  x-description-i18n:\n                    eng: Configuration data for recurrence.\n                    spa: Información de configuración para la recurrencia.\n                    por: Configuração da data para recorrência.\n                  properties:\n                    frequency:\n                      type: number\n                      description: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                      x-description-i18n:\n                        eng: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                        spa: Indica el valor de la frecuencia. Junto con frequency_type definen el ciclo de facturación que tendrá una suscripción.\n                        por: Indica o valor de frequência. Junto com frequency_type define o ciclo de cobrança que a assinaturá terá.\n                      example: 1\n                    frequency_type:\n                      required: true\n                      type: string\n                      description: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                      x-description-i18n:\n                        eng: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                        spa: Indica el tipo de frecuencia. Junto con frequency definen el ciclo de facturación que tendrá una suscripción.\n                        por: Indica o tipo de frequência. Junto com frequency, definem o ciclo de cobrança que a assinatura terá.\n                      example: months\n                      enum:\n                        - days -- Indicate a frequency in units of days\n                        - months -- Indicate a frequency in units of months\n                    repetitions:\n                      type: number\n                      description: It is optional and is used to create a limited subscription. Indicates the number of times that we will repeat the recurrence cycle. If this param is not defined, subscription does not end until some of the parties cancel it.\n                      x-description-i18n:\n                        eng: It is optional and is used to create a limited subscription. Indicates the number of times that we will repeat the recurrence cycle. If this param is not defined, subscription does not end until some of the parties cancel it.\n                        spa: Es opcional y se utiliza para crear una suscripción limitada. Indica el número de veces que repetiremos el ciclo de recurrencia. Si no se define este param, la suscripción no finaliza hasta que alguna de las partes la cancela.\n                        por: É opcional e utilizado para criar uma assinatura limitada. Indica o número de itens que serão repetidos no ciclo de recorrência. Se este parâmetro não for definido, a assinatura não será finaliza até que uma das partes cancele.\n                      example: 12\n                    billing_day:\n                      type: number\n                      description: Day of the month that the subscription will always be charged. It only accepts values between 1 and 28.\n                      x-description-i18n:\n                        eng: Day of the month that the subscription will always be charged. It only accepts values between 1 and 28.\n                        spa: Día del mes en que siempre se cobrará la suscripción. Solo acepta valores entre 1 y 28.\n                        por: Dia do mês no qual a assinatura será cobrada. Aceita apenas valores entre 1 e 28.\n                      example: 10\n                    billing_day_proportional:\n                      type: boolean\n                      description: Charge a proportional amount to the billing day at the time of registration.\n                      x-description-i18n:\n                        eng: Charge a proportional amount to the billing day at the time of registration.\n                        spa: Cobra una suma proporcional al día de facturación en el momento del registro.\n                        por: Cobra um valor proporcional ao dia do faturamento no momento do cadastro.\n                      example: true\n                      enum:\n                        - true -- Charge a proportional amount based on the days remaining in the next billing cycle. Billing cycles are always calculated on a 30-day basis.\n                        - false -- Charge the amount of the subscription regardless of when in the billing cycle customer subscribe.\n                    free_trial:\n                      type: object\n                      description: Free trial data.\n                      x-description-i18n:\n                        eng: Free trial data.\n                        spa: Información sobre prueba gratuita.\n                        por: Informação de teste grátis\n                      properties:\n                        frequency:\n                          type: number\n                          description: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                          x-description-i18n:\n                            eng: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                            spa: Indica el valor de la frecuencia. Junto con frequency_type definen el ciclo de facturación que tendrá una suscripción.\n                            por: Indica o valor de frequência. Junto com frequency_type define o ciclo de cobrança que a assinaturá terá.\n                          example: 1\n                        frequency_type:\n                          required: true\n                          type: string\n                          description: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                          x-description-i18n:\n                            eng: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                            spa: Indica el tipo de frecuencia. Junto con frequency definen el ciclo de facturación que tendrá una suscripción.\n                            por: Indica o tipo de frequência. Junto com frequency, definem o ciclo de cobrança que a assinatura terá.\n                          example: months\n                          enum:\n                            - days -- Indicate a frequency in units of days\n                            - months -- Indicate a frequency in units of months\n                    transaction_amount:\n                      type: number\n                      description: Amount we will charge on each invoice.\n                      x-description-i18n:\n                        eng: Amount we will charge on each invoice.\n                        spa: Suma que se cobrará en cada factura.\n                        por: Valor que será cobrado em cada fatura.\n                      example: 10\n                    currency_id:\n                      type: string\n                      description: ID of the currency used in the payment.\n                      x-description-i18n:\n                        eng: ID of the currency used in the payment.\n                        spa: Identificador de la moneda utilizada en el pago\n                        por: Identificador da moeda utilizada no pagamento\n                      example: ARS\n                      enum:\n                        - ARS -- Argentine peso.\n                        - BRL -- Brazilian real.\n                        - CLP -- Chilean peso.\n                        - MXN -- Mexican peso.\n                        - COP -- Colombian peso.\n                        - PEN -- Peruvian sol.\n                        - UYU -- Uruguayan peso.\n                payment_methods_allowed:\n                  type: object\n                  description: Payment methods enabled at checkout.\n                  x-description-i18n:\n                    eng: Payment methods enabled at checkout.\n                    spa: Métodos de pago habilitados en el checkout.\n                    por: Meios de pagamento habilitados no checkout.\n                  properties:\n                    payment_types:\n                      type: array\n                      description: Payment types allowed in the payment flow.\n                      x-description-i18n:\n                        eng: Payment types allowed in the payment flow.\n                        spa: Tipos de pago permitidos en el flujo de pago.\n                        por: Tipos de pagamento permitidos no fluxo de pagamento.\n                      properties:\n                        id:\n                          type: string\n                          description: Payment type identifier.\n                          x-description-i18n:\n                            eng: Payment type identifier.\n                            spa: Identificador de tipo de pago.\n                            por: Identificador do tipo de pagamento.\n                          example: credit_card\n                    payment_methods:\n                      type: array\n                      description: Payment methods allowed in the payment flow.\n                      x-description-i18n:\n                        eng: Payment methods allowed in the payment flow.\n                        spa: Métodos de pago permitidos en el flujo de pago.\n                        por: Meios de pagamento permitidos no fluxo de pagamento.\n                      properties:\n                        id:\n                          type: string\n                          description: Payment method identifier.\n                          x-description-i18n:\n                            eng: Payment method identifier.\n                            spa: Identificador del medio de pago\n                            por: Id do meio de pagamento\n                          example: bolbradesco\n                back_url:\n                  type: string\n                  description: Successful return URL. Use this setting to redirect your customers to your site after our checkout.\n                  x-description-i18n:\n                    eng: Successful return URL. Use this setting to redirect your customers to your site after our checkout.\n                    spa: URL de retorno exitosa. Use esta configuración para redirigir a tus clientes a su sitio después de nuestro checkout.\n                    por: URL de retorno de sucesso. Use esta configuração para redirecionar seus clientes para o seu site após o checkout.\n                  example: https://www.yoursite.com\n      responses:\n        '200':\n          description: Success\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  id:\n                    type: string\n                    example: 2c938084726fca480172750000000000\n                    description: Unique subscription plan identifier.\n                    x-description-i18n:\n                      eng: Unique subscription plan identifier.\n                      spa: Identificador único del plan de suscripción.\n                      por: Identificador único do plano de assinatura\n                  application_id:\n                    type: number\n                    example: 1234567812345678\n                    description: Unique ID that identifies your application/integration. One of the keys in the pair that make up the credentials that identify an application/integration in your account.\n                    x-description-i18n:\n                      eng: Unique ID that identifies your application/integration. One of the keys in the pair that make up the credentials that identify an application/integration in your account.\n                      spa: ID único que identifica tu aplicación/integración. Una de las claves del par que componen las credenciales que identifican una aplicación/integración en tu cuenta.\n                      por: ID único que identifica sua aplicação/integração. Uma das chaves do par que compõe as credenciais que identifica uma aplicação/integração na sua conta.\n                  collector_id:\n                    type: number\n                    example: 100200300\n                    description: Unique ID that identifies your user as a seller. This ID matches your User ID in our ecosystem.\n                    x-description-i18n:\n                      eng: Unique ID that identifies your user as a seller. This ID matches your User ID in our ecosystem.\n                      spa: ID único que identifica a tu usuario como vendedor. Este ID coincide con tu User ID en nuestro ecosistema.\n                      por: ID único que identifica seu usuário como vendedor. Este ID corresponde ao seu User ID em nosso ecossistema. \n                  reason:\n                    type: string\n                    description: It is a short description that the subscriber will see during the checkout process and in the notifications.\n                    x-description-i18n:\n                      eng: It is a short description that the subscriber will see during the checkout process and in the notifications.\n                      spa: Es una breve descripción que el suscriptor verá durante el checkout y en las notificaciones.\n                      por: É uma breve descrição que o assinante verá durante o processo de checkout e nas notificações.\n                    example: Yoga classes\n                  auto_recurring:\n                    type: object\n                    description: Configuration data for recurrence.\n                    x-description-i18n:\n                      eng: Configuration data for recurrence.\n                      spa: Información de configuración para la recurrencia.\n                      por: Configuração da data para recorrência.\n                    properties:\n                      frequency:\n                        type: number\n                        description: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                        x-description-i18n:\n                          eng: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                          spa: Indica el valor de la frecuencia. Junto con frequency_type definen el ciclo de facturación que tendrá una suscripción.\n                          por: Indica o valor de frequência. Junto com frequency_type define o ciclo de cobrança que a assinaturá terá.\n                        example: 1\n                      frequency_type:\n                        type: string\n                        description: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                        x-description-i18n:\n                          eng: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                          spa: Indica el tipo de frecuencia. Junto con frequency definen el ciclo de facturación que tendrá una suscripción.\n                          por: Indica o tipo de frequência. Junto com frequency, definem o ciclo de cobrança que a assinatura terá.\n                        example: months\n                        enum:\n                          - days -- Indicate a frequency in units of days\n                          - months -- Indicate a frequency in units of months\n                      repetitions:\n                        type: number\n                        description: It is optional and is used to create a limited subscription. Indicates the number of times that we will repeat the recurrence cycle. If this param is not defined, subscription does not end until some of the parties cancel it.\n                        x-description-i18n:\n                          eng: It is optional and is used to create a limited subscription. Indicates the number of times that we will repeat the recurrence cycle. If this param is not defined, subscription does not end until some of the parties cancel it.\n                          spa: Es opcional y se utiliza para crear una suscripción limitada. Indica el número de veces que repetiremos el ciclo de recurrencia. Si no se define este param, la suscripción no finaliza hasta que alguna de las partes la cancela.\n                          por: É opcional e utilizado para criar uma assinatura limitada. Indica o número de itens que serão repetidos no ciclo de recorrência. Se este parâmetro não for definido, a assinatura não será finaliza até que uma das partes cancele.\n                        example: 12\n                      billing_day:\n                        type: number\n                        description: Day of the month that the subscription will always be charged. It only accepts values between 1 and 28.\n                        x-description-i18n:\n                          eng: Day of the month that the subscription will always be charged. It only accepts values between 1 and 28.\n                          spa: Día del mes en que siempre se cobrará la suscripción. Solo acepta valores entre 1 y 28.\n                          por: Dia do mês no qual a assinatura será cobrada. Aceita apenas valores entre 1 e 28.\n                        example: 10\n                      billing_day_proportional:\n                        type: boolean\n                        description: Charge a proportional amount to the billing day at the time of registration.\n                        x-description-i18n:\n                          eng: Charge a proportional amount to the billing day at the time of registration.\n                          spa: Cobra una suma proporcional al día de facturación en el momento del registro.\n                          por: Cobra um valor proporcional ao dia do faturamento no momento do cadastro.\n                        example: true\n                        enum:\n                          - true -- Charge a proportional amount based on the days remaining in the next billing cycle. Billing cycles are always calculated on a 30-day basis.\n                          - false -- Charge the amount of the subscription regardless of when in the billing cycle customer subscribe.\n                      free_trial:\n                        type: object\n                        description: Free trial data.\n                        x-description-i18n:\n                          eng: Free trial data.\n                          spa: Información sobre prueba gratuita.\n                          por: Informação de teste grátis\n                        properties:\n                          frequency:\n                            type: number\n                            description: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                            x-description-i18n:\n                              eng: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                              spa: Indica el valor de la frecuencia. Junto con frequency_type definen el ciclo de facturación que tendrá una suscripción.\n                              por: Indica o valor de frequência. Junto com frequency_type define o ciclo de cobrança que a assinaturá terá.\n                            example: 7\n                          frequency_type:\n                            type: string\n                            description: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                            x-description-i18n:\n                              eng: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                              spa: Indica el tipo de frecuencia. Junto con frequency definen el ciclo de facturación que tendrá una suscripción.\n                              por: Indica o tipo de frequência. Junto com frequency, definem o ciclo de cobrança que a assinatura terá.\n                            example: months\n                            enum:\n                              - days -- Indicate a frequency in units of days\n                              - months -- Indicate a frequency in units of months\n                          first_invoice_offset:\n                            type: number\n                            description: Number of days to collect the first invoice\n                            x-description-i18n:\n                              eng: Number of days to collect the first invoice\n                              spa: Número de días para cobrar la primera factura\n                              por: Número de dias para cobrar a primeira fatura\n                            example: 7\n                      transaction_amount:\n                        type: number\n                        description: Amount we will charge on each invoice.\n                        x-description-i18n:\n                          eng: Amount we will charge on each invoice.\n                          spa: Suma que se cobrará en cada factura.\n                          por: Valor que será cobrado em cada fatura.\n                        example: 10\n                      currency_id:\n                        type: string\n                        description: ID of the currency used in the payment.\n                        x-description-i18n:\n                          eng: ID of the currency used in the payment.\n                          spa: Identificador de la moneda utilizada en el pago\n                          por: Identificador da moeda utilizada no pagamento\n                        example: ARS\n                        enum:\n                          - ARS -- Argentine peso.\n                          - BRL -- Brazilian real.\n                          - CLP -- Chilean peso.\n                          - MXN -- Mexican peso.\n                          - COP -- Colombian peso.\n                          - PEN -- Peruvian sol.\n                          - UYU -- Uruguayan peso.\n                  payment_methods_allowed:\n                    type: object\n                    description: Payment methods enabled at checkout.\n                    x-description-i18n:\n                      eng: Payment methods enabled at checkout.\n                      spa: Métodos de pago habilitados en el checkout.\n                      por: Meios de pagamento habilitados no checkout.\n                    properties:\n                      payment_types:\n                        type: array\n                        description: Payment types allowed in the payment flow.\n                        x-description-i18n:\n                          eng: Payment types allowed in the payment flow.\n                          spa: Tipos de pago permitidos en el flujo de pago.\n                          por: Tipos de pagamento permitidos no fluxo de pagamento.\n                        properties:\n                          id:\n                            type: string\n                            description: Payment type identifier.\n                            x-description-i18n:\n                              eng: Payment type identifier.\n                              spa: Identificador de tipo de pago.\n                              por: Identificador do tipo de pagamento.\n                            example: credit_card\n                      payment_methods:\n                        type: array\n                        description: Payment methods allowed in the payment flow.\n                        x-description-i18n:\n                          eng: Payment methods allowed in the payment flow.\n                          spa: Métodos de pago permitidos en el flujo de pago.\n                          por: Meios de pagamento permitidos no fluxo de pagamento.\n                        properties:\n                          id:\n                            type: string\n                            description: Payment method identifier.\n                            x-description-i18n:\n                              eng: Payment method identifier.\n                              spa: Identificador del medio de pago\n                              por: Id do meio de pagamento\n                            example: bolbradesco\n                    back_url:\n                      type: string\n                      description: Successful return URL. Use this setting to redirect your customers to your site after our checkout.\n                      x-description-i18n:\n                        eng: Successful return URL. Use this setting to redirect your customers to your site after our checkout.\n                        spa: URL de retorno exitosa. Use esta configuración para redirigir a tus clientes a su sitio después de nuestro checkout.\n                        por: URL de retorno de sucesso. Use esta configuração para redirecionar seus clientes para o seu site após o checkout.\n                      example: https://www.mercadopago.com.ar\n                  back_url:\n                    type: string\n                    description: Successful return URL. Use this setting to redirect your customers to your site after our checkout.\n                    x-description-i18n:\n                      eng: Successful return URL. Use this setting to redirect your customers to your site after our checkout.\n                      spa: URL de retorno exitosa. Use esta configuración para redirigir a tus clientes a su sitio después de nuestro checkout.\n                      por: URL de retorno de sucesso. Use esta configuração para redirecionar seus clientes para o seu site após o checkout.\n                    example: https://www.mercadopago.com.ar\n                  external_reference:\n                    type: string\n                    example: \"23546246234\"\n                    description: Reference to sync with your system. This is a free text field to help you with your integration to link the entities.\n                    x-description-i18n:\n                      eng: Reference to sync with your system. This is a free text field to help you with your integration to link the entities.\n                      spa: Referencia para sincronizar con tu sistema. Este es un campo de texto libre para ayudarte con tu integración para vincular las entidades.\n                      por: Referência para sincronizar com seu sistema. Este é um campo de texto livre para ajudar com a integração para vincular as entidades.\n                  init_point:\n                    type: string\n                    example: https://www.mercadopago.com.ar/subscriptions/checkout?preapproval_plan_id=2c938084726fca480172750000000000\n                    description: URL to start the subscription flow\n                    x-description-i18n:\n                      eng: URL to start the subscription flow\n                      spa: URL para comenzar el flujo de suscripción\n                      por: URL para iniciar o fluxo de assinatura\n                  date_created:\n                    type: string\n                    example: \"2022-01-01T11:12:25.892-04:00\"\n                    description: Creation date\n                    x-description-i18n:\n                      eng: Creation date\n                      spa: Fecha de creación\n                      por: Data de criação\n                  last_modified:\n                    type: string\n                    example: \"2022-01-01T11:12:25.892-04:00\"\n                    description: Date of last modification\n                    x-description-i18n:\n                      eng: Date of last modification\n                      spa: Fecha de última modificación.\n                      por: Data da última modificação.\n                  status:\n                    type: string\n                    example: active\n                    description: status\n                    enum:\n                      - active -- Plan available to create subscriptions\n                      - cancelled -- Plan not available to create subscriptions  \n        '400':\n          description: Bad request\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                     - 400--Bad-Request--Check the parameters of the body\n        '401':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 401--Unauthorized--Unauthorized access to resource\n        '404':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 404--Not-found--The template with id {id} does not exist\n        '500':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 500--Error--Internal server error\n  /preapproval_plan/search:\n    get:\n      tags:\n        - $ref: \"#/tags/subscriptions\"\n      summary: Search subscription plans\n      x-summary-i18n:\n        eng: Search subscription plans\n        spa: Buscar en planes de suscripción\n        por: Buscar planos de assinatura\n      description: Search for subscription plans by different parameters\n      x-description-i18n:\n        eng: Search for subscription plans by different parameters\n        spa: Buscar planes de suscripción por diferentes parámetros\n        por: Buscar planos de assinatura a partir de diferentes parâmetros\n      parameters:\n        - name: status\n          in: path\n          description: Specifies the status of the plan you want to get.\n          x-description-i18n:\n            eng: Specifies the status of the plan you want to get.\n            spa: Especifica el estado del plan que deseas obtener.\n            por: Especifica o status do plano que você deseja obter.\n          schema:\n            type: string\n            example: active\n        - name: q\n          in: path\n          description: Free search field.\n          x-description-i18n:\n            eng: Free search field.\n            spa: Campo de búsqueda libre.\n            por: Campo de busca livre.\n          schema:\n            type: string\n            example: Plan gold\n        - name: sort\n          in: path\n          description: Specifies the name of the field by which the results are to be sorted according to a criteria.\n          x-description-i18n:\n            eng: Specifies the name of the field by which the results are to be sorted according to a criteria.\n            spa: Especifica el nombre del campo por el que se ordenarán los resultados según un criterio.\n            por: Especifica o nome do campo pelo qual os resultados devem ser classificados de acordo com um critério.\n          schema:\n            type: string\n            example: date_created\n        - name: criteria\n          in: path\n          description: Specifies the order criteria of the results.\n          x-description-i18n:\n            eng: Specifies the order criteria of the results.\n            spa: Especifica los criterios de orden de los resultados.\n            por: Especifica o critério de ordem dos resultados.\n          schema:\n            type: string\n            example: asc\n            enum:\n              - asc -- Ascending sort\n              - desc -- Descending sort\n        - name: offset\n          in: path\n          description: Specifies the offset of the first item in the collection to return.\n          x-description-i18n:\n            eng: Specifies the offset of the first item in the collection to return.\n            spa: Especifica el offset del primer item de la cobranza a ser retornado.\n            por: Especifica o offset do primeiro item da cobrança a ser retornado.\n          schema:\n            type: number\n            example: 20\n        - name: limit\n          in: path\n          description: Specifies the maximum number of items to return.\n          x-description-i18n:\n            eng: Specifies the maximum number of items to return.\n            spa: Especifica el número máximo de ítems a ser retornados.\n            por: Especifica o número máximo de itens a serem retornados.\n          schema:\n            type: number\n            example: 20\n      responses:\n        '200':\n          description: Success\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  paging:\n                    type: object\n                    description: Information for pagination of search results.\n                    x-description-i18n:\n                      eng: Information for pagination of search results.\n                      spa: Información para paginación de resultados de búsqueda.\n                      por: Informações para paginação dos resultados da pesquisa.\n                    properties:\n                      offset:\n                        type: number\n                        description: The offset of the first item in the collection to return.\n                        x-description-i18n:\n                          eng: The offset of the first item in the collection to return.\n                          spa: El offset del primer ítem del cobro a ser retornado.\n                          por: Offset do primeiro item da cobrança a ser retornado.\n                        example: 0\n                      limit:\n                        type: number\n                        description: The maximum number of entries to return.\n                        x-description-i18n:\n                          eng: The maximum number of entries to return.\n                          spa: El número máximo de entradas a ser retornadas.\n                          por: O número máximo de entradas a serem retornadas.\n                        example: 20\n                      total:\n                        type: number\n                        description:  The total number of items in the collection.\n                        example: 100\n                  results:\n                    type: array\n                    description: The page of items. This will be an empty array if there are no results.\n                    x-description-i18n:\n                      eng: The page of items. This will be an empty array if there are no results.\n                      spa: La página de ítems. Esta será un array vacío si no hay resultados.\n                      por: Página de ítens. Caso não retorne resultados, será um array vazio.\n                    items:\n                      type: object\n                      description: Plan result item.\n                      x-description-i18n:\n                        eng: Plan result item.\n                        spa: Item de resultado de plan.\n                        por: Ítem de resultado do plano.\n                      properties:\n                        id:\n                          type: string\n                          example: 2c938084726fca480172750000000000\n                          description: Unique subscription plan identifier.\n                          x-description-i18n:\n                            eng: Unique subscription plan identifier.\n                            spa: Identificador único del plan de suscripción.\n                            por: Identificador único do plano de assinatura\n                        application_id:\n                          type: number\n                          example: 1234567812345678\n                          description: Unique ID that identifies your application/integration. One of the keys in the pair that make up the credentials that identify an application/integration in your account.\n                          x-description-i18n:\n                            eng: Unique ID that identifies your application/integration. One of the keys in the pair that make up the credentials that identify an application/integration in your account.\n                            spa: ID único que identifica tu aplicación/integración. Una de las claves del par que componen las credenciales que identifican una aplicación/integración en tu cuenta.\n                            por: ID único que identifica sua aplicação/integração. Uma das chaves do par que compõe as credenciais que identifica uma aplicação/integração na sua conta.\n                        collector_id:\n                          type: number\n                          example: 100200300\n                          description: Unique ID that identifies your user as a seller. This ID matches your User ID in our ecosystem.\n                          x-description-i18n:\n                            eng: Unique ID that identifies your user as a seller. This ID matches your User ID in our ecosystem.\n                            spa: ID único que identifica a tu usuario como vendedor. Este ID coincide con tu User ID en nuestro ecosistema.\n                            por: ID único que identifica seu usuário como vendedor. Este ID corresponde ao seu User ID em nosso ecossistema. \n                        reason:\n                          type: string\n                          description: It is a short description that the subscriber will see during the checkout process and in the notifications.\n                          x-description-i18n:\n                            eng: It is a short description that the subscriber will see during the checkout process and in the notifications.\n                            spa: Es una breve descripción que el suscriptor verá durante el checkout y en las notificaciones.\n                            por: É uma breve descrição que o assinante verá durante o processo de checkout e nas notificações.\n                          example: Yoga classes\n                        auto_recurring:\n                          type: object\n                          description: Configuration data for recurrence.\n                          x-description-i18n:\n                            eng: Configuration data for recurrence.\n                            spa: Información de configuración para la recurrencia.\n                            por: Configuração da data para recorrência.\n                          properties:\n                            frequency:\n                              type: number\n                              description: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                              x-description-i18n:\n                                eng: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                                spa: Indica el valor de la frecuencia. Junto con frequency_type definen el ciclo de facturación que tendrá una suscripción.\n                                por: Indica o valor de frequência. Junto com frequency_type define o ciclo de cobrança que a assinaturá terá.\n                              example: 1\n                            frequency_type:\n                              type: string\n                              description: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                              x-description-i18n:\n                                eng: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                                spa: Indica el tipo de frecuencia. Junto con frequency definen el ciclo de facturación que tendrá una suscripción.\n                                por: Indica o tipo de frequência. Junto com frequency, definem o ciclo de cobrança que a assinatura terá.\n                              example: months\n                              enum:\n                                - days -- Indicate a frequency in units of days\n                                - months -- Indicate a frequency in units of months\n                            repetitions:\n                              type: number\n                              description: It is optional and is used to create a limited subscription. Indicates the number of times that we will repeat the recurrence cycle. If this param is not defined, subscription does not end until some of the parties cancel it.\n                              x-description-i18n:\n                                eng: It is optional and is used to create a limited subscription. Indicates the number of times that we will repeat the recurrence cycle. If this param is not defined, subscription does not end until some of the parties cancel it.\n                                spa: Es opcional y se utiliza para crear una suscripción limitada. Indica el número de veces que repetiremos el ciclo de recurrencia. Si no se define este param, la suscripción no finaliza hasta que alguna de las partes la cancela.\n                                por: É opcional e utilizado para criar uma assinatura limitada. Indica o número de itens que serão repetidos no ciclo de recorrência. Se este parâmetro não for definido, a assinatura não será finaliza até que uma das partes cancele.\n                              example: 12\n                            billing_day:\n                              type: number\n                              description: Day of the month that the subscription will always be charged. It only accepts values between 1 and 28.\n                              x-description-i18n:\n                                eng: Day of the month that the subscription will always be charged. It only accepts values between 1 and 28.\n                                spa: Día del mes en que siempre se cobrará la suscripción. Solo acepta valores entre 1 y 28.\n                                por: Dia do mês no qual a assinatura será cobrada. Aceita apenas valores entre 1 e 28.\n                              example: 10\n                            billing_day_proportional:\n                              type: boolean\n                              description: Charge a proportional amount to the billing day at the time of registration.\n                              x-description-i18n:\n                                eng: Charge a proportional amount to the billing day at the time of registration.\n                                spa: Cobra una suma proporcional al día de facturación en el momento del registro.\n                                por: Cobra um valor proporcional ao dia do faturamento no momento do cadastro.\n                              example: true\n                              enum:\n                                - true -- Charge a proportional amount based on the days remaining in the next billing cycle. Billing cycles are always calculated on a 30-day basis.\n                                - false -- Charge the amount of the subscription regardless of when in the billing cycle customer subscribe.\n                            free_trial:\n                              type: object\n                              description: Free trial data.\n                              x-description-i18n:\n                                eng: Free trial data.\n                                spa: Información sobre prueba gratuita.\n                                por: Informação de teste grátis\n                              properties:\n                                frequency:\n                                  type: number\n                                  description: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                                  x-description-i18n:\n                                    eng: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                                    spa: Indica el valor de la frecuencia. Junto con frequency_type definen el ciclo de facturación que tendrá una suscripción.\n                                    por: Indica o valor de frequência. Junto com frequency_type define o ciclo de cobrança que a assinaturá terá.\n                                  example: 7\n                                frequency_type:\n                                  type: string\n                                  description: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                                  x-description-i18n:\n                                    eng: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                                    spa: Indica el tipo de frecuencia. Junto con frequency definen el ciclo de facturación que tendrá una suscripción.\n                                    por: Indica o tipo de frequência. Junto com frequency, definem o ciclo de cobrança que a assinatura terá.\n                                  example: months\n                                  enum:\n                                    - days -- Indicate a frequency in units of days\n                                    - months -- Indicate a frequency in units of months\n                                first_invoice_offset:\n                                  type: number\n                                  description: Number of days to collect the first invoice.\n                                  example: 7\n                            transaction_amount:\n                              type: number\n                              description: Amount we will charge on each invoice.\n                              x-description-i18n:\n                                eng: Amount we will charge on each invoice.\n                                spa: Suma que se cobrará en cada factura.\n                                por: Valor que será cobrado em cada fatura.\n                              example: 10\n                            currency_id:\n                              type: string\n                              description: ID of the currency used in the payment.\n                              x-description-i18n:\n                                eng: ID of the currency used in the payment.\n                                spa: Identificador de la moneda utilizada en el pago\n                                por: Identificador da moeda utilizada no pagamento\n                              example: ARS\n                              enum:\n                                - ARS -- Argentine peso.\n                                - BRL -- Brazilian real.\n                                - CLP -- Chilean peso.\n                                - MXN -- Mexican peso.\n                                - COP -- Colombian peso.\n                                - PEN -- Peruvian sol.\n                                - UYU -- Uruguayan peso.\n                        payment_methods_allowed:\n                          type: object\n                          description: Payment methods enabled at checkout.\n                          x-description-i18n:\n                            eng: Payment methods enabled at checkout.\n                            spa: Métodos de pago habilitados en el checkout.\n                            por: Meios de pagamento habilitados no checkout.\n                          properties:\n                            payment_types:\n                              type: array\n                              description: Payment types allowed in the payment flow.\n                              x-description-i18n:\n                                eng: Payment types allowed in the payment flow.\n                                spa: Tipos de pago permitidos en el flujo de pago.\n                                por: Tipos de pagamento permitidos no fluxo de pagamento.\n                              properties:\n                                id:\n                                  type: string\n                                  description: Payment type identifier.\n                                  x-description-i18n:\n                                    eng: Payment type identifier.\n                                    spa: Identificador de tipo de pago.\n                                    por: Identificador do tipo de pagamento.\n                                  example: credit_card\n                            payment_methods:\n                              type: array\n                              description: Payment methods allowed in the payment flow.\n                              x-description-i18n:\n                                eng: Payment methods allowed in the payment flow.\n                                spa: Métodos de pago permitidos en el flujo de pago.\n                                por: Meios de pagamento permitidos no fluxo de pagamento.\n                              properties:\n                                id:\n                                  type: string\n                                  description: Payment method identifier.\n                                  x-description-i18n:\n                                    eng: Payment method identifier.\n                                    spa: Identificador del medio de pago\n                                    por: Id do meio de pagamento\n                                  example: bolbradesco\n                          back_url:\n                            type: string\n                            description: Successful return URL. Use this setting to redirect your customers to your site after our checkout.\n                            x-description-i18n:\n                              eng: Successful return URL. Use this setting to redirect your customers to your site after our checkout.\n                              spa: URL de retorno exitosa. Use esta configuración para redirigir a tus clientes a su sitio después de nuestro checkout.\n                              por: URL de retorno de sucesso. Use esta configuração para redirecionar seus clientes para o seu site após o checkout.\n                            example: https://www.mercadopago.com.ar\n                        back_url:\n                          type: string\n                          description: Successful return URL. Use this setting to redirect your customers to your site after our checkout.\n                          x-description-i18n:\n                            eng: Successful return URL. Use this setting to redirect your customers to your site after our checkout.\n                            spa: URL de retorno exitosa. Use esta configuración para redirigir a tus clientes a su sitio después de nuestro checkout.\n                            por: URL de retorno de sucesso. Use esta configuração para redirecionar seus clientes para o seu site após o checkout.\n                          example: https://www.mercadopago.com.ar\n                        external_reference:\n                          type: string\n                          example: \"23546246234\"\n                          description: Reference to sync with your system. This is a free text field to help you with your integration to link the entities.\n                          x-description-i18n:\n                            eng: Reference to sync with your system. This is a free text field to help you with your integration to link the entities.\n                            spa: Referencia para sincronizar con tu sistema. Este es un campo de texto libre para ayudarte con tu integración para vincular las entidades.\n                            por: Referência para sincronizar com seu sistema. Este é um campo de texto livre para ajudar com a integração para vincular as entidades.\n                        init_point:\n                          type: string\n                          example: https://www.mercadopago.com.ar/subscriptions/checkout?preapproval_plan_id=2c938084726fca480172750000000000\n                          description: URL to start the subscription flow\n                          x-description-i18n:\n                            eng: URL to start the subscription flow\n                            spa: URL para comenzar el flujo de suscripción\n                            por: URL para iniciar o fluxo de assinatura\n                        date_created:\n                          type: string\n                          example: \"2022-01-01T11:12:25.892-04:00\"\n                          description: Creation date\n                          x-description-i18n:\n                            eng: Creation date\n                            spa: Fecha de creación\n                            por: Data de criação\n                        last_modified:\n                          type: string\n                          example: \"2022-01-01T11:12:25.892-04:00\"\n                          description: Date of last modification\n                          x-description-i18n:\n                            eng: Date of last modification\n                            spa: Fecha de última modificación.\n                            por: Data da última modificação.\n                        subscribed:\n                          type: number\n                          description: Number of customers subscribed to the plan.\n                          x-description-i18n:\n                            eng: Number of customers subscribed to the plan.\n                            spa: Número de clientes suscritos al plan.\n                            por: Número de clientes que assinaram o plano.\n                          example: 50\n                        status:\n                          type: string\n                          example: active\n                          description: Status of the plan.\n                          x-description-i18n:\n                            eng: Status of the plan.\n                            spa: Estado del plan.\n                            por: Status do plano.\n                          enum:\n                            - active -- Plan available to create subscriptions\n                            - cancelled -- Plan not available to create subscriptions\n        '400':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 400--Bad-request--Search parameters are required\n                      - 400--Bad-request--Binding exception, parameters passed are invalid\n                      - 400--Bad-request--Invalid status value. Valid status are active, cancelled\n        '401':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 401--Unauthorized--Unauthorized access to resource\n        '500':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 500--Error--Internal server error\n  /preapproval/search:\n    get:\n      tags:\n        - $ref: \"#/tags/subscriptions\"\n      summary: Search subscriptions\n      x-summary-i18n:\n        eng: Search subscriptions\n        spa: Buscar en suscripciones\n        por: Buscar assinaturas\n      description: Search for subscriptions by using different parameters\n      x-description-i18n:\n        eng: Search for subscriptions by using different parameters\n        spa: Buscar suscripciones usando diferentes parámetros\n        por: Buscar assinaturas utilizando diferentes parâmetros\n      parameters:\n        - name: q\n          in: path\n          description: Free search field.\n          x-description-i18n:\n            eng: Free search field.\n            spa: Campo de búsqueda libre.\n            por: Campo de busca livre.\n          schema:\n            type: string\n            example: Plan gold\n        - name: payer_id\n          in: path\n          description: Unique customer ID to find related subscriptions.\n          x-description-i18n:\n            eng: Unique customer ID to find related subscriptions.\n            spa: Customer ID único para encontrar suscripciones relacionadas.\n            por: Customer ID único para encontrar assinaturas relacionadas.\n          schema:\n            type: number\n            example: 123123123\n        - name: payer_email\n          in: path\n          description: Allows you to search for subscriptions registered with this email.\n          x-description-i18n:\n            eng: Allows you to search for subscriptions registered with this email.\n            spa: Te permite buscar suscripciones registradas con este correo electrónico.\n            por: Permite encontrar assinaturas registradas com este e-mail.\n          schema:\n            type: string\n            example: test_1234@testuser.com\n        - name: preapproval_plan_id\n          in: path\n          description: Specifies a plan ID for filtering results from the search.\n          x-description-i18n:\n            eng: Specifies a plan ID for filtering results from the search.\n            spa: Especifica un plan ID para filtrar los resultados de la búsqueda.\n            por: Especifica um plan ID para filtrar os resultados da pesquisa.\n          schema:\n            type: string\n            example: 2c938084726fca480172750000000000\n        - name: transaction_amount\n          in: path\n          description: Specifies a subscription amount for filtering results from the search.\n          x-description-i18n:\n            eng: Specifies a subscription amount for filtering results from the search.\n            spa: Especifica un monto de suscripción para filtrar los resultados de la búsqueda.\n            por: Especifica um valor de assinatura para filtrar os resultados da pesquisa.\n          schema:\n            type: number\n            example: 1000\n        - name: semaphore\n          in: path\n          description: Specifies the control status of the subscription.\n          x-description-i18n:\n            eng: Specifies the control status of the subscription.\n            spa: Especifica el estado de control de la suscripción.\n            por: Especifica o status de controle da assinatura.\n          schema:\n            type: string\n            example: green\n            enum:\n              - green -- All collections made.\n              - yellow -- With collection problems. We are trying to collect an invoice.\n              - red -- With pending collections. An invoice could not be collected.\n              - blank -- Discounted collection.\n        - name: status\n          in: path\n          description: Specifies a status for filtering results from the export. Can be null, one or many.\n          x-description-i18n:\n            eng: Specifies a status for filtering results from the export. Can be null, one or many.\n            spa: Especifica un estado para filtrar los resultados de la exportación. Puede ser null, uno o muchos.Subscription without a payment method.\n            por: Especifica um status para filtrar os resultados da exportação. Pode ser null, um ou muitos.\n          schema:\n            type: string\n            example: authorized,cancelled,paused\n            enum:\n              - pending -- Preapproval without a payment method.\n              - authorized -- Preapproval with a valid payment method.\n              - paused -- Preapproval with temporally discontinued collection of payments.\n              - cancelled -- Preapproval terminated. This is an irreversible state.\n        - name: sort\n          in: path\n          description: Specifies the type of sorting selected to retrieve the subscriptions. You must indicate a field and a sort type with the following format field_name:sort_type.\n          x-description-i18n:\n            eng: Specifies the type of sorting selected to retrieve the subscriptions. You must indicate a field and a sort type with the following format field_name:sort_type.\n            spa: Especifica el tipo de clasificación seleccionado para recuperar las suscripciones. Debes indicar un campo y un tipo de clasificación con el siguiente formato ield_name:sort_type.\n            por: Especifica o tipo de classificação selecionado para recuperar as assinaturas. Você deve indicar um campo e um tipo de classificação com o seguinte formato field_name:sort_type.\n          schema:\n            type: string\n            example: payer_id:asc\n            enum:\n              - asc -- Ascending sort\n              - desc -- Descending sort\n        - name: offset\n          in: path\n          description: Specifies the offset of the first item in the collection to return.\n          x-description-i18n:\n            eng: Specifies the offset of the first item in the collection to return.\n            spa: Especifica el offset del primer item de la cobranza a ser retornado.\n            por: Especifica o offset do primeiro item da cobrança a ser retornado.\n          schema:\n            type: number\n            example: 20\n        - name: limit\n          in: path\n          description: Specifies the maximum number of items to return.\n          x-description-i18n:\n            eng: Specifies the maximum number of items to return.\n            spa: Especifica el número máximo de ítems a ser retornados.\n            por: Especifica o número máximo de itens a serem retornados.\n          schema:\n            type: number\n            example: 20\n      responses:\n        '200':\n          description: Success\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  paging:\n                    type: object\n                    description: Information for pagination of search results.\n                    x-description-i18n:\n                      eng: Information for pagination of search results.\n                      spa: Información para paginación de resultados de búsqueda.\n                      por: Informações para paginação dos resultados da pesquisa.\n                    properties:\n                      offset:\n                        type: number\n                        description: The offset of the first item in the collection to return.\n                        x-description-i18n:\n                          eng: The offset of the first item in the collection to return.\n                          spa: El offset del primer ítem del cobro a ser retornado.\n                          por: Offset do primeiro item da cobrança a ser retornado.\n                        example: 0\n                      limit:\n                        type: number\n                        description: The maximum number of entries to return.\n                        x-description-i18n:\n                          eng: The maximum number of entries to return.\n                          spa: El número máximo de entradas a ser retornadas.\n                          por: O número máximo de entradas a serem retornadas.\n                        example: 20\n                      total:\n                        type: number\n                        description:  The total number of items in the collection.\n                        example: 100\n                  results:\n                    type: array\n                    description: The page of items. This will be an empty array if there are no results.\n                    x-description-i18n:\n                      eng: The page of items. This will be an empty array if there are no results.\n                      spa: La página de ítems. Esta será un array vacío si no hay resultados.\n                      por: Página de ítens. Caso não retorne resultados, será um array vazio.\n                    items:\n                      type: object\n                      description: Subscription result item.\n                      properties:\n                        id:\n                          type: string\n                          example: '2c938084726fca480172750000000000'\n                          description: Unique subscription identifier.\n                          x-description-i18n:\n                            eng: Unique subscription identifier.\n                            spa: Identificador único de suscripción.\n                            por: Identificador único de assinatura\n                        version:\n                          type: number\n                          example: 0\n                          description: Indicates how many times the subscription was modified\n                          x-description-i18n:\n                            eng: Indicates how many times the subscription was modified\n                            spa: Indica cuántas veces se modificó la suscripción\n                            por: Indica quantas vezes uma assinatura foi modificada\n                        application_id:\n                          type: number\n                          example: 1234567812345678\n                          description: Unique ID that identifies your application/integration. One of the keys in the pair that make up the credentials that identify an application/integration in your account.\n                          x-description-i18n:\n                            eng: Unique ID that identifies your application/integration. One of the keys in the pair that make up the credentials that identify an application/integration in your account.\n                            spa: ID único que identifica tu aplicación/integración. Una de las claves del par que componen las credenciales que identifican una aplicación/integración en tu cuenta.\n                            por: ID único que identifica sua aplicação/integração. Uma das chaves do par que compõe as credenciais que identifica uma aplicação/integração na sua conta.\n                        collector_id:\n                          type: number\n                          example: 100200300\n                          description: Unique ID that identifies your user as a seller. This ID matches your User ID in our ecosystem.\n                          x-description-i18n:\n                            eng: Unique ID that identifies your user as a seller. This ID matches your User ID in our ecosystem.\n                            spa: ID único que identifica a tu usuario como vendedor. Este ID coincide con tu User ID en nuestro ecosistema.\n                            por: ID único que identifica seu usuário como vendedor. Este ID corresponde ao seu User ID em nosso ecossistema. \n                        preapproval_plan_id:\n                          type: string\n                          description: Unique subscription plan identifier. This parameter is only available when it is a subscription with a plan and indicates from which plan the subscription was created.\n                          x-description-i18n:\n                            eng: Unique subscription plan identifier. This parameter is only available when it is a subscription with a plan and indicates from which plan the subscription was created.\n                            spa: Identificador único del plan de suscripción. Este parámetro solo está disponible cuando se trata de una suscripción con plan asociado e indica desde qué plan se creó la suscripción.\n                            por: Identificador único de plano de assinatura. Este parâmetro só está disponível quando se trata de uma assinatura com um plano associado e indica a partir de qual plano a assinatura foi criada. \n                          example: 2c938084726fca480172750000000000\n                        reason:\n                          type: string\n                          example: Yoga classes.\n                          description: It is a short description that the subscriber will see during the checkout process and in the notifications. It is only required for subscriptions without a plan.\n                          x-description-i18n:\n                            eng: It is a short description that the subscriber will see during the checkout process and in the notifications. It is only required for subscriptions without a plan.\n                            spa: Es una breve descripción que el suscriptor verá durante el proceso de checkout y en las notificaciones. Solo se requiere para suscripciones sin plan asociado.\n                            por: É uma breve descrição que o assinante verá durante o processo de checkout e nas notificações. É obrigatório apenas para assinaturas sem plano associado.\n                        external_reference:\n                          type: string\n                          example: 23546246234\n                          description: Reference to sync with your system. This is a free text field to help you with your integration to link the entities.\n                          x-description-i18n:\n                            eng: Reference to sync with your system. This is a free text field to help you with your integration to link the entities.\n                            spa: Referencia para sincronizar con tu sistema. Este es un campo de texto libre para ayudarte con tu integración para vincular las entidades.\n                            por: Referência para sincronizar com seu sistema. Este é um campo de texto livre para ajudar com a integração para vincular as entidades.\n                        back_url:\n                          type: string\n                          example: https://www.mercadopago.com.ar\n                          description: Successful return URL. Use this setting to redirect your customers to your site after our checkout.\n                          x-description-i18n:\n                            eng: Successful return URL. Use this setting to redirect your customers to your site after our checkout.\n                            spa: URL de retorno exitosa. Use esta configuración para redirigir a tus clientes a su sitio después de nuestro checkout.\n                            por: URL de retorno de sucesso. Use esta configuração para redirecionar seus clientes para o seu site após o checkout.\n                        init_point:\n                          type: string\n                          example: https://www.mercadopago.com.ar/subscriptions/checkout?preapproval_id=2c938084726fca480172750000000000\n                          description: URL to checkout to add or modify payment method.\n                          x-description-i18n:\n                            eng: URL to checkout to add or modify payment method.\n                            spa: URL al checkout para agregar o modificar el método de pago.\n                            por: URL para o checkout para adicionar ou modificar um meio de pagamento.\n                        auto_recurring:\n                          type: object\n                          description: Configuration data for recurrence.\n                          x-description-i18n:\n                            eng: Configuration data for recurrence.\n                            spa: Información de configuración para la recurrencia.\n                            por: Configuração da data para recorrência.\n                          properties:\n                            frequency:\n                              type: number\n                              description: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                              x-description-i18n:\n                                eng: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                                spa: Indica el valor de la frecuencia. Junto con frequency_type definen el ciclo de facturación que tendrá una suscripción.\n                                por: Indica o valor de frequência. Junto com frequency_type define o ciclo de cobrança que a assinaturá terá.\n                              example: 1\n                            frequency_type:\n                              type: string\n                              description: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                              x-description-i18n:\n                                eng: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                                spa: Indica el tipo de frecuencia. Junto con frequency definen el ciclo de facturación que tendrá una suscripción.\n                                por: Indica o tipo de frequência. Junto com frequency, definem o ciclo de cobrança que a assinatura terá.\n                              example: months\n                              enum:\n                                - days -- Indicate a frequency in units of days\n                                - months -- Indicate a frequency in units of months\n                            start_date:\n                              type: string\n                              format: date\n                              description: Date from which the subscription will be active and we start collecting invoices.\n                              x-description-i18n:\n                                eng: Date from which the subscription will be active and we start collecting invoices.\n                                spa: Fecha a partir de la cual la suscripción estará activa y se empiezan a cobrar las facturas.\n                                por: Data que indica o momento em que a assinatura será ativada e começará a cobrança das faturas.\n                              example: \"2020-06-02T13:07:14.260Z\"\n                            end_date:\n                              type: string\n                              format: date\n                              description: Date until which the subscription will be active and we will stop charging invoices.\n                              x-description-i18n:\n                                eng: Date until which the subscription will be active and we will stop charging invoices.\n                                spa: Fecha hasta la cual la suscripción estará activa y se dejan de cobrar las facturas.\n                                por: Data que indica o fim da assinatura e o momento em que a cobrança não será mais realizada.\n                              example: \"2022-07-20T15:59:52.581Z\"\n                            currency_id:\n                              type: string\n                              description: ID of the currency used in the payment.\n                              x-description-i18n:\n                                eng: ID of the currency used in the payment.\n                                spa: Identificador de la moneda utilizada en el pago\n                                por: Identificador da moeda utilizada no pagamento\n                              example: ARS\n                              enum:\n                                - ARS -- Argentine peso.\n                                - BRL -- Brazilian real.\n                                - CLP -- Chilean peso.\n                                - MXN -- Mexican peso.\n                                - COP -- Colombian peso.\n                                - PEN -- Peruvian sol.\n                                - UYU -- Uruguayan peso.\n                            transaction_amount:\n                              type: number\n                              description: Amount we will charge on each invoice.\n                              x-description-i18n:\n                                eng: Amount we will charge on each invoice.\n                                spa: Suma que se cobrará en cada factura.\n                                por: Valor que será cobrado em cada fatura.\n                              example: 10\n                            free_trial:\n                              type: object\n                              description: Free trial data.\n                              x-description-i18n:\n                                eng: Free trial data.\n                                spa: Información sobre prueba gratuita.\n                                por: Informação de teste grátis\n                              properties:\n                                frequency:\n                                  type: number\n                                  description: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                                  x-description-i18n:\n                                    eng: Indicates the frequency value. Together with frequency_type they define the invoice cycle that a subscription will have.\n                                    spa: Indica el valor de la frecuencia. Junto con frequency_type definen el ciclo de facturación que tendrá una suscripción.\n                                    por: Indica o valor de frequência. Junto com frequency_type define o ciclo de cobrança que a assinaturá terá.\n                                  example: 1\n                                frequency_type:\n                                  type: string\n                                  description: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                                  x-description-i18n:\n                                    eng: Indicates the type of frequency. Together with frequency they define the invoice cycle that a subscription will have.\n                                    spa: Indica el tipo de frecuencia. Junto con frequency definen el ciclo de facturación que tendrá una suscripción.\n                                    por: Indica o tipo de frequência. Junto com frequency, definem o ciclo de cobrança que a assinatura terá.\n                                  example: months\n                                  enum:\n                                    - days -- Indicate a frequency in units of days\n                                    - months -- Indicate a frequency in units of months\n                        first_invoice_offset:\n                          type: number\n                          description: Number of days to collect the first invoice\n                          x-description-i18n:\n                            eng: Number of days to collect the first invoice\n                            spa: Número de días para cobrar la primera factura\n                            por: Número de dias para cobrar a primeira fatura\n                          example: 7\n                        payer_id:\n                          type: number\n                          example: 123123123\n                          description: Unique customer identifier. This is created from the email you used to create the subscription.\n                          x-description-i18n:\n                            eng: Unique customer identifier. This is created from the email you used to create the subscription.\n                            spa: Identificador único de cliente. Se crea a partir del correo electrónico que utilizaste para crear la suscripción.\n                            por: Identificador único do cliente. É criado a partir do e-mail utilizado para criar a assinatura.\n                        payer_first_name:\n                          type: string\n                          description: Customer name.\n                          x-description-i18n:\n                            eng: Customer name.\n                            spa: Nombre del cliente.\n                            por: Nome do cliente.\n                          example: Jorge\n                        payer_last_name:\n                          type: string\n                          description: Customer lastname.\n                          x-description-i18n:\n                            eng: Customer lastname.\n                            spa: Apellido del cliente.\n                            por: Sobrenome do cliente\n                          example: Smith\n                        card_id:\n                          type: number\n                          example: 123123123\n                          description: Unique identifier to retrieve data from the card used as a payment method.\n                          x-description-i18n:\n                            eng: Unique identifier to retrieve data from the card used as a payment method.\n                            spa: Identificador único para recuperar datos de la tarjeta utilizada como medio de pago.\n                            por: Identificador único para recuperar dados do cartão utilizado como meio de pagamento.\n                        payment_method_id:\n                          type: string\n                          example: account_money\n                          description: Payment method configured.\n                          x-description-i18n:\n                            eng: Payment method configured.\n                            spa: Método de pago configurado.\n                            por: Meio de pagamento configurado.\n                        next_payment_date:\n                          type: string\n                          example: \"2022-01-01T11:12:25.892-04:00\"\n                          description: Date of the next payment debit.\n                          x-description-i18n:\n                            eng: Date of the next payment debit.\n                            spa: Fecha del próximo débito.\n                            por: Data do próximo débito.\n                        date_created:\n                          type: string\n                          example: \"2022-01-01T11:12:25.892-04:00\"\n                          description: Creation date\n                          x-description-i18n:\n                            eng: Creation date\n                            spa: Fecha de creación\n                            por: Data de criação\n                        last_modified:\n                          type: string\n                          example: \"2022-01-01T11:12:25.892-04:00\"\n                          description: Date of last modification\n                          x-description-i18n:\n                            eng: Date of last modification\n                            spa: Fecha de última modificación.\n                            por: Data da última modificação.\n                        summarized:\n                          type: object\n                          description: Summary information on subscription invoices and charges\n                          x-description-i18n:\n                            eng: Summary information on subscription invoices and charges\n                            spa: Información resumida sobre facturas y cargos de suscripción\n                            por: Informações resumidas sobre faturas e cobranças de assinatura\n                          properties:\n                            quotas:\n                              type: number\n                              description: How many payments are going to be made.\n                              x-description-i18n:\n                                eng: How many payments are going to be made.\n                                spa: Cantidad de pagos que se realizarán.\n                                por: Quantos pagamentos serão feitos.\n                              example: 6\n                            charged_quantity:\n                              type: number\n                              description: Total charged of charged quotas.\n                              x-description-i18n:\n                                eng: Total charged of charged quotas.\n                                spa: Total cobrado de cuotas.\n                                por: Total cobrado de parcelas\n                              example: 3\n                            charged_amount:\n                              type: number\n                              description: Total amount collected to date.\n                              x-description-i18n:\n                                eng: Total amount collected to date.\n                                spa: Importe total recaudado hasta la fecha.\n                                por: Valor total cobrado até o momento.\n                              example: 1000.00\n                            pending_charge_quantity:\n                              type: number\n                              description: Pending quotas to charge.\n                              x-description-i18n:\n                                eng: Pending quotas to charge.\n                                spa: Cuotas pendientes a ser cobradas.\n                                por: Parcelas pendentes a serem cobradas.\n                              example: 1\n                            pending_charge_amount:\n                              type: number\n                              description: Amount pending collection.\n                              x-description-i18n:\n                                eng: Amount pending collection.\n                                spa: Importe pendiente de cobro.\n                                por: Valor pendente de cobrança\n                              example: 200.00\n                            last_charged_date:\n                              type: number\n                              description: Date of last charge.\n                              x-description-i18n:\n                                eng: Date of last charge.\n                                spa: Fecha de último cobro.\n                                por: Data da última cobrança.\n                              example: \"2022-01-01T11:12:25.892-04:00\"\n                            last_charged_amount:\n                              type: number\n                              description: Date of last charged amount.\n                              x-description-i18n:\n                                eng: Date of last charged amount.\n                                spa: Fecha de último importe cobrado.\n                                por: Data do último valor cobrado.\n                              example: 100.00\n                            semaphore:\n                              type: number\n                              description: Subscription collection status summary.\n                              x-description-i18n:\n                                eng: Subscription collection status summary.\n                                spa: Resumen del estado de la cobranza de suscripciones.\n                                por: Resumo do status de cobrança de assinaturas.\n                              example: green\n                              enum:\n                                - green -- All collections made.\n                                - yellow -- With collection problems. We are trying to collect an invoice.\n                                - red -- With pending collections. An invoice could not be collected.\n                                - blank -- Discounted collection.\n                        status:\n                          type: string\n                          example: pending\n                          description: Status\n                          enum:\n                            - pending -- Preapproval without a payment method.\n                            - authorized -- Preapproval with a valid payment method.\n                            - paused -- Preapproval with temporally discontinued collection of payments.\n                            - cancelled -- Preapproval terminated. This is an irreversible state.\n        '400':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 400--Bad-request--Search parameters are required\n                      - 400--Bad-request--Binding exception, parameters passed are invalid\n        '401':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 401--Unauthorized--Unauthorized access to resource\n        '500':\n          description: Error\n          x-description-i18n:\n            eng: Error\n            spa: Error\n            por: Erro\n          content:\n            application/json:\n              schema:\n                type: object\n                properties:\n                  errorKey:\n                    type: string\n                    enum:\n                      - 500--Error--Internal server error  ",
			"canonicalURL": "/github.com/mercadopago/devsite-docs@20069589158195c9fbaaeb1dcc49d3aee817599f/-/blob/reference/api/subscriptions.yaml",
			"externalURLs": [
				{
					"url": "https://github.com/mercadopago/devsite-docs/blob/20069589158195c9fbaaeb1dcc49d3aee817599f/reference/api/subscriptions.yaml",
					"serviceKind": "GITHUB"
				}
			]
		}
	},
	"Error": "unmarshal: yaml: unmarshal errors:\n  yaml: line 1: cannot unmarshal !!map into string; yaml: line 1: cannot unmarshal !!map into string; yaml: line 1: cannot unmarshal !!bool `true` into []string; yaml: line 1: cannot unmarshal !!map into string; yaml: line 1: cannot unmarshal !!bool `true` into []string; yaml: line 1: cannot unmarshal !!map into string; yaml: line 1: cannot unmarshal !!map into string; yaml: line 1: cannot unmarshal !!map into string; yaml: line 1: cannot unmarshal !!map into string; yaml: line 1: cannot unmarshal !!bool `true` into []string; yaml: line 1: cannot unmarshal !!map into string; yaml: line 1: cannot unmarshal !!map into string; yaml: line 1: cannot unmarshal !!map into string; yaml: line 1: cannot unmarshal !!bool `true` into []string; yaml: line 1: cannot unmarshal !!map into string"
}