{
	"File": {
		"__typename": "FileMatch",
		"repository": {
			"name": "github.com/APIs-guru/openapi-directory"
		},
		"file": {
			"name": "openapi.yaml",
			"size": 0,
			"path": "APIs/bluemix.net/containers/3.0.0/openapi.yaml",
			"byteSize": 179707,
			"content": "openapi: 3.0.0\nservers:\n  - url: https://containers-api.ng.bluemix.net/v3\ninfo:\n  description: |-\n    Containers are virtual software objects that include all the elements that an app needs to run. A container has the benefits of resource isolation and allocation but is more portable and efficient than, for example, a virtual machine.\n\n     This documentation describes the IBM Containers API, which is based on the Docker Remote API. The API provides endpoints that you can use to create and manage your single containers and container groups in Bluemix. Endpoints are summarized under the following tags: \n\n    - **Authentication**: Retrieve and refresh your TLS certificates. \n    - **Private Docker images registry**: Create your own private Docker images registry in Bluemix by setting a namespace for your organization. \n    - **Images**: View, build, and push your images to your private Bluemix registry so you can use them with IBM Containers. You can also scan your container images with the Vulnerability Advisor against standard policies set by the organization manager and a database of known Ubuntu issues. \n    - **Single Containers**: Create and manage single containers in Bluemix. Use a single container to implement short-lived processes or to run simple tests as you develop an app or service. To make your single container available from the internet, review the `Public IP addresses` endpoints. \n    - **Container Groups**: Create and manage your container groups in Bluemix. A container group consists of multiple single containers that are all created from the same container image and as a consequence are configured in the same way. Container groups offer further options at no cost to make your app highly available. These options include in-built load balancing, auto-recovery of unhealthy container instances, and auto-scaling of container instances based on CPU and memory usage. Map a public route to your container group to make your app accessible from the internet.  \n    - **Public IP addresses**: Use these endpoints to request public IP addresses for your space. You can bind this IP address to your container to make your container accessible from the internet. \n    - **File shares**: Create, list and delete file shares in a space. A file share is a NFS storage system that hosts Docker volumes.  \n    - **Volumes**: Create and manage container volumes in your space to persist the data of your containers.  \n\n\n     Each API request requires an HTTP header that includes the 'X-Auth-Token’ and 'X-Auth-Project-Id’ parameter. \n\n    - **X-Auth-Token**: The JSON web token (JWT) that you receive when logging into the Bluemix platform. It allows you to use the IBM Containers REST API, access services, and resources. Run `cf oauth-token` to retrieve your access token information.\n    - **X-Auth-Project-Id**: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n\n\n     For further information about how containers work in the IBM Containers service, review the documentation under https://new-console.ng.bluemix.net/docs/containers/container_index.html. \n  license:\n    name: (C) Copyright IBM Corp. 2016 All Rights Reserved.\n  title: IBM Containers API\n  version: 3.0.0\n  x-apisguru-categories:\n    - developer_tools\n  x-logo:\n    url: https://twitter.com/IBMCloud/profile_image?size=original\n  x-origin:\n    - format: openapi\n      url: http://ccsapi-doc.mybluemix.net/swagger.json\n      version: \"3.0\"\n  x-providerName: bluemix.net\n  x-serviceName: containers\npaths:\n  /build:\n    post:\n      description: |-\n        This API builds a new container image from a Dockerfile that is stored on your local machine and pushes the image to the private Bluemix registry (corresponding IBM Containers command: `cf ic build`).\n\n         To push an image to your Bluemix registry, a namespace must be set for the organization. Run `cf ic namespace get` or call the `GET /registry/namespaces` API to check if a namespace is already set. If not, run `cf ic namespace set NAMESPACE` or call the `PUT /registry/namespaces/{namespace}` API to set a namespace for your organization.\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n        - description: \"Tag the image with the full path to your private Bluemix registry in the following format: `t=registry.ng.bluemix.net/\u003cnamespace\u003e/\u003cimage_name\u003e:\u003ctag\u003e`. This path is used to push the image to the private Bluemix registry after it is built.\"\n          in: query\n          name: t\n          required: true\n          schema:\n            type: string\n        - description: You can choose whether or not to show the verbose build output to review every step during the container image build. If you set the query parameter to `q=false`, `q=False`, or `q=0`, the verbose build output is suppressed. To show the verbose build output, enter `q=true`, `q=True`, or `q=1`.\n          in: query\n          name: q\n          required: false\n          schema:\n            type: boolean\n        - description: If you set the query parameter to `nocache=true`, `nocache=True`, or `nocache=1`, the cache will not be used to build your image. To use the cache, enter `nocache=false`, `nocache=False`, or `nocache=0`.\n          in: query\n          name: nocache\n          required: false\n          schema:\n            type: boolean\n        - description: If set to pull=true, pull=True, or pull=1, then a newer version of the image is always attempted to be pulled even though an older version of the image exists locally. If set to pull=false, pull=False, or pull=0, then the local image will be used if one exists.\n          in: query\n          name: pull\n          required: false\n          schema:\n            type: boolean\n      requestBody:\n        content:\n          application/tar:\n            schema:\n              format: binary\n              type: string\n        description: Must be the content of a tar archive compressed with gzip. The archive must include a file called 'Dockerfile' at its root. It may include any number of other files which will be accessible in the build context.\n        required: true\n      responses:\n        \"200\":\n          description: OK. The container image was built successfully and pushed to your private Bluemix repository. The build output stream is returned in JSON format.\n        \"400\":\n          description: Bad request. Your could not be processed. Be sure to include the `t` query parameter to tag your image and that your Dockerfile has been tar archived with gzip.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"500\":\n          description: Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support.\n      summary: Build a Docker image from a Dockerfile\n      tags:\n        - Images\n  /containers/create:\n    post:\n      description: |-\n        This endpoint creates and starts a single container in your space based on the Docker image that is specified in the Image field of the request json. A single container in IBM Containers is similar to a container that you create in your local Docker environment. Single containers are a good way to start with IBM Containers and to learn about how containers work in the IBM Cloud and the features that IBM Containers provides. They are also recommended when you want to run simple app tests or during the development process of an app. \n\n         In the Docker API there are two separate APIs to create and start a container. However in IBM Containers a container is created and started in a single API call. Therefore, this API merges parameters from the Docker API to create and start container. \n\n         To create a container with IBM Containers, you must at least define the image that the container is based on.\n\n        - Image: You must include the full path to the image in your private Bluemix registry in the format: `registry.ng.bluemix.net/\u003cnamespace\u003e/\u003cimage\u003e`.\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n        - description: Choose a name for your container. The characters in the name can include uppercase letters, lowercase letters, numbers, periods (.), underscores (_), or hyphens (-), but the name must start with a letter.\n          in: query\n          name: name\n          required: false\n          schema:\n            type: string\n      requestBody:\n        content:\n          application/json:\n            schema:\n              $ref: \"#/components/schemas/CreateContainer\"\n        description: Summary of input parameter to create a container in IBM Containers.\n        required: true\n      responses:\n        \"201\":\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/ContainerId\"\n          description: OK. The creation of a single container with the specified attributes has been initiated.\n        \"400\":\n          description: Bad request. The data that you entered in the request body are either incomplete or in the wrong format. Be sure to include at least the Docker image that you want to use in JSON format and re-run the API request.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"409\":\n          description: \" Conflict. A container with the same name already exists. Choose another name for your container and re-run the API request.\"\n        \"500\":\n          description: \"Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support. \"\n      summary: Create and start a single container\n      tags:\n        - Single containers\n  /containers/floating-ips:\n    get:\n      description: \"This endpoint returns a list of all public IP addresses that are allocated to a space and not bound to a container. If you want to list all public IP addresses that are allocated to a space, even those that are already bound to a container, use the `all` query parameter (corrsponding IBM Containers command: `cf ic ip list`).\"\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n        - description: If this option is set to `all=1`, `all=True`, or `all=true`, all public IP addresses that are allocated to a space are returned. If this option is set to `all=0`, `all=False`, or `all=false`, only available public IP addresses that are allocated but not bound to a container are returned. By default, only available public IP addresses are returned.\n          in: query\n          name: all\n          required: false\n          schema:\n            type: boolean\n      responses:\n        \"200\":\n          content:\n            application/json:\n              schema:\n                items:\n                  $ref: \"#/components/schemas/FloatingIP\"\n                type: array\n          description: OK. A list of public IP addresses that are allocated to the space is returned.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"500\":\n          description: Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support.\n      summary: List available public IP addresses in a space\n      tags:\n        - Public IP addresses\n  /containers/floating-ips/request:\n    post:\n      description: \"This endpoint requests a new public IP address for a space (corresponding IBM Containers command: `cf ic ip request`). The number of public IP addresses depends on the quota that is assigned to the space. If there is not enough quota left to request a new public IP address, you can either contact your organization manager to increase the quota, or unbind an existing IP address from a container by running `cf ic ip unbind \u003cip_adress\u003e \u003ccontainer\u003e` command, or  calling the `POST /container/{name_or_id}/floating-ips/{ip}/unbind` endpoint.\"\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n      responses:\n        \"200\":\n          content:\n            application/json:\n              schema:\n                description: New public IP address that is allocated to your space.\n                type: string\n          description: OK. A new public IP address is allocated to your space.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"402\":\n          description: Payment required. This request exceeds the quota that is allocated to the space. You can either contact your organization manager to increase the quota, or unbind an existing IP address from a container by running `cf ic ip unbind \u003cip_adress\u003e \u003ccontainer\u003e`, or calling the `POST /container/{name_or_id}/floating-ips/{ip}/unbind` endpoint.\n        \"409\":\n          description: Conflict. This request exceeds the quota that is allocated to the space. You can either contact your organization manager to increase the quota, or unbind an existing IP address from a container by running `cf ic ip unbind \u003cip_adress\u003e \u003ccontainer\u003e`, or calling the `POST /container/{name_or_id}/floating-ips/{ip}/unbind` endpoint.\n        \"500\":\n          description: Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support.\n      summary: Request a public IP address for a space\n      tags:\n        - Public IP addresses\n  \"/containers/floating-ips/{ip}/release\":\n    post:\n      description: \"This endpoint releases a public IP address from a space (corresponding IBM Containers command: `cf ic ip release \u003cip_adress\u003e`). The public IP address is no longer allocated to the space. If a container was bound to the IP address, it is automatically unbound.\"\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n        - description: The public IP address that you want to release. Run `cf ic ip list` or call the `GET /containers/floating-ips?all=true` endpoint to review all public IP address that are allocated to your space. After a public IP address is released, it will no longer be allocated to your space.\n          in: path\n          name: ip\n          required: true\n          schema:\n            type: string\n      responses:\n        \"204\":\n          description: No Content. The public IP address has been released from your space.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"404\":\n          description: Not found. The public IP address that you entered, could not be found. Run `cf ic ip list`, or call the `GET /containers/floating-ips?all=true` endpoint to review your public IP addresses. Re-run the API call with the updated public IP address information.\n        \"500\":\n          description: Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support.\n      summary: Release public IP address\n      tags:\n        - Public IP addresses\n  /containers/groups:\n    get:\n      description: \"This endpoint returns a list of all container groups in a space independent of their current state. (corresponding IBM Containers command: `cf ic group list`).\"\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n      responses:\n        \"200\":\n          content:\n            application/json:\n              schema:\n                items:\n                  $ref: \"#/components/schemas/ContainersGroupsGetListItem\"\n                type: array\n          description: OK. A list of container groups is returned.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"500\":\n          description: Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support.\n      summary: List all container groups in a space\n      tags:\n        - Container Groups\n    post:\n      description: |-\n        This endpoint creates and starts a new container group in your space. A container group consists of two or more single containers that are all created from the same container image and as a consequence are configured in the same way. Container groups offer different options at no cost to make your app highly available, such as in-built load balancing, auto-recovery of unhealthy container instances, and auto-scaling of container instances based on CPU and memory usage.\n\n        To create a container group with IBM Containers, you must at least define a container group name and the image that the container group is based on. Required attributes:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        - Name: The container group name must start with a letter and then can include uppercase letters, lowercase letters, numbers, periods (.), underscores (_), or hyphens (-). \n        - Image: You must include the full path to the image in your private Bluemix registry in the format:`registry.ng.bluemix.net/\u003cnamespace\u003e/\u003cimage\u003e`.\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n      requestBody:\n        content:\n          application/json:\n            schema:\n              $ref: \"#/components/schemas/ContainersGroupsPostRequiredAttributes\"\n        description: Attributes that are required to create a container group in your space.\n        required: true\n      responses:\n        \"201\":\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/ContainersGroupsPostCreatedInfo\"\n          description: Created. Your container group was successfully created.\n        \"400\":\n          description: Bad request. The information that you entered in the request body are either incomplete or in the wrong format to process your request. Be sure, to specify at least the name and container image for your container group in JSON format and re-run the REST call.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"409\":\n          description: Conflict. A container group with the same name already exists. Choose a new name for your container group and re-run the REST call.\n        \"500\":\n          description: Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support.\n      summary: Create and start a container group.\n      tags:\n        - Container Groups\n  \"/containers/groups/{name_or_id}\":\n    delete:\n      description: \"Stops and deletes the container instances that run in a container group (corresponding IBM Containers command: `cf ic group rm \u003cgroup_name\u003e`). When you delete a container group, all floating private IP addresses are released.\"\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n        - description: The name or unique ID of the container group that you want to delete. Run `cf ic group list` or call the `GET /containers/groups` endpoint to retrieve a list of container groups in your space.\n          in: path\n          name: name_or_id\n          required: true\n          schema:\n            type: string\n        - description: \"If you want to force the deletion of a container group that has running container instances, use the force option. This parameter needs to be set to either true or false. If set to `force=true`, `force=True`, or `force=1`, running container instances are deleted. If set to `force=false`, `force=False`, or `force=0`, running container instances are not deleted. If you do not specify this paramater, running container instances are not deleted by default. \"\n          in: query\n          name: force\n          required: false\n          schema:\n            type: string\n      responses:\n        \"204\":\n          description: OK. No content. The deletion of the container group was successfully processed.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"403\":\n          description: The container group cannot be deleted due to running or failed container instances. Set the force query parameter to `force=true`, `force=True`, or `force=1` and re-run the REST call to force the deletion of your container group.\n        \"404\":\n          description: Not Found. The name or ID of the container group that you want to delete could not be found. Run `cf ic group list` or call the `GET /containers/groups` endpoint to retrieve a list of container groups in your space. Enter the correct name or ID and re-run the API call.\n        \"500\":\n          description: Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support.\n      summary: Stop and delete all container instances in a container group.\n      tags:\n        - Container Groups\n    get:\n      description: \"This endpoint retrieves detailed information about a container group with a given name (corresponding IBM Containers command: `cf ic group inspect GROUP`).\"\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n        - description: The name or unique ID of the container group that you want to inspect. Run `cf ic group list` or call the `GET /containers/groups` endpoint to retrieve a list of container groups in your space.\n          in: path\n          name: name_or_id\n          required: true\n          schema:\n            type: string\n      responses:\n        \"200\":\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/ContainersGroupsNameOrIdGetDetails\"\n          description: OK. A detailed list of information about a container group is retrieved.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"404\":\n          description: Not Found. The specified name or ID of the container group that you want to update could not be found. Run `cf ic group list` or call the `GET /containers/groups` endpoint to retrieve a list of container groups in your space. Enter the correct name or ID and re-run the REST call.\n        \"500\":\n          description: Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support.\n      summary: Inspect a container group.\n      tags:\n        - Container Groups\n    patch:\n      description: |-\n        Update the number of container instances that run in a container group (corresponding IBM Containers command: `cf ic group update \u003coption\u003e \u003cgroup\u003e`). \n\n        Note: You can run only one update at a time.  \n\n         The desired number is the number of container instances that you require. It must be within the current limits of Max and Min. To increase the number of desired container instances above the Max value, you must first execute an update on the Max value. Once this update is completed, you can increase the desired number of container instances. \n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n        - description: The name or unique ID of the container group that you want to update.\n          in: path\n          name: name_or_id\n          required: true\n          schema:\n            type: string\n      requestBody:\n        content:\n          application/json:\n            schema:\n              $ref: \"#/components/schemas/ContainersGroupsNameOrIdPatchUpdatedInfo\"\n        description: The container group parameter that you want to update.\n        required: true\n      responses:\n        \"204\":\n          description: No content. The update has successfully been processed.\n        \"400\":\n          description: Bad request. The information that you entered in the body of your request are either incomplete or in the wrong format. Be sure, to enter the information that you want to update in JSON format and review the description for each parameter to assure your desired update is valid and can be processed.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"404\":\n          description: Not Found. The name or ID of the container group that you want to update could not be found. Run `cf ic group list` or call the `GET /containers/groups` endpoint to retrieve a list of container groups in your space. Enter the correct name or ID and re-run the REST call.\n        \"500\":\n          description: Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support.\n      summary: Update a container group.\n      tags:\n        - Container Groups\n  \"/containers/groups/{name_or_id}/maproute\":\n    post:\n      description: \"If you want your container group to be accessible from the Internet, you need to expose a public port and map a public route to it (corresponding IBM Containers command: `cf ic route map -n \u003chost\u003e -d \u003cdomain\u003e \u003cgroup\u003e`). Every route consists of the host name and domain.\"\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n        - description: The name or unique ID of the container group to which you want to map a public route. Run `cf ic group list` or call the `GET /containers/groups` endpoint to retrieve a list of container groups in your space.\n          in: path\n          name: name_or_id\n          required: true\n          schema:\n            type: string\n      requestBody:\n        content:\n          application/json:\n            schema:\n              $ref: \"#/components/schemas/Route\"\n        description: The public route that is mapped to the container group. A public route consists of the host name and domain.\n        required: true\n      responses:\n        \"201\":\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/ContainersGroupsNameOrIdMaproutePostInfo\"\n          description: OK. The route that you specified was successfully mapped to the container group.\n        \"400\":\n          description: Bad request. The information that you entered in the body request is either incomplete or in the wrong format. To map a route enter the domain and host name in JSON format. Be sure, that you have exposed a public port when you created the container group, otherwise you cannot map a public route to it.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"404\":\n          description: Not Found. The name or ID of the container group to which you want to map a public route could not be found. Run `cf ic group list` or call the `GET /containers/groups` endpoint to retrieve a list of container groups in your space. Enter the correct name or ID and re-run the REST call.\n        \"500\":\n          description: Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support.\n      summary: Map a public route to a container group.\n      tags:\n        - Container Groups\n  \"/containers/groups/{name_or_id}/unmaproute\":\n    post:\n      description: |-\n        This endpoint unmaps a public route from a container group (corresponding IBM Containers command: `cf ic route unmap -n \u003chost\u003e -d \u003cdomain\u003e \u003cgroup\u003e`). If no other public route is mapped to the container group, then the container group is no longer available from the internet. \n\n         When you unmap a route from a container group, the route is not deleted and can be mapped to other container groups. \n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n        - description: The name or unique ID (UUID) of the container group that you want to inspect.\n          in: path\n          name: name_or_id\n          required: true\n          schema:\n            type: string\n      requestBody:\n        content:\n          application/json:\n            schema:\n              $ref: \"#/components/schemas/Route\"\n        description: The public route that is unmapped from the container group. A public route consists of the host name and domain.\n        required: true\n      responses:\n        \"201\":\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/ContainersGroupsNameOrIdMaproutePostInfo\"\n          description: OK. The route that you specified was successfully unmapped from the container group.\n        \"400\":\n          description: Bad request. The information that you entered in the body of your request is either incomplete or in the wrong format. To unmap a route, enter the domain and host name in JSON format and re-run the REST call.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"404\":\n          description: Not Found. The name or ID of the container group from which you want to unmap a public route could not be found. Enter the correct name or ID and re-run the REST call.\n        \"500\":\n          description: Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support.\n      summary: Unmap a public route from a container group\n      tags:\n        - Container Groups\n  /containers/json:\n    get:\n      description: \"This endpoint returns a list of all single containers in a space that are currently in a running state (corresponding IBM Containers command: `cf ic ps`). To list all single containers independent of their current state, set the `all` query parameter to true.\"\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n        - description: \"By default, the `GET /containers/json` endpoint returns a list of all single containers in a space that are in a running state. To request a list of all containers independent of their current state, set the `all` query parameter to true. Allowed values are: `all=true`, `all=True`, and `all=1`. \"\n          in: query\n          name: all\n          required: false\n          schema:\n            type: string\n        - description: You can filter your containers by any environment variable key or value that is listed in the `Env` section of your CLI/ API response when you run the `cf ic inspect \u003ccontainer\u003e` command, or call the `GET /containers/{id}/json` endpoint. Your search criteria does not need to be an exact match. It can also be a part of the key or value you are looking for. For example, to filter all containers with an environment variable that contains `id` in one of their environment variables, use `filter=id`.\n          in: query\n          name: filters\n          required: false\n          schema:\n            type: string\n      responses:\n        \"200\":\n          content:\n            application/json:\n              schema:\n                items:\n                  $ref: \"#/components/schemas/Container\"\n                type: array\n          description: OK. A list of single containers that match the search criteria is returned.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"500\":\n          description: \"Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support. \"\n      summary: List single containers in a space.\n      tags:\n        - Single containers\n  /containers/messages:\n    get:\n      description: This endpoint retrieves all IBM Containers system messages for the user.\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: \"The unique ID of your organization space where you want to create or work with your containers. To retrieve your space ID, run `cf space \u003cspace_name\u003e --guid` and replace `\u003cspace_name\u003e` with the name of the space where you want to create or work with your container. \"\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n      responses:\n        \"200\":\n          content:\n            application/json:\n              schema:\n                properties:\n                  created_date:\n                    description: Timestamp when the message was created.\n                    type: string\n                  message:\n                    description: Important information for the IBM Containers user.\n                    type: string\n                type: object\n          description: OK. A list of messages is returned.\n        \"500\":\n          description: Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support.\n      summary: List messages for the user\n      tags:\n        - API info\n  /containers/quota:\n    get:\n      description: Retrieve the quota that is assigned to the organization and space.\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n      responses:\n        \"200\":\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/ContainersQuotaInfo\"\n          description: \"OK. The current quota that is assigned to the organization and space is returned. \"\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"500\":\n          description: Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support.\n      summary: Retrieve organization and space specific quota\n      tags:\n        - Quota\n    put:\n      description: |-\n        This endpoint updates the quota that is allocated to a Bluemix space. \n\n         **Note**: Only paid accounts are eligbile to update the space quota. If you are using a free-trial account, upgrade to a paid account first.\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n      requestBody:\n        content:\n          application/json:\n            schema:\n              $ref: \"#/components/schemas/ContainersQuotaList\"\n        description: The space quota details that you want to update.\n        required: true\n      responses:\n        \"204\":\n          description: \"No content. The request to update the organization and/ or space quota has been processed. \"\n        \"400\":\n          description: \"Bad request. The \"\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"500\":\n          description: Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support.\n      summary: Update space quota\n      tags:\n        - Quota\n  /containers/usage:\n    get:\n      description: |-\n        This endpoint returns a list of available container sizes and the quota limit and usage for the space. \n\n        - Container sizes: A list of available container sizes indicating the amount of container memory, disk space and virtual CPUs that can be assigned to the container.\n        - Quota limit: Lists the number of containers, public IP addresses, available container memory, and virtual CPUS that are allocated to a space. \n        - Quota usage: Lists the current number of containers, images, and public IP addresses in a space that is counted towards your quota limit. \n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n      responses:\n        \"200\":\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/ContainersUsageInfo\"\n          description: \"OK. A list of available container sizes as well as the quota limit and usage for a space is returned. \"\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"500\":\n          description: Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support.\n      summary: List container sizes and quota limits\n      tags:\n        - Quota\n  /containers/version:\n    get:\n      description: This endpoint retrieves a list of all microservices that are used in the IBM Containers service with their current build version. This method does not require authentication.\n      responses:\n        \"200\":\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/ContainersVersionGetInfo\"\n          description: OK. A list of the current API and microservices versions is returend.\n        \"500\":\n          description: Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support.\n      summary: List latest API version\n      tags:\n        - API info\n  \"/containers/{id}/status\":\n    get:\n      description: This endpoint returns the current state of a container. This state can either be a transient state, such as BUILDING and NETWORKING, or a non-transient state, such as RUNNING, SHUTDOWN, CRASHED, or SUSPENDED.\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n        - description: The unique identifier that represents the container. Run `cf ic ps`, or call the `GET /containers/json` endpoint to retrieve the ID of the container.\n          in: path\n          name: id\n          required: true\n          schema:\n            type: string\n      responses:\n        \"201\":\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/getContainerStatus\"\n          description: OK. The current status of a container is returned.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"404\":\n          description: Not Found. The container could not be found. Run `cf ic ps` or call the `GET /containers/json` endpoint to review the ID of your container.\n        \"500\":\n          description: \"Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support. \"\n      summary: List the current state of a container.\n      tags:\n        - Single containers\n  \"/containers/{name_or_id}\":\n    delete:\n      description: \"Remove a single container that is identified by container ID or name from a space (corresponding IBM Containers command: `cf ic delete \u003ccontainer\u003e`). The container must be stopped before it can be deleted, unless the `force` query parameter is set to true.\"\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n        - description: The unique identifier or name of the container that you want to delete. Run `cf ic ps -a` or call the `GET /containers/json?all=true` endpoint to review all containers in your space.\n          in: path\n          name: name_or_id\n          required: true\n          schema:\n            type: string\n        - description: Use the `force` query parameter if you want to delete the container independent of their current state. The container does not need to be stopped first. To force the deletion of a container, enter `force=true`, `force=True`, or `force=1`. If you want to delete containers that are in a non-running state only, do either not set this query parameter, or enter `force=false`, `force=False`, or `force=0`.\n          in: query\n          name: force\n          required: false\n          schema:\n            type: boolean\n      responses:\n        \"204\":\n          description: No Content. The deletion of your container has been initiated.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"404\":\n          description: Not Found. The container with the specified name or ID could not be found. Run `cf ic ps -a` or call the `GET /containers/json?all=true` endpoint to review the ID and name of your container.\n        \"500\":\n          description: Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support.\n      summary: Remove a single container\n      tags:\n        - Single containers\n  \"/containers/{name_or_id}/floating-ips/{ip}/bind\":\n    post:\n      description: \"This endpoint binds an available public IP address to a single container (corresponding IBM Containers command: `cf ic ip bind \u003cip_adress\u003e \u003ccontainer\u003e`). After a container is bound to a public IP address, it can be accessed at `https://\u003cpublic_ip_adress\u003e:\u003cpublic_port\u003e`.\"\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n        - description: The name or ID of the container that you want to bind to the public IP address. Run the `cf ic ps` command or call the `GET /containers/json` endpoint to retrieve a list of containers in your space.\n          in: path\n          name: name_or_id\n          required: true\n          schema:\n            type: string\n        - description: |-\n            The public IP address that you want to bind to your container. \n\n            Note: The public IP address must be available in the space and not bound to a container. Run `cf ic ip list` or call the `GET /containers/floating-ips` endpoint.\n          in: path\n          name: ip\n          required: true\n          schema:\n            type: string\n      responses:\n        \"204\":\n          description: No Content. Your request to bind a public IP address to a container has successfully been processed.\n        \"304\":\n          description: Not modified. The container is already bound to a public IP address. To view the details of your container, run `cf ic inspect \u003ccontainer\u003e` or call the `GET /containers/{name_or_id}/json endpoint.\n        \"400\":\n          description: Bad request. The IP address that you entered does not exist. Run `cf ic ip list` or call the `GET /containers/floating-ips` endpoint to retrieve a list of available public IP addresses in your space.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"404\":\n          description: \"Not Found. The container with the specified name or ID could not be found. Run `cf ic ps -a` or call the `GET /containers/json?all=true` endpoint to review the ID and name of your container. \"\n        \"500\":\n          description: Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support.\n      summary: Bind a public IP address to a single container\n      tags:\n        - Public IP addresses\n  \"/containers/{name_or_id}/floating-ips/{ip}/unbind\":\n    post:\n      description: \"This endpoint unbinds a public IP address from a container (corresponding IBM Containers command: `cf ic ip unbind \u003cip_adress\u003e \u003ccontainer\u003e`). The container that is unbound from the IP address will not be accessible from the internet anymore. The public IP address will be further allocated to the space and can be used to be bound to other containers. \"\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n        - description: \"The name or ID of the container that you want to bind to the public IP address. Run the `cf ic ps` command or call the `GET /containers/json` endpoint to retrieve a list of containers in your space. \"\n          in: path\n          name: name_or_id\n          required: true\n          schema:\n            type: string\n        - description: |-\n            The public IP address that you want to unbind from your container. \n\n             Note: After unbinding a public IP address, this IP address will still be allocated to the space and can be used to be bound to other containers.\n          in: path\n          name: ip\n          required: true\n          schema:\n            type: string\n      responses:\n        \"204\":\n          description: No Content. Your request to unbind a public IP address from a container has successfully been processed.\n        \"400\":\n          description: Bad request. The IP address that you entered does not exist. Run `cf ic ip list` or call the `GET /containers/floating-ips` endpoint to retrieve a list of available public IP addresses in your space.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"404\":\n          description: \"Not Found. The container with the specified name or ID could not be found. Run `cf ic ps -a` or call the `GET /containers/json?all=true` endpoint to review the ID and name of your container. \"\n        \"500\":\n          description: Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support.\n      summary: Unbind a public IP address from a container\n      tags:\n        - Public IP addresses\n  \"/containers/{name_or_id}/json\":\n    get:\n      description: \"This endpoint retrieves detailed information about a single container (corresponding IBM Containers command: `cf ic inspect \u003ccontainer\u003e`).\"\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n        - description: The name or ID of the container that you want to inspect. Run the `cf ic ps` command or call the `GET /containers/json` endpoint to retrieve a list of containers in your space.\n          in: path\n          name: name_or_id\n          required: true\n          schema:\n            type: string\n      responses:\n        \"200\":\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/ContainerInfo\"\n          description: \"OK. A list with detailed information about the container is returned. \"\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"404\":\n          description: Not Found. The container name or ID that you entered, could not be found. Run the `cf ic ps` command or call the `GET /containers/json` to review the name or ID of the container that you want to inspect.\n        \"500\":\n          description: Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support.\n      summary: Inspect a single container\n      tags:\n        - Single containers\n  \"/containers/{name_or_id}/pause\":\n    post:\n      description: \"Pause all processes in a running single container with a given container ID or name (corresponding IBM Containers command: `cf ic pause \u003ccontainer\u003e`).\"\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n        - description: The unique identifier or name of the container that you want to pause. Run `cf ic ps` or call the `GET /containers/json` endpoint to review all containers in your space that are currently in a running state.\n          in: path\n          name: name_or_id\n          required: true\n          schema:\n            type: string\n      responses:\n        \"204\":\n          description: No Content. The pausing of all processes inside the container has been initiated.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"404\":\n          description: Not Found. The container with the specified name or ID could not be found. Run `cf ic ps` or call the `GET /containers/json` endpoint to review the ID and name of your container.\n        \"500\":\n          description: Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support.\n      summary: Pause a single container\n      tags:\n        - Single containers\n  \"/containers/{name_or_id}/rename\":\n    post:\n      description: \"Change the current name of an existing single container that is identified by the container ID or name (corresponding IBM Containers command: `cf ic rename \u003cold_name\u003e \u003cnew_name\u003e`). \"\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n        - description: The unique identifier or name of the container that you want to rename. Run `cf ic ps -a` or call the `GET /containers/json?all=true` endpoint to review all containers in your space.\n          in: path\n          name: name_or_id\n          required: true\n          schema:\n            type: string\n        - description: The new name for the container. The characters in the name can include uppercase letters, lowercase letters, numbers, periods (.), underscores (_), or hyphens (-), but the name must start with a letter.\n          in: query\n          name: name\n          required: true\n          schema:\n            type: string\n      responses:\n        \"204\":\n          description: No Content. The request to rename the container has been initiated.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"404\":\n          description: Not Found. The container with the specified name or ID could not be found. Run `cf ic ps -a` or call the `GET /containers/json?all=true` endpoint to review the ID and name of your container.\n        \"409\":\n          description: \"Conflict. A container with the same name already exists. Choose another name for your container and re-run the API call. \"\n        \"500\":\n          description: Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support.\n      summary: Rename a single container\n      tags:\n        - Single containers\n  \"/containers/{name_or_id}/restart\":\n    post:\n      description: \"Restart a container with a given container ID or name (corresponding IBM Containers command: `cf ic restart \u003ccontainer\u003e`).\"\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n        - description: The unique identifier or name of the container that you want to restart. Run `cf ic ps` or call the `GET /containers/json` endpoint to review all containers in your space.\n          in: path\n          name: name_or_id\n          required: true\n          schema:\n            type: string\n        - description: The number of seconds to wait before the container is restarted. For example, if you want a container to restart after 10 seconds, enter `t=10`.\n          in: query\n          name: t\n          required: false\n          schema:\n            type: integer\n      responses:\n        \"204\":\n          description: No Content. The restart of the container has been initiated.\n        \"304\":\n          description: Not Modified. A request to restart the container with the specified name or ID has already been initiated. To review the current state of your container, run `cf ic ps` or call the `GET /containers/json` endpoint.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"404\":\n          description: Not Found. The container with the specified name or ID could not be found. Run `cf ic ps` or call the `GET /containers/json` endpoint to review the ID and name of your container.\n        \"500\":\n          description: Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support.\n      summary: Restart a single container\n      tags:\n        - Single containers\n  \"/containers/{name_or_id}/start\":\n    post:\n      description: \"Start a single container with a given container name or ID (corresponding IBM Containers command: `cf ic start \u003ccontainer\u003e`).\"\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n        - description: The unique identifier or name of the container that you want to start. Run `cf ic ps -a` or call the `GET /containers/json?all=true` endpoint to review the containers in your space that are currently not in a running state.\n          in: path\n          name: name_or_id\n          required: true\n          schema:\n            type: string\n      responses:\n        \"204\":\n          description: No Content. The start of the container has been initiated.\n        \"304\":\n          description: Not Modified. A request to start the container with the specified name or ID has already been initiated. To review the current state of your container, run `cf ic ps` or call the `GET /containers/json` endpoint.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"404\":\n          description: Not Found. The container with the specified name or ID could not be found. Run `cf ic ps -a` or call the `GET /containers/json?all=true` endpoint to review the ID and name of your container.\n        \"500\":\n          description: Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support.\n      summary: Start a single container\n      tags:\n        - Single containers\n  \"/containers/{name_or_id}/stop\":\n    post:\n      description: \"Stop a single container with a given container name or ID (corresponding IBM Containers command: `cf ic stop \u003ccontainer\u003e`).\"\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n        - description: The unique identifier or name of the container that you want to stop. Run `cf ic ps` or call the `GET /containers/json` endpoint to review the containers in your space that are currently in a running state.\n          in: path\n          name: name_or_id\n          required: true\n          schema:\n            type: string\n        - description: The number of seconds to wait before the container is stopped. For example, if you want a container to stop after 10 seconds, enter `t=10`.\n          in: query\n          name: t\n          required: false\n          schema:\n            type: integer\n      responses:\n        \"204\":\n          description: No Content. The stop of the container has been initiated.\n        \"304\":\n          description: Not Modified. A request to stop the container with the specified name or ID has already been initiated. To review the current state of your container, run `cf ic ps` or call the `GET /containers/json` endpoint.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"404\":\n          description: Not Found. The container with the specified name or ID could not be found. Run `cf ic ps` or call the `GET /containers/json` endpoint to review the ID and name of your container.\n        \"500\":\n          description: Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support.\n      summary: Stop a single container\n      tags:\n        - Single containers\n  \"/containers/{name_or_id}/unpause\":\n    post:\n      description: \"Unpause all processes that are currently stopped inside a single containers with a given container ID or name (corresponding IBM Containers command: `cf ic unpause \u003ccontainer\u003e`).\"\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n        - description: The unique identifier or name of the container that you want to unpause. Run `cf ic ps -a` or call the `GET /containers/json?all=true` endpoint to review all containers in your space.\n          in: path\n          name: name_or_id\n          required: true\n          schema:\n            type: string\n      responses:\n        \"204\":\n          description: No Content. The unpausing of all processes inside the container has been initiated.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"404\":\n          description: Not Found. The container with the specified name or ID could not be found. Run `cf ic ps -a` or call the `GET /containers/json?all=true` endpoint to review the ID and name of your container.\n        \"500\":\n          description: Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support.\n      summary: Unpause a single container\n      tags:\n        - Single containers\n  /images/json:\n    get:\n      description: \"This endpoint returns a list of all available Docker images in a private Bluemix registry (corresponding IBM Containers command: `cf ic images`.\"\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n      responses:\n        \"200\":\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/ImageInfo\"\n          description: OK. A list of all available Docker images in the private Bluemix registry is returned.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"500\":\n          description: Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support.\n      summary: List all Docker images that are available in your private Bluemix registry.\n      tags:\n        - Images\n  \"/images/{id}\":\n    delete:\n      description: \"Remove a Docker image from the private Bluemix registry that is identified by the image ID (corresponding IBM Containers command: `cf ic rmi \u003cimage\u003e`).\"\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n        - description: The unique identifier representing a Docker image. Run `cf ic images`, or call the `GET /images/json` endpoint to review the Docker images that are available in your private Bluemix registry.\n          in: path\n          name: id\n          required: true\n          schema:\n            type: string\n      responses:\n        \"204\":\n          description: No Content. The image was successfully removed from your private Bluemix registry.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"404\":\n          description: Not found. The specified Docker image ID could not be found. Run `cf ic images` or call the `GET /images/json` endpoint to list all images in your private Bluemix registry. Note the ID of the image that you want to delete.\n        \"500\":\n          description: Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support.\n      summary: Remove a Docker image.\n      tags:\n        - Images\n  \"/images/{name_or_id}/json\":\n    get:\n      description: \"This endpoint returns detailed information about a Docker image that is stored in the private Bluemix registry of an organization (corresponding IBM Containers command: `cf ic inspect \u003cimage_name_or_id\u003e`).\"\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n        - description: \"The full private Bluemix registry path to your image or the unique ID of the image that you want to inspect. Run `cf ic images` or call the `GET /images/json` endpoint to review the images in your private Bluemix registry. \"\n          in: path\n          name: name_or_id\n          required: true\n          schema:\n            type: string\n      responses:\n        \"200\":\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/ImageDetail\"\n          description: OK. A list of details about the container image is returned.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"404\":\n          description: The specified image name or ID could not be found. Run `cf ic images` or call the `GET /images/json` endpoint to retrieve the name or ID of your image.\n        \"500\":\n          description: Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support.\n      summary: Inspect a Docker image in private Bluemix registry\n      tags:\n        - Images\n  /registry/namespaces:\n    get:\n      description: \"This endpoint retrieves the namespace that was set for the organization that owns the current space (corresponding IBM Containers command: `cf ic namespace get`).\"\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n      responses:\n        \"200\":\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/Namespace\"\n          description: OK. The namespace of the organization is returned.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"404\":\n          description: Not found. A namespace could not be found for the organization. Set a namespace by running `cf ic namespace set \u003cnamespace\u003e`, or calling the `PUT /registry/namespaces/\u003cnamespace\u003e` endpoint.\n        \"500\":\n          description: Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support.\n      summary: Retrieve the namespace of an organization.\n      tags:\n        - Private Docker images registry\n  \"/registry/namespaces/{namespace}\":\n    get:\n      description: |-\n        This endpoint checks whether a namespace is available in Bluemix and can be used to set up the private Docker images registry for an organization. When a HTTP code `201 Ok` is returned, the namespace is already assigned to another organization in Bluemix and cannot be used. When a HTTP code `404 Not found` is returned, the namespace can be used for your organization. \n\n         Consider the following rules when choosing a namespace for your organization: \n\n        - Every organization can have one namespace at a time only \n        - The namespace must be unique in Bluemix. \n        - The namespace can be 4-30 characters long. \n        - The namespace must start with at least one letter or number. \n        - The namespace can only contain lowercase letters, numbers or underscores (_). \n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n        - description: The name of the namespace that you would like to use for your organization and for which you would like to check availability in Bluemix.\n          in: path\n          name: namespace\n          required: true\n          schema:\n            type: string\n      responses:\n        \"200\":\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/Namespace\"\n          description: OK. The namespace that you chose is already used in Bluemix. Choose another namespace and re-run the API call.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"404\":\n          description: Not found. The namespace that you chose does not exist. You can use it to set it for your organization by running `cf ic namespace set \u003cnamespace\u003e`, or calling the `PUT /registry/namespaces/\u003cnamespace\u003e` endpoint.\n        \"500\":\n          description: Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support.\n      summary: Check the availability of a namespace\n      tags:\n        - Private Docker images registry\n    put:\n      description: |-\n        Set up your own Docker images registry in Bluemix by defining a namespace for your organization (corresponding IBM Containers command: `cf ic namespace set \u003cnamespace\u003e`). The namespace is used to generate a unique URL to your private Bluemix registry. In your private registry you store all Docker images that you want to share across your organization. To create a container from an image, you must first push the image to your registry. \n\n         The namespace cannot be changed after is has been set. Consider the following rules to choose a namespace for your organization: \n\n        - Every organization can have one namespace at a time only \n        - The namespace must be unique in Bluemix. \n        - The namespace can be 4-30 characters long. \n        - The namespace must start with at least one letter or number. \n        - The namespace can only contain lowercase letters, numbers or underscores (_).\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n        - description: \"The name for your namespace to create your private Docker images registry in Bluemix. You cannot change the name afterward. The namespace can be 4-30 characters long, must start with at least one letter or number, and can only contain lowercase letters, numbers or underscores (_). You can test the availability of your namespace by calling the `GET /registry/namespaces/\u003cnamespace\u003e` endpoint. When a HTTP code `404 Not Found` is returned, the namespace is available in Bluemix. \"\n          in: path\n          name: namespace\n          required: true\n          schema:\n            type: string\n      responses:\n        \"201\":\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/Namespace\"\n          description: OK. The namespace is successfully set for your organization.\n        \"400\":\n          description: Bad request. The specified namespace does not meet the Bluemix namespace requirements. The namespace can be 4-30 characters long, must start with at least one letter or number, and can only contain lowercase letters, numbers or underscores (_). Verify your namespace and re-run the API request.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"409\":\n          description: Conflict. The namespace that you chose either already exists in Bluemix, or a namespace is already been set for your organization. Run `cf ic namespace get` or call the `GET /registry/namespaces` endpoint to retrieve your namespace information. If a namespace is not yet set for your organization, choose another name. You can test the namespace by calling the `GET /registry/namespaces/\u003cnamespace\u003e` endpoint. Re-run the API call with the updated namespace.\n        \"500\":\n          description: Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support.\n      summary: Set a namespace for your private Bluemix registry.\n      tags:\n        - Private Docker images registry\n  /tlskey:\n    get:\n      description: \"This endpoint returns the TLS (Transport Layer Security) certificate to the user (corresponding IBM Containers command: `cf ic login`). The TLS certificate is a SSL certificate that is used to authenticate the user's CLI with the IBM Containers service and to establish a secure communication between the user's local machine and the container in Bluemix.\"\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n      responses:\n        \"200\":\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/Certificate\"\n          description: Ok. A list of certificates is returned\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"500\":\n          description: \"Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support. \"\n      summary: Retrieve the TLS Certificate\n      tags:\n        - Authentication\n  /tlskey/refresh:\n    put:\n      description: \"This endpoint requests to generate a new TLS (Transport Layer Security) certificate on the server and to update the existing user TLS certificate (corresponding IBM Containers command: `cf ic init`).\"\n      parameters:\n        - description: \"The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token. \"\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n      responses:\n        \"201\":\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/CertificateRefresh\"\n          description: Ok. A list of updated certificates is returned.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"500\":\n          description: \"Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support. \"\n      summary: Refresh the TLS Certificate\n      tags:\n        - Authentication\n  /volumes/create:\n    post:\n      description: |-\n        This endpoints creates a new volume in your space (corresponding IBM Containers command: `cf ic volume create VOLNAME`). A volume is used to persist and access app data between container restarts. Volumes are hosted on file shares that define the available actual storage in Bluemix and the number of input and output transactions per second (IOPS). \n\n         After you have created a volume, you must mount it to a container by using the `--volume` option in the `cf ic run` (single containers) or `cf ic group create` (container groups) command. You can also define the volume as part of the HTTP body and send a request to the `POST /containers/create` (single containers) or `POST /containers/groups` (container groups) endpoints. \n\n         Note: If you mount multiple containers in a space to the same volume, they share the data in the volume and can access them anytime. When a container is deleted, the associated volume is not removed.\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n        - description: The name of the volume. The name must be unique for a space and can contain uppercase letters, lowercase letters, numbers, underscores (_), and hyphens (-).\n          in: query\n          name: name\n          required: true\n          schema:\n            type: string\n        - description: The name of the file share that the volume is hosted on. File shares can have different storage sizes and IOPS based on the required workload. If this field is left blank, the volume is hosted on the default file share.\n          in: query\n          name: fsName\n          required: false\n          schema:\n            type: string\n      responses:\n        \"201\":\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/Volume\"\n          description: Created. Your volume was successfully created in your space.\n        \"400\":\n          description: Bad request. Your request could not be processed due to missing parameter. Make sure to enter a name for your volume as part of your query and re-run the request\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"409\":\n          description: Conflict. A volume with the same name already exists. Choose a new name for your volume and re-run the API call.\n        \"500\":\n          description: \"Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support. \"\n      summary: Create a volume in a space\n      tags:\n        - Volumes\n  /volumes/fs/create:\n    post:\n      description: |-\n        This endpoint creates a new file share in a space (corresponding IBM Containers command: `cf ic volume fs-create FSNAME FSSIZE FSIOPS`). \n\n         A file share is a persistent NFS-based (Network File System) storage system that hosts Docker volumes in a Bluemix space and allows a user to store and access container and app-related files. To store files in a file share, you must create a container volume and save the data into this volume.\n\n         As soon as you create your first volume in a space with the `cf ic volume create VOLNAME` command or the `POST /volumes/create` API endpoint, a default file share with 20 GB at 4 IOPS (Input Output operations Per Second) is created at no cost. \n\n        The organization manager can create file shares with specific storage size and IOPS to meet the storage needs of the space. File shares can be provisioned in sizes from 20 GB to 12 TB and at IOPS per GB of 0.25, 2 or 4. Run `cf ic volume fs-flavor-list` or call the `GET /volumes/fs/flavors/json` API endpoint to retrieve a list of available file share sizes. The file share size in relation to the number of IOPS impacts the speed that data can be read and written from and to the container volume.\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n      requestBody:\n        content:\n          application/json:\n            schema:\n              $ref: \"#/components/schemas/FileshareParam\"\n        description: The input parameter to create a new file share in a space.\n        required: true\n      responses:\n        \"202\":\n          description: \"Accepted. A new fileshare has been created. \"\n        \"400\":\n          description: Bad request. The input parameter in the request body are either incomplete or in the wrong format. Be sure to include the file share name, size and number of IOPS as part of your request in JSON format.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID. If your access token and space ID are correct, verify that you have been granted organization manager rights. Only organization managers can create file shares in a space.\n        \"409\":\n          description: Conflict. A file share with the same name already exists. Run `cf ic volume fs-list` or call the `GET /volumes/fs/json` API endpoint to get a list with all available file shares in this space. Choose a new name for your file share and re-run the API call.\n        \"500\":\n          description: \"Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support. \"\n      summary: Create a file share in a space\n      tags:\n        - File shares\n  /volumes/fs/flavors/json:\n    get:\n      description: \"This endpoint returns a list of available file shares in gigabyte (corresponding IBM Containers command: `cf ic volume fs-flavor-list`).\"\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n      responses:\n        \"200\":\n          content:\n            application/json:\n              schema:\n                items:\n                  type: integer\n                type: array\n          description: OK. A list of available file share sizes in gigabyte is returned.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"500\":\n          description: \"Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support. \"\n      summary: List available file share sizes\n      tags:\n        - File shares\n  /volumes/fs/json:\n    get:\n      description: \"This endpoint returns a list of all file shares that are availble in a space (corresponding IBM Containers command: `cf ic volume fs-list`).\"\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n      responses:\n        \"200\":\n          content:\n            application/json:\n              schema:\n                items:\n                  $ref: \"#/components/schemas/Fileshare\"\n                type: array\n          description: OK. A list of available file shares is returned.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"500\":\n          description: \"Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support. \"\n      summary: List available file shares in a space\n      tags:\n        - File shares\n  \"/volumes/fs/{name}\":\n    delete:\n      description: |-\n        This endpoint deletes a file share from a space (corresponding IBM Containers command: `cf ic volume fs-rm FSNAME`).\n\n         Before you can delete a file share, all mounted volumes must be deleted first. To delete a volume, run `cf ic volume rm VOLNAME` or call the `DELETE /volumes/{name}` API endpoint. \n\n         **Note:** To delete a file share you must have been granted organization developer rights.\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n        - description: The name of the file share that you want to delete. Run `cf ic volume fs-list` or call the `GET /volumes/fs/json` API endpoint to retrieve a list of available file shares in your space.\n          in: path\n          name: name\n          required: true\n          schema:\n            type: string\n      responses:\n        \"204\":\n          description: No Content. The file share was successfully deleted.\n        \"400\":\n          description: \"Bad request. The specified file share could not be deleted as it has mounted volumes. Run `cf ic volume rm VOLNAME` or call the `DELETE /volumes/{name}` API endpoint to delete the volume. After all mounted volumes are deleted, delete the file share. \"\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"404\":\n          description: The specified file share name could not be found. Run `cf ic volume fs-list` or call the `GET /volumes/fs/json` endpoint to retrieve a list of available file shares in your space. Enter the name for your file share and re-run the API call.\n        \"500\":\n          description: \"Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support. \"\n      summary: Delete a file share\n      tags:\n        - File shares\n  \"/volumes/fs/{name}/json\":\n    get:\n      description: \"This endpoint returns detailed information about a file share (corresponding IBM Containers command: `cf ic volume fs-inspect FSNAME`).\"\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n        - description: The name of the file share that you want to inspect. Run `cf ic volume fs-list` or call the `GET /volumes/fs/json` endpoint to retrieve a list of available file shares in your space.\n          in: path\n          name: name\n          required: true\n          schema:\n            type: string\n      responses:\n        \"200\":\n          content:\n            application/json:\n              schema:\n                items:\n                  $ref: \"#/components/schemas/GetFileshareDetails\"\n                type: array\n          description: OK. Detailed information about a file share is returned.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"404\":\n          description: The specified file share name could not be found. Run `cf ic volume fs-list` or call the `GET /volumes/fs/json` endpoint to retrieve a list of available file shares in your space. Enter the name for your file share and re-run the API call.\n        \"500\":\n          description: \"Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support. \"\n      summary: Inspect a file share\n      tags:\n        - File shares\n  /volumes/json:\n    get:\n      description: \"This endpoint returns a list of all volumes that are available in the given space (corresponding IBM Containers command: `cf ic volume list`).\"\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n      responses:\n        \"200\":\n          content:\n            application/json:\n              schema:\n                items:\n                  $ref: \"#/components/schemas/Volume\"\n                type: array\n          description: OK. A list containing all volumes of a given space is returned.\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"500\":\n          description: \"Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support. \"\n      summary: List all volumes for a space\n      tags:\n        - Volumes\n  \"/volumes/{name}\":\n    delete:\n      description: \"Delete a volume with a given name from a space (corresponding IBM Containers command: `cf ic volume rm VOLNAME`). To delete a volume, all mounted containers must be unmounted first. After the volume is deleted, the data that are stored in the volume are lost. \"\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n        - description: The name of the volume that you want to delete. Run `cf ic volume list` or call the `GET /volumes/json` endpoint to retrieve a list of all volumes that are available in your space.\n          in: path\n          name: name\n          required: true\n          schema:\n            type: string\n      responses:\n        \"204\":\n          description: \"No Content. Your request to delete the volume has successfully been processed. \"\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"404\":\n          description: Not found. The volume could not be found. Verify that the name is correct by running the `cf ic volume list` command or by calling the `GET /volumes/json` endpoint. Enter the correct name and re-run the API call.\n        \"500\":\n          description: Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support.\n      summary: Delete a volume\n      tags:\n        - Volumes\n    post:\n      description: This endpoint provisions an existing volume that was created in one space to another space within the same organization. Single containers and container groups in each space can read and write to the shared volume. The volume remains owned by the original space it was created in, including management and billing. For example, the volume can be deleted from the original space only.\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n        - description: The name of the volume that you want to share with another space in your organization.\n          in: path\n          name: name\n          required: true\n          schema:\n            type: string\n      requestBody:\n        content:\n          application/json:\n            schema:\n              $ref: \"#/components/schemas/UpdateVolume\"\n        description: Input parameter that are required to provision an existing volume to a new space and to unprovision it from a space.\n        required: true\n      responses:\n        \"200\":\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/Volume\"\n          description: Ok. A list with detailed information about the volume is returned. Review the changes in the `otherSpaceVisibility` property.\n        \"400\":\n          description: \"Bad request. The data that you entered in the request body are either incomplete or in the wrong format. Be sure to include either the space ID where you want to provision your volume, or the space ID from which you want to unprovision your volume in JSON format. \"\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"404\":\n          description: Not found. The specified volume could not be found. Verify that the name is correct by running the `cf ic volume list` command or by calling the `GET /volumes/json` endpoint. Enter the correct name and re-run the API call.\n        \"500\":\n          description: Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support.\n      summary: Share a volume with another space\n      tags:\n        - Volumes\n  \"/volumes/{name}/json\":\n    get:\n      description: \"Retrieve a detailed list of information about a volume that is identified by the volume name (corresponding IBM Containers command: `cf ic volume inspect VOLNAME`).\"\n      parameters:\n        - description: The Bluemix JSON web token that you receive when logging into Bluemix. Run `cf oauth-token` to retrieve your access token.\n          in: header\n          name: X-Auth-Token\n          required: true\n          schema:\n            type: string\n        - description: The unique ID of your organization space where you want to create or work with your containers. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n          in: header\n          name: X-Auth-Project-Id\n          required: true\n          schema:\n            type: string\n        - description: The name of the volume, for which you want to retrieve detailed information. Run `cf ic volume list` or call the `GET /volumes/json` endpoint to retrieve a list of all volumes that are available in your space.\n          in: path\n          name: name\n          required: true\n          schema:\n            type: string\n      responses:\n        \"200\":\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/Volume\"\n          description: \"Ok. A list with detailed information about the volume is returned. \"\n        \"401\":\n          description: Authentication failed. The Access Token is invalid, or the Space ID that you entered could not be found. Run `cf oauth-token` to retrieve your access token. Run `cf space \u003cspace_name\u003e --guid`, where `\u003cspace_name\u003e` is the name of your space, to retrieve your space ID.\n        \"404\":\n          description: Not found. The specified volume could not be found. Verify that the name is correct by running the `cf ic volume list` command or by calling the `GET /volumes/json` endpoint. Enter the correct name and re-run the API call.\n        \"500\":\n          description: \"Internal Server Error. The IBM Containers service is currently unavailable. Your request could not be processed. Please wait a few minutes and try again. If you still encounter this problem, note the incident ID and contact the IBM Bluemix support. \"\n      summary: \"Retrieve detailed information about a volume. \"\n      tags:\n        - Volumes\ncomponents:\n  schemas:\n    Binding:\n      properties:\n        ContainerId:\n          description: Unique identifier representing a container\n          type: string\n    Certificate:\n      properties:\n        ca_cert:\n          description: Certificate Authority (CA) certificate including the CA public key.\n          type: string\n        server_cert:\n          description: Server certificate including the server's public key.\n          type: string\n        user_cert:\n          description: User certificate including the user's public key.\n          type: string\n        user_key:\n          description: User's private key.\n          type: string\n      required:\n        - ca_cert\n        - server_cert\n        - user_cert\n        - user_key\n      type: object\n    CertificateRefresh:\n      properties:\n        ca_cert:\n          description: Certificate Authority (CA) certificate including the CA public key.\n          type: string\n        reg_host:\n          description: Full URL to the IBM Bluemix registry.\n          type: string\n        server_cert:\n          description: Server certificate including the server's public key.\n          type: string\n        user_cert:\n          description: User certificate including the user's public key.\n          type: string\n        user_key:\n          description: User's private key.\n          type: string\n    Container:\n      properties:\n        Command:\n          description: The command and arguments that were passed to the container during container creation. This command is executed when the container is started.\n          type: string\n        ContainerState:\n          description: \"The current status of the container. The status can either be a transient state, such as BUILDING, and NETWORKING or a non-transient state, such as RUNNING, SHUTDOWN, CRASHED, PAUSED, or SUSPENDED. \"\n          type: string\n        Created:\n          description: The time when the container was created.\n          format: float\n          type: number\n        Env:\n          description: A list of all the environment variables of the container.\n          items:\n            type: string\n          type: array\n        Group:\n          $ref: \"#/components/schemas/Group\"\n        Id:\n          description: Unique identifier representing a container.\n          type: string\n        Image:\n          description: Full path to the container image in your private Bluemix registry.\n          type: string\n        ImageId:\n          description: Unique identifier representing a container image.\n          type: string\n        Labels:\n          description: List of custom metadata that was added to the container. Labels serve a wide range of uses, such as adding notes to a container. Every label is a key/ value pair.\n          type: object\n        Memory:\n          description: The amount of container memory in Megabyte that was assigned to your container. The memory is counted towards the quota that is allocated for the space.\n          format: int32\n          type: integer\n        Name:\n          description: \"The name of the container. \"\n          type: string\n        Names:\n          description: The name of the container.\n          items:\n            type: string\n          type: array\n        NetworkSettings:\n          $ref: \"#/components/schemas/NetworkSetting\"\n        Ports:\n          $ref: \"#/components/schemas/Port\"\n        SizeRootFs:\n          description: \"Total size of all the files in the container, in bytes. \"\n          type: integer\n        SizeRw:\n          description: The size of the files which have been created or changed, if you compare the container to its base image. Just after creation, this should be zero. Ass you modify (or create) files, this size will increase.\n          type: integer\n        Started:\n          description: Time when the container was started.\n          format: float\n          type: number\n        Status:\n          description: The current status of the container. The status can either be a transient state, such as BUILDING, and NETWORKING or a non-transient state, such as RUNNING, SHUTDOWN, CRASHED, PAUSED, or SUSPENDED\n          type: string\n        VCPU:\n          description: Number of virtual CPUs that are assigned to the container.\n          type: integer\n    ContainerConfig:\n      properties:\n        ArgsEscaped:\n          description: \"\"\n          type: boolean\n        AttachStderr:\n          description: Attaches the container to stderr.\n          type: string\n        AttachStdin:\n          description: Attaches the container to sdtin.\n          type: string\n        AttachStdout:\n          description: Attaches the container to stdout.\n          type: string\n        Cmd:\n          description: |\n            The command and arguments in this list are passed to the container to be executed when the container is started. This command must be a long-running command. Do not use a short-lived command, for example, /bin/date, because it might cause the container to crash. \u003cbr\u003eSample long-running commands:\u003cbr\u003e[\"ping\",\"localhost\"]\u003cbr\u003e[\"tail\",\"-f\",\"/dev/null\"]\u003cbr\u003e[\"sh\",\"-c\",\"while true; do date; sleep 20; done\"]\n          items:\n            type: string\n          type: array\n        Domainname:\n          description: The domain name to be used for the container.\n          type: string\n        Env:\n          description: A list of environment variables in the form of key=value pairs. All keys in this list have to be unique. List multiple keys separately and if you include quotation marks, include them around both the environment variable name and the value.\n          items:\n            type: string\n          type: array\n        ExposedPorts:\n          description: \"List of public ports that were exposed during container creation. \"\n          items:\n            type: string\n          type: array\n        Hostname:\n          description: The host name to be used for the container.\n          type: string\n        Image:\n          description: Full path to the image that the container is based on in your private Bluemix registry.\n          type: string\n        ImageArchitecture:\n          description: The hardware architecture the image is based on. It can either be 'amd64' indicating an Intel-based architecture, or 'ppc64le' representing a Power-based architecture.\n          type: string\n        Labels:\n          description: List of custom metadata that was added to the container. Labels serve a wide range of uses, such as adding notes to a container. Every label is a key/ value pair.\n          items:\n            type: string\n          type: array\n        Memory:\n          description: The amount of container memory that is assigned to the container in Megabyte.\n          format: int32\n          type: integer\n        MemorySwap:\n          description: The total container memory limit (memory + swap)\n          type: string\n        OpenStdin:\n          description: \"When set to true, it opens stdin. \"\n          type: string\n        PortSpecs:\n          description: Not supported by IBM Containers, empty string.\n          type: string\n        StdinOnce:\n          description: When set to true it closes stdin after the attached client disconnects.\n          type: string\n        Tty:\n          description: When set to true, attach standard streams to a tty, including stdin if it is not closed.\n          type: string\n        User:\n          description: User to be used inside the container.\n          type: string\n        VCPU:\n          description: Number of virtual CPUs that are assigned to the container.\n          format: int32\n          type: integer\n        VolumesFrom:\n          description: List of volumes to inherit from another container. This feature is not supported in IBM Containers.\n          type: string\n        WorkingDir:\n          description: \"The working directory inside the container where specified commands are executed. \"\n          type: string\n    ContainerId:\n      properties:\n        Id:\n          description: Unique ID representing a container.\n          type: string\n        flavor_id:\n          description: The ID of the container size.\n          type: integer\n        mem:\n          description: The amount of container memory that has been assigned to the container. If the container memory was not specified in the API request, a container with 64 Megabyte container memory is created by default.\n          type: integer\n        vcpu:\n          description: Number of virtual CPUs that are assigned to the container.\n          type: integer\n    ContainerInfo:\n      properties:\n        BluemixApp:\n          description: The name of the Cloud Foundry app that was bound to the container during creation.\n          type: string\n        BluemixServices:\n          description: The name of the Bluemix service instance that was bound to the container during creation.\n          type: string\n        Config:\n          $ref: \"#/components/schemas/ContainerConfig\"\n        ContainerState:\n          description: The current status of the container. This state can either be transient, such as BUILDING or NETWORKING, or non-transient, such as RUNNING, SHUTDOWN, CRASHED, or SUSPENDED.\n          type: string\n        Created:\n          description: The date and time the container was created.\n          format: date-time\n          type: string\n        Group:\n          $ref: \"#/components/schemas/Group\"\n        HostConfig:\n          $ref: \"#/components/schemas/HostConfig\"\n        HostId:\n          description: The ID representing the physical compute host.\n          type: string\n        Human_Id:\n          description: \"The name of the container. \"\n          type: string\n        Id:\n          description: Unique identifier representing a container.\n          type: string\n        Image:\n          description: Unique identifier representing a container image.\n          type: string\n        Mounts:\n          description: A list of volumes that are mounted to the container.\n          items:\n            type: string\n          type: array\n        Name:\n          description: The name of the container.\n          type: string\n        NetworkSettings:\n          $ref: \"#/components/schemas/NetworkSetting\"\n        Path:\n          description: The environment variable indicating the binary location.\n          type: string\n        ResolveConfPath:\n          description: Path to the resolve.conf file inside the container. The resolve.conf file is used to resolve the DNS servers.\n          type: string\n        State:\n          $ref: \"#/components/schemas/ContainerState\"\n        Volumes:\n          $ref: \"#/components/schemas/Volume\"\n        VolumesRW:\n          description: LIst of volumes that is mounted to the container.\n          items:\n            type: string\n          type: array\n    ContainerState:\n      properties:\n        ExitCode:\n          description: \"The exit code indicating the root cause of why the container exited. Review the Docker API documentation to find a list of exit codes and their meaning. \"\n          type: string\n        FinishedAt:\n          description: Time when the container stopped.\n          type: string\n        Ghost:\n          description: Not supported by IBM Containers, empty string\n          type: string\n        Pid:\n          description: The process ID on the compute host that runs the container process.\n          type: integer\n        Running:\n          description: \"If set to true, the container is in a RUNNING state. If set to false, the container has stopped or crashed. \"\n          type: boolean\n        StartedAt:\n          description: Time when the container started.\n          type: string\n        Status:\n          description: The current status of the container. This state can either be transient, such as BUILDING or NETWORKING, or non-transient, such as RUNNING, SHUTDOWN, CRASHED, or SUSPENDED.\n          type: string\n    ContainersGroupsGetListItem:\n      properties:\n        Creation_time:\n          description: Time when the container group is created.\n          type: string\n        Id:\n          description: Unique identifier of the container group.\n          type: string\n        Name:\n          description: Name of the container group.\n          type: string\n        Port:\n          description: The port number that is exposed to the public during container group creation.\n          format: int32\n          type: integer\n        Routes:\n          description: The public route that is mapped to the container group. You can use this route to access your container group from the Internet.\n          items:\n            type: string\n          type: array\n        Status:\n          description: Current status of the container group. The container group status is a composite of ACTION and STATUS:\u003cbr\u003e\u003cbr\u003e ACTIONS = (CREATE, DELETE, UPDATE, ROLLBACK, SUSPEND, RESUME, ADOPT, SNAPSHOT, CHECK, RESTORE)\u003cbr\u003e\u003cbr\u003e STATUSES = (IN_PROGRESS, FAILED, COMPLETE)\n          type: string\n        Updated_time:\n          description: Time when the container group is changed and updated.\n          type: string\n    ContainersGroupsNameOrIdGetDetails:\n      properties:\n        Anti-affinity:\n          description: \"If set to `true` the container instances in the group are spread across separate physical compute nodes, which reduces the likelihood of containers crashing due to hardware failures. If set to `false`, the container instances in the group share the same physical compute node. \"\n          type: string\n        Autorecovery:\n          description: Can be either true or false. If set to true, the Autorecovery mode is enabled for your container group. In case a container instance crashes or stops, this instance is removed and a new one is automatically recreated. If set to false, the Autorecovery mode is disabled. In case a container instances crashes or stops, it is not automatically recreated by IBM Containers.\n          type: string\n        AvailabilityZone:\n          description: \"Current IBM Containers availability zone on Openstack. \"\n          type: string\n        Cmd:\n          description: \"The Docker command that was specified to be run when the container instances are started. \"\n          items:\n            type: string\n          type: array\n        Creation_time:\n          description: Timestamp when the container group was created.\n          type: string\n        Env:\n          description: The list of environmental variables that were defined for the container group. Each environment variable consists of a unique key and a value.\n          items:\n            type: string\n          type: array\n        Id:\n          description: Unique identifier representing a specific container group.\n          type: string\n        Image:\n          description: The unique ID of the container image your container group instances are based on.\n          type: string\n        ImageName:\n          description: The full path to the container image in your private Bluemix repository.\n          type: string\n        Memory:\n          description: The size of each container instance that runs in the container group in MegaByte.\n          format: int32\n          type: integer\n        Name:\n          description: The name of the container group.\n          type: string\n        NumberInstances:\n          properties:\n            CurrentSize:\n              description: \"The current number of container instances that are running in your container group. \"\n              format: int32\n              type: integer\n            Desired:\n              description: The number of container instances that you require.\n              format: int32\n              type: integer\n            Max:\n              description: The maximum number of container instance that you want to run in your container group.\n              format: int32\n              type: integer\n            Min:\n              description: The minimum number of container instances that you want to run in your container group.\n              format: int32\n              type: integer\n          type: object\n        Port:\n          description: \"The public port that has been exposed. If you specified a route, your container group is accessible from the Internet. \"\n          format: int32\n          type: integer\n        Route_Status:\n          properties:\n            in_progress:\n              description: Can be either true or false. If set to true, then the route is in the process of being mapped to the container group and set up in the GoRouter. Is set to false, then the set up of the route is completed.\n              type: boolean\n            message:\n              description: Info message for the user.\n              type: string\n            successful:\n              description: Can be either true or false. If set to true, then the route is successfully registrered with the GoRouter. If set to false, then the route registration has not yet finished yet or could not be completed without errors.\n              type: boolean\n          type: object\n        Routes:\n          description: The public route that is mapped to the container group. When you expose a public port, you can use the route to access your container group from the Internet.\n          items:\n            type: string\n          type: array\n        Status:\n          description: The current status of the container group. The container group status is a composite of ACTION and STATUS:\u003cbr\u003e\u003cbr\u003e ACTIONS = (CREATE, DELETE, UPDATE, ROLLBACK, SUSPEND, RESUME, ADOPT, SNAPSHOT, CHECK, RESTORE)\u003cbr\u003e\u003cbr\u003e STATUSES = (IN_PROGRESS, FAILED, COMPLETE)\n          type: string\n        UpdatedTime:\n          description: Timestamp when the container group was updated. If the container group was not updated before, `null` is returned.\n          type: string\n        Volumes:\n          description: List of volumes to be associated with the container, in the format of volume name:path:mode where mode can be ro or rw.\n          items:\n            type: string\n          type: array\n    ContainersGroupsNameOrIdMaproutePostInfo:\n      allOf:\n        - $ref: \"#/components/schemas/ContainersGroupsPostCreatedInfo\"\n        - type: object\n    ContainersGroupsNameOrIdPatchUpdatedInfo:\n      properties:\n        Autorecovery:\n          description: \"Enable or disable the Autorecovery mode for your container group. To enable it, enter true. If you want to disable it, enter false. Note: You can only enable/ disable Autorecovery mode if your container group was initially created with Autorecovery mode enabled.\"\n          type: string\n        Environment:\n          description: A list of environment variables that you want to add to your container group. Every environment variable needs to be a key=value pair. Every key that you use needs to be unique for this container group. Multiple environment variables are separated with comma (,)\n          items:\n            type: string\n          type: array\n        NumberInstances:\n          properties:\n            Desired:\n              description: The number of container instances that you require.\n              format: int32\n              type: integer\n            Max:\n              description: The maximum number of container instances that you want to run in your container group.\n              format: int32\n              type: integer\n            Min:\n              description: The minimum number of container instances that you want to run in your container group.\n              format: int32\n              type: integer\n          type: object\n    ContainersGroupsPostCreatedInfo:\n      properties:\n        Id:\n          description: Unique identifier representing a specific container group.\n          type: string\n        Warnings:\n          description: Warning information (Initial warning is empty).\n          items:\n            type: string\n          type: array\n      type: object\n    ContainersGroupsPostRequiredAttributes:\n      properties:\n        Autorecovery:\n          description: (Optional) Enable the Auto-recovery mode for your container group. If set to true, IBM Containers checks the health of each instance with an HTTP request to the port that is assigned. If the health check does not receive a TCP response from a container instance in two subsequent 90-second intervals, the instance is removed and replaced with a new instance. If set to false and container instances crash, they are not recovered by IBM Containers.\n          type: string\n        BluemixApp:\n          description: (Optional) The name of the Cloud Foundry app that you created in your organization space.\n          type: string\n        Cmd:\n          description: (Optional) Docker command that is passed to the container group to be run when the container instances are started. This command must be a long-running command. Do not use a short-lived command, for example, /bin/date, because it might cause the container to crash.\n          items:\n            type: string\n          type: array\n        Env:\n          description: (Optional) List of environmental variables. Every environment variable that is listed here needs to be a key=value pair. Every key that you use needs to be unique for this container group. Multiple environment variables are separated with comma (,).\n          items:\n            type: string\n          type: array\n        Image:\n          description: \"(Required) The full path to your private Bluemix repository. If you want to use an image in your private Bluemix repository, specify the image in the following format: registry.ng.bluemix.net/NAMESPACE/IMAGE. If you want to use an IBM Containers provided image, do not include your organization's namespace. Specify the image in the following format: registry.ng.bluemix.net/IMAGE\"\n          type: string\n        Memory:\n          description: \"(Optional) The size of each container instance in the container group. The size of each container instance in the group. Choose one of the following sizes and enter the size in MegaBytes: Pico 64 MB, Nano 128 MB, Micro 256 MB, Tiny 512 MB, Small 1 GB (1024 MB), Medium 2 GB (2048 MB), Large 4 GB (4096 MB) XLarge 8GB (8192 MB) and 2XLarge 16 GB (16384 MB). If you do not specify a size, all container instances in this group are created with 256 MB.\"\n          format: int32\n          type: integer\n        Name:\n          description: (Required) Name of the container group that you want to create. The name needs to be unique in your organization space and must start with a letter. Then, you can include uppercase letters, lowercase letters, numbers, periods (.), underscores (_), or hyphens (-).\n          type: string\n        NumberInstances:\n          properties:\n            Desired:\n              description: (Optional) The number of container instances that you require.\n              format: int32\n              type: integer\n            Max:\n              description: (Optional) The maximum number of container instances that you want to run in your container group.\n              format: int32\n              type: integer\n            Min:\n              description: (Optional) The minimum number of container instances that need to run in your container group.\n              format: int32\n              type: integer\n          type: object\n        Port:\n          description: '(Optional) Expose a port for HTTP traffic to make your container group available from the Internet. Every container instance that is started for this group, listens on this port. Container groups cannot expose multiple ports. Note: You need to expose a port, when \"Autorecovery\" is set to true.'\n          format: int32\n          type: integer\n        Route:\n          properties:\n            domain:\n              description: The default system domain is mybluemix.net and already provides a SSL certificate, so you can access your container groups with HTTPS without any additional configuration.\n              type: string\n            host:\n              description: \"The host name of your container group, such as mycontainerhost. Do not include underscores (_) in the host name. The host and the domain combined form the full public route URL, such as http://mycontainerhost.mybluemix.net. \"\n              type: string\n          type: object\n        Volumes:\n          description: \"(Optional) List of volumes to be mounted to the container instances of your container group. You need to create the volume first by using the cf ic volume-create command before you can mount a volume to a container group. When you specify a volume, use the following format: NAME:PATH:MODE. For NAME, use either the name or ID of the volume. For the PATH, enter the absolute path to the volume directory in the container. For MODE, enter either ro (read-only) or rw (read-write).\"\n          items:\n            type: string\n          type: array\n      required:\n        - Name\n        - Image\n    ContainersQuotaInfo:\n      properties:\n        account_type:\n          description: The Bluemix account type indicating the quota limits and how the organization is billed.\n          type: string\n        country_code:\n          description: The country in which the account was opened.\n          type: string\n        org_quota:\n          properties:\n            floating_ips_max:\n              description: The number of public IP addresses that can be assigned across all spaces of the organization.\n              type: string\n            floating_ips_space_default:\n              description: \"The number of public IP addresses that are required for one space. If the number of public IP addresses is not available, then a new space cannot be created to be used with IBM Containers. \"\n              type: string\n            floating_ips_usage:\n              description: The number of public IP addresses that are currently assigned to the spaces of the organization.\n              format: int32\n              type: integer\n            ram_max:\n              description: The maximum amount of container memory on the compute host that can be assigned across the spaces of the organization.\n              format: int32\n              type: integer\n            ram_space_default:\n              description: \"The amount of container memory that is required to be used for one space. If this amount is not available, then a new space cannot be created to be used with IBM Containers. \"\n              format: int32\n              type: integer\n            ram_usage:\n              description: The amount of container memory that is currently used across all spaces of the organization.\n              format: int32\n              type: integer\n            subnet_usage:\n              description: The number of subnets that were created across all spaces of the organization.\n              format: int32\n              type: integer\n            subnets_default:\n              description: The number of subnets that is required to create a new space. If this number is not available, then a new space cannot be created to be used with IBM Containers.\n              format: int32\n              type: integer\n            subnets_max:\n              description: The maximum number of container private subnet that can be created across all spaces of the organization.\n              format: int32\n              type: integer\n          type: object\n        space_quota:\n          properties:\n            floating_ips_max:\n              description: The maximum number of public IP addresses that can be allocated to a space.\n              type: string\n            ram_max:\n              description: The maximum amount of container memory that can be shared across all containers that are created in a space.\n              format: int32\n              type: integer\n            subnets_max:\n              description: The maximum number of private subnets that can be created in one space.\n              format: int32\n              type: integer\n          type: object\n    ContainersQuotaList:\n      properties:\n        floating_ips:\n          description: The new number of public IP addresses that you want to assign to your space.\n          format: int32\n          type: integer\n        ram:\n          description: The amount of container memory that you want to assign to your space.\n          format: int32\n          type: integer\n    ContainersUsageInfo:\n      properties:\n        AvailableSizes:\n          items:\n            $ref: \"#/components/schemas/ContainersUsageInfoAvailableSizes\"\n          type: array\n        Environment:\n          description: The IBM Containers machine where the space is located\n          type: string\n        Limits:\n          properties:\n            containers:\n              description: \"The number of containers that can be created in the space. If -1 is returned, then an unlimited number of containers can be created. The number however is counted towards and limited by the container memory. \"\n              format: int32\n              type: integer\n            floating_ips:\n              description: The number of public IP addresses that can be allocated to the space.\n              format: int32\n              type: integer\n            memory_MB:\n              description: The amount of container memory that can be used in the space in megabyte.\n              format: int32\n              type: integer\n            vcpu:\n              description: The number of virtual CPUs that are assigned to the space.\n              format: int32\n              type: integer\n          type: object\n        Usage:\n          properties:\n            containers:\n              description: The number of containers that were created in the space. All containers that count towards the quota limit are listed independent on their current state.\n              format: int32\n              type: integer\n            floating_ips:\n              description: The number of public IP addresses that are allocated to the space.\n              format: int32\n              type: integer\n            floating_ips_bound:\n              description: The number of public IP addresses that are bound to a container in the space.\n              format: int32\n              type: integer\n            images:\n              description: The number of private images that were added to the private Bluemix registry.\n              format: int32\n              type: integer\n            memory_MB:\n              description: The amount of container memory that is already used by the containers that were created in the space in megabyte.\n              format: int32\n              type: integer\n            running:\n              description: The number of containers that are currently in a running state.\n              format: int32\n              type: integer\n            vcpu:\n              description: The number of virtual CPUs that are allocated to the space.\n              format: int32\n              type: integer\n          type: object\n    ContainersUsageInfoAvailableSizes:\n      properties:\n        disk:\n          description: The amount of disk space on the compute host that is assigned to the container in gigabyte\n          format: int32\n          type: integer\n        id:\n          description: The ID of the container size.\n          type: string\n        memory_MB:\n          description: The amount of container memory on the compute host that is assigned to the container in megabyte.\n          format: int32\n          type: integer\n        name:\n          description: The IBM Containers name of the container size.\n          type: string\n        vcpus:\n          description: The number of virtual CPUs that can be assigned to the container.\n          format: int32\n          type: integer\n    ContainersVersionGetInfo:\n      properties:\n        ApiVersion:\n          description: The current API version.\n          type: string\n        Arch:\n          description: The current Arch version.\n          type: string\n        BuildDetail:\n          properties:\n            api:\n              description: The build ID of the current API version.\n              type: string\n            automount:\n              description: The build ID of the current automount microservice version.\n              type: string\n            grupdater:\n              description: The build ID of the current grupdater microservice version.\n              type: string\n            harmony:\n              description: The build ID of the current harmony microservice version.\n              type: string\n            health-monitor:\n              description: The build ID of the current health-monitor microservice version.\n              type: string\n            hijack:\n              description: The build ID of the current hijack microservice version.\n              type: string\n            ldap:\n              description: The build ID of the current ldap microservice version.\n              type: string\n            logmet:\n              description: The build ID of the current logmet microservice version.\n              type: string\n            lumberjack:\n              description: The build ID of the current lumberjack microservice version.\n              type: string\n            redis-cluster:\n              description: The build ID of the current redis-cluster version.\n              type: string\n            sgwatcher:\n              description: The build ID of the current sgwatcher microservice version.\n              type: string\n            volmgr:\n              description: The build ID of the current volumes manager microservice version.\n              type: string\n          type: object\n        BuildID:\n          description: \"\"\n          type: string\n        BuildNumber:\n          description: \"\"\n          type: string\n        BuildTime:\n          description: Timestamp when the API version and all attached microservices were built.\n          type: string\n        GitCommit:\n          description: \"\"\n          type: string\n        GoVersion:\n          description: The latest Go version.\n          type: string\n        KernelVersion:\n          description: The latest Kernel version.\n          type: string\n        Os:\n          description: Bluemix Containers\n          type: string\n        Version:\n          description: The latest API version.\n          type: string\n    CreateContainer:\n      properties:\n        BluemixApp:\n          description: The name of the Cloud Foundry app that you want to bind to your container. The Cloud Foundry app must be created in the same space where you want to create your container.\n          type: string\n        Cmd:\n          description: |\n            The command and arguments in this list are passed to the container to be executed when the container is started. This command must be a long-running command. Do not use a short-lived command, for example, /bin/date, because it might cause the container to crash. \u003cbr\u003eSample long-running commands:\u003cbr\u003e[\"ping\",\"localhost\"]\u003cbr\u003e[\"tail\",\"-f\",\"/dev/null\"]\u003cbr\u003e[\"sh\",\"-c\",\"while true; do date; sleep 20; done\"]\n          items:\n            type: string\n          type: array\n        Cpuset:\n          description: \"Pins the container processes to a specific CPU core on the compute host. For example: 0 means that processes are executed on the first core only.\"\n          type: string\n        Env:\n          description: A list of environment variables in the form of key=value pairs. All keys in this list have to be unique. List multiple keys separately and if you include quotation marks, include them around both the environment variable name and the value.\n          items:\n            type: string\n          type: array\n        ExposedPorts:\n          description: All public ports that need to be exposed for the container, so the container can be accessed from the Internet.\n          items:\n            type: string\n          type: array\n        HostConfig:\n          $ref: \"#/components/schemas/HostConfig\"\n        Image:\n          description: \"Full path to the image in your private Bluemix registry in the format `registry.ng.bluemix.net/namespace/image`. \"\n          type: string\n        Memory:\n          description: \"The container memory that is set for the container in Megabyte. Choose one of the following sizes: Pico 64 MB, Nano 128 MB, Micro 256 MB, Tiny 512 MB, Small 1 GB (1024 MB), Medium 2 GB (2048 MB), Large 4 GB (4096 MB) XLarge 8GB (8192 MB) and 2XLarge 16 GB (16384 MB).\"\n          format: int32\n          type: integer\n        NumberCpus:\n          description: Number of virtual CPUs that are allocated to the container.\n          format: int32\n          type: integer\n        Volumes:\n          description: \"Mount a volume to a container by specifying the details in the following format: `VOLUME_NAME:/DIRECTORY_PATH[:ro]`. Example: testvolume:/volumedata/temp:rw. By default, all volumes will be set up with read-write access inside the container (rw). If you wish to set up your volume with read-only access, enter `ro`.  Note: To mount a volume to a container, you must create the volume in your space first by using the `cf ic volume-create` command, or calling the `POST /volumes/create endpoint`.\"\n          type: string\n      required:\n        - Image\n    Fileshare:\n      properties:\n        capacity:\n          description: The size of the file share in gigabyte.\n          type: integer\n        created_date:\n          description: The timestamp when the file share was created.\n          type: string\n        fsName:\n          description: The name of the file share.\n          type: string\n        hostPath:\n          description: The path to the volume on the host node.\n          type: string\n        iops:\n          description: \"The number of Input/Output operations per second. \"\n          format: double\n          type: number\n        iopsTotal:\n          description: The total number of IOPS considering the size of the file share. The size of your file share in gigabyte multiplied with the number of IOPS indicates the total number of IOPS. The higher the number of IOPS the faster you can read from and write to your volumes.\n          type: integer\n        orderId:\n          description: The ID received from softlayer when the file share was ordered to be set up in softlayer.\n          type: string\n        provider:\n          description: The provider of the file share.\n          type: string\n        spaceGuid:\n          description: The unique ID representing a Bluemix space in which the file share was created.\n          type: string\n        state:\n          description: The current state of the file share. When the file share is ready to be used, this attribute is set to `READY`.\n          type: string\n        updated_date:\n          description: The timestamp when the file share last was updated.\n          type: string\n      type: object\n    FileshareParam:\n      properties:\n        fsIOPS:\n          description: The number of input/output transactions per second. Available values are 0.25, 2 or 4.\n          format: double\n          type: number\n        fsName:\n          description: The name of the new file share that you want to create. The name can contain uppercase letters, lowercase letters, numbers, underscores (_), and hyphens (-).\n          type: string\n        fsSize:\n          description: \"The size of the file share in gigabyte. Run `cf ic volume fs-flavor-list` or call the GET /volumes/fs/flavors/json API endpoint to retrieve a list of available file share sizes. \"\n          type: integer\n      required:\n        - fsName\n        - fsSize\n        - fsIOPS\n      type: object\n    FileshareUsage:\n      properties:\n        available_space:\n          description: The amount of space that is available in the file share in gigabytes.\n          type: string\n        total_space:\n          description: The total size of the file share in gigabytes.\n          type: string\n        used_space:\n          description: \"The amount of space that is currently used from the file share. \"\n          type: string\n        used_space_percentage:\n          description: The amount of space that is currently used from the file share in percentage.\n          type: string\n      type: object\n    FloatingIP:\n      properties:\n        Bindings:\n          $ref: \"#/components/schemas/Binding\"\n        IpAddress:\n          description: The public IP address that is allocated to the organization space.\n          type: string\n    GetFileshareDetails:\n      properties:\n        fs:\n          items:\n            $ref: \"#/components/schemas/Fileshare\"\n          type: array\n        fsUsage:\n          items:\n            $ref: \"#/components/schemas/FileshareUsage\"\n          type: array\n        volnames:\n          description: A list of volume names that are mounted to the file share.\n          items:\n            type: string\n          type: array\n      type: object\n    Group:\n      properties:\n        Id:\n          description: Unique identifier representing a group.\n          type: string\n        Name:\n          description: Name of the group.\n          type: string\n    HostConfig:\n      properties:\n        Binds:\n          description: \"A list of volumes to be bound to the container. Each volume must be listed in the following format: VOLNAME:/CONTAINER_PATH:rw [ro]. \"\n          items:\n            type: string\n          type: array\n        ExtraHosts:\n          description: |\n            A list of hostnames/IP mappings to be added to the container’s /etc/hosts file. Specified in the form [\"hostname:IP\"]\n          items:\n            type: string\n          type: array\n        Links:\n          description: A list of containers that need to be linked.\n          items:\n            type: string\n          type: array\n        PortBindings:\n          description: |\n            The container ports that you want to expose to the public. Ports need to be specified in the form of \u0026lt;port\u0026gt;/\u0026lt;protocol\u0026gt;: [{ \"HostIp\": \"\u0026lt;IP\u0026gt;\", \"HostPort\": \"\u0026lt;port\u0026gt;\" }]\n          items:\n            type: string\n          type: array\n      type: object\n    ImageDetail:\n      properties:\n        Architecture:\n          description: \"The hardware architecture for which the image was built for. The architecture can either be Intel (amd64) or Power (ppc64le). \"\n          type: string\n        Config:\n          properties:\n            ArgsEscaped:\n              description: \"\"\n              type: boolean\n            AttachStderr:\n              description: Attaches the container to stderr.\n              type: boolean\n            AttachStdin:\n              description: Attaches the container to stdin.\n              type: boolean\n            AttachStdout:\n              description: Attaches the container to stdout.\n              type: boolean\n            Cmd:\n              description: |\n                The command and arguments in this list are passed to the container to be executed when the container is started. This command must be a long-running command. Do not use a short-lived command, for example, /bin/date, because it might cause the container to crash. \u003cbr\u003eSample long-running commands:\u003cbr\u003e[\"ping\",\"localhost\"]\u003cbr\u003e[\"tail\",\"-f\",\"/dev/null\"]\u003cbr\u003e[\"sh\",\"-c\",\"while true; do date; sleep 20; done\"]\n              items:\n                type: string\n              type: array\n            Domainmame:\n              description: The domain name to be used for the container.\n              type: string\n            Entrypoint:\n              description: The entrypoint specifies a command that will always be executed when the container starts.\n              type: string\n            Env:\n              description: A list of environment variables in the form of key=value pairs. All keys in this list have to be unique. List multiple keys separately and if you include quotation marks, include them around both the environment variable name and the value.\n              items:\n                type: string\n              type: array\n            ExposedPorts:\n              description: A list of all udp and tcp ports that have been publicly exposed during the container creation.\n              items:\n                type: string\n              type: array\n            Hostname:\n              description: \"The host name of the container provided by Openstack. \"\n              type: string\n            Image:\n              description: \"The unique ID of the image. \"\n              type: string\n            Labels:\n              description: List of custom metadata that was added to the image. Labels serve a wide range of uses, such as adding notes or license requirements to an image. Every label is a key/ value pair.\n              items:\n                type: string\n              type: array\n            OnBuild:\n              description: ???\n              items:\n                type: string\n              type: array\n            OpenStdin:\n              description: When set to true, it opens stdin.\n              type: boolean\n            StdinOnce:\n              description: When set to true it closes stdin after the attached client disconnects.\n              type: boolean\n            Tty:\n              description: When set to true, attach standard streams to a tty, including stdin if it is not closed.\n              type: boolean\n            User:\n              description: The user to be used inside the container.\n              type: string\n            Volumes:\n              description: Docker specific. Not supported by IBM Containers. The path to the volume that is created when deploying a container from the image. To use a volume in IBM Containers, you must first create a volume and then mount it to your container during creation.\n              type: string\n            WorkingDir:\n              description: The working directory inside the container where specified commands are executed.\n              type: string\n          type: object\n        Container:\n          description: ???\n          type: string\n        ContainerConfig:\n          $ref: \"#/components/schemas/ContainerConfig\"\n        Created:\n          description: The time when the image was created.\n          type: string\n        DockerVersion:\n          description: ???\n          type: string\n        Id:\n          description: \"Unique ID of the image that you inspected. \"\n          type: string\n        Os:\n          description: ???\n          type: string\n        Parent:\n          description: The ID of the parent image that was used to build this image.\n          type: string\n        Size:\n          description: \"The real size of the image. \"\n          format: int32\n          type: integer\n        Tag:\n          description: \"The version of the image \"\n          type: string\n        Throwaway:\n          description: ???\n          type: string\n        VirtualSize:\n          description: The virtual size of the image.\n          format: int32\n          type: integer\n      type: object\n    ImageInfo:\n      properties:\n        Created:\n          description: \"The time when your container image was created. \"\n          format: float\n          type: number\n        Id:\n          description: \"The unique identifier representing a container image. \"\n          type: string\n        Image:\n          description: The name of your container image.\n          type: string\n        RepoTags:\n          description: The full path to the private Bluemix registry where the image is stored including the registry name, the organization namespace, and image tag.\n          items:\n            type: string\n          type: array\n        Size:\n          description: The real size of the container image.\n          format: int32\n          type: integer\n        VirtualSize:\n          description: The virtual size of the container image.\n          format: int32\n          type: integer\n    Namespace:\n      properties:\n        namespace:\n          description: The namespace that is either set for an organization, or a namespace that is not available to be used in Bluemix.\n          type: string\n      type: object\n    Network:\n      properties:\n        Aliases:\n          description: Alternative name of the private container network the container is connected to.\n          type: string\n        EndpointID:\n          description: Unique ID representing a container.\n          type: string\n        Gateway:\n          description: The private IP address of the network gateway in IPv4 format.\n          type: string\n        GlobalIPv6Address:\n          description: Private IP address of the container in IPv6 format. IBM Containers only supports IPv4 format. This attribute is returned as empty.\n          type: string\n        GlobalIPv6PrefixLen:\n          description: Not supported by IBM Containers, empty string.\n          type: integer\n        IPAMConfig:\n          description: Specific configurations for the network driver.\n          type: string\n        IPPrefixLen:\n          description: \"The prefix of the subnet in the private container network. The prefix indicates that 16 bits out of 32 bits are used to address the network. As every IPv4 IP adress consists of 32 bits, the last 16 bits are used to assign private IP addresses to the container. \"\n          type: string\n        IPv6Gateway:\n          description: The private IP address of the network gateway in IPv6 format. IBM Containers only supports IPv4 format. This attribute is returned as empty.\n          type: string\n        Links:\n          description: \"List of container names that are linked to the container. \"\n          type: string\n        MacAddress:\n          description: The MAC address that is assigned to the container.\n          type: string\n        NetworkID:\n          description: Unique identifier representing the private container network.\n          type: string\n    NetworkSetting:\n      properties:\n        Bridge:\n          description: The name of the private network bridge.\n          type: string\n        Gateway:\n          description: The IP address of the private network gateway in IPv4 format.\n          type: string\n        IpAddress:\n          description: The private IP address that is assigned to the container.\n          type: string\n        IpPrefixLen:\n          description: \"\"\n          format: int32\n          type: integer\n        MacAddress:\n          description: \"The MAC address that was assigned to the container. \"\n          type: string\n        Network:\n          $ref: \"#/components/schemas/Network\"\n        PortMapping:\n          description: \"Specific to Docker. List of private container ports and their mapping to the host ports. In IBM Containers all container ports are exposed on the host by default. This attribute is returned as an empty list. \"\n          type: string\n        Ports:\n          description: All ports of the container that were exposed to the public.\n          items:\n            type: string\n          type: array\n        PublicIpAddress:\n          description: The Public IP address that was bound to the container.\n          type: string\n      required:\n        - IpAddress\n        - PublicIpAddress\n    Port:\n      properties:\n        IP:\n          description: Public IP address that was bound to the container in IPv4 format.\n          type: string\n        PrivatePort:\n          description: The private port of the container on which the container listens during run time.\n          type: string\n        PublicPort:\n          description: The public port that was exposed during container creation. When a public port is exposed, a public IP address can be bound to the container which makes the container accessible from the internet.\n          type: string\n        Type:\n          description: \"The type of IP protocol that is used for the port. It can either be `udp` or `tcp`.  \"\n          type: string\n    Route:\n      description: The public route that is mapped to the container group. You can use this route to access your container group from the Internet.\n      properties:\n        domain:\n          description: The default system domain is mybluemix.net and already provides a SSL certificate, so you can access your container groups with HTTPS without any additional configuration.\n          type: string\n        host:\n          description: The host name of your container group, such as mycontainerhost. Do not include underscores (_) in the host name. The host and the domain combined form the full public route URL, such as http://mycontainerhost.mybluemix.net.\n          type: string\n      type: object\n    UpdateVolume:\n      properties:\n        addSpaces:\n          description: \"The name or ID of the space where you want to provision your existing volume. Run `cf spaces` to retrieve the name, or `cf space \u003cspace_name\u003e --guid` to retrieve the space ID. \"\n          items:\n            type: string\n          type: array\n        removeSpaces:\n          description: The name or ID of the space from which you want to unprovision your existing volume. Run `cf spaces` to retrieve the name, or `cf space \u003cspace_name\u003e --guid` to retrieve the space ID.\n          items:\n            type: string\n          type: array\n    Volume:\n      properties:\n        fsID:\n          description: \" Unique identifier representing the file share on which the volume is hosted. \"\n          type: string\n        hostPath:\n          description: Full path to the mounted volume inside the container.\n          type: string\n        otherSpaceVisibility:\n          description: \"List of space IDs in which the volume is visible and can be used by all the single containers and container groups. \"\n          items:\n            type: string\n          type: array\n        spaceGuid:\n          description: Unique identifier representing the space where the volume got created.\n          type: string\n        volName:\n          description: The name of the volume.\n          type: string\n    getContainerStatus:\n      properties:\n        NameOrId:\n          description: \"The unique identifier of the container. \"\n          type: string\n        Status:\n          description: \"The current status of the container. The status can either be a transient one, such as BUILDING or NETWORKING, or a non-transient one, such as RUNNING, SHUTDOWN, CRASHED, or SUSPENDED. \"\n          type: string\n        Transient:\n          description: When set to true, the current container state is temporary and will change soon. An example for a transient state is the BUILDING state. A container that is created will be set to the BUILDING state until all container layers are created and the container is started. When set to false, the container state is permanent, such as CRASHED.\n          type: boolean\n      required:\n        - NameOrId\n",
			"canonicalURL": "/github.com/APIs-guru/openapi-directory@47bf2b618e492e31bc62743e9f72c47cb8460229/-/blob/APIs/bluemix.net/containers/3.0.0/openapi.yaml",
			"externalURLs": [
				{
					"url": "https://github.com/APIs-guru/openapi-directory/blob/47bf2b618e492e31bc62743e9f72c47cb8460229/APIs/bluemix.net/containers/3.0.0/openapi.yaml",
					"serviceKind": "GITHUB"
				}
			]
		}
	}
}