{
	"File": {
		"__typename": "FileMatch",
		"repository": {
			"name": "github.com/wework/speccy"
		},
		"file": {
			"name": "rules.yml",
			"size": 0,
			"path": "docs/_data/rules.yml",
			"byteSize": 8827,
			"content": "default:\n\n  - name: \"parameter-description\"\n    object: \"parameter\"\n    description: \"parameter objects should have a description\"\n    more: |\n      Descriptions help human beings understand what sort of value a property should have, beyond the\n      obvious type and format. If the field is `distance` and the format is `float`, you can tell the\n      reader if that field is meant to be kilometers, meters, feet, inches, miles, or yards. Same goes\n      for currency, is this Pounds Sterling or Yen?\n\n  - name:  \"operation-operationId\"\n    object: \"operation\"\n    description: \"operation should have an operationId\"\n    more: |\n      Each operation should have an operationId, which is helpful for referencing the operation later.\n\n      Some documentation systems will use it for the URL, meaning folks are going to share links to that\n      operation. If you add an operationId later, it'll break that URL, so best to create one as early as\n      possible. operationIds are also often used by code-generation tools to name route-handling functions.\n\n  - name:  \"operation-summary-or-description\"\n    object: \"operation\"\n    description: \"operation should have summary or description\"\n    more: |\n      A summary (short) or description (longer) help humans understand what this operation is meant to be\n      doing. Without explaining it for a human, they have to guess, and guessing leads to unexpected outcomes.\n\n  - name:  \"operation-tags\"\n    object: \"operation\"\n    description: \"operation should have non-empty tags array\"\n    more: |\n      Documentation systems use tags for grouping navigation, which is especially useful for larger APIs. Tags\n      can be defined in the top level `tags` object, and the operations `tags` array is simply a list of tag names.\n\n      ```\n      openapi: 3.0.1\n\n      tags:\n        - name: Pokèmon\n\n      paths:\n        /pokemons:\n          get:\n            operationId: get-pokemons\n            tags:\n              - Pokèmon\n      ```\n\n  - name: \"server-trailing-slash\"\n    object: \"server\"\n    description: \"server url should not have a trailing slash\"\n    more: |\n      The `url` in the server object should not have a trailing slash, because that `/` is actually the first\n      character of the path. Having it in both places will confuse some vendor tooling and you might see `//`\n      showing up in the full URL.\n\n      **Good**\n\n      ```\n      servers:\n        - url: https://example.org/api\n      ```\n\n      **Bad**\n\n      ```\n      servers:\n        - url: https://example.org/api/\n      ```\n\n  - name: \"path-keys-no-trailing-slash\"\n    object: \"paths\"\n    description: \"paths should not end with a slash\"\n    more: |\n      A keys in the `paths` objects should not have a trailing slash, because `/` is actually the first\n      character of the path. Having it in both places will confuse some vendor tooling and you might see `//`\n      showing up in the full URL.\n\n      **Good**\n\n      ```\n      paths:\n        /pokemons/{pokemon_id}\n      ```\n\n      **Bad**\n\n      ```\n      paths:\n        /pokemons/{pokemon_id}/\n      ```\n\n  - name:  \"openapi-tags\"\n    object: \"openapi\"\n    description: \"openapi object should have non-empty tags array\"\n    more: |\n      Documentation systems use tags for grouping navigation, which is especially useful for larger APIs. Although\n      tags can be defined on the fly in operations without defining them, a top-level `tags` object allows you\n      to control both the order tags are displayed in many tools and their descriptions.\n\n      Find all of the tags used in various operations, and define them in the top-level `tags` object.\n\n      ```\n      openapi: 3.0.1\n\n      tags:\n        - name: Gym\n        - name: Pokèmon\n\n      paths:\n        /pokemons:\n          get:\n            operationId: get-pokemons\n            tags:\n              - Pokèmon\n        /gyms:\n          get:\n            operationId: get-gyms\n            tags:\n              - Gym\n      ```\n\n  - name:  \"openapi-tags-alphabetical\"\n    object: \"openapi\"\n    description: \"openapi object should have alphabetical tags\"\n    more: |\n      Seeing as some tools render tags in the order they're defined, it's just a Good Idea™ to\n      define them in alphabetical order.\n\n  - name:  \"reference-no-other-properties\"\n    object: \"reference\"\n    description: \"reference objects should only have a $ref property\"\n    more: |\n      You should avoid having other keywords sat next to a `$ref`, as the OpenAPI\n      spec instructs tools to ignore any siblings. Due to that, putting things there is\n      not only going against the spec, but it's pointless, and potentially confusing\n      to people reading the files. It may also trigger errors in some validators.\n\n  - name:  \"example-value-or-externalValue\"\n    object: \"example\"\n    description: \"example should have either value or externalValue\"\n    more: |\n      The `value` and `externalValue` keywords are mutually exclusive, but both optional. \n      An example is of little use without one or the other!\n      \n  - name: \"no-script-tags-in-markdown\"\n    object: \"*\"\n    description: \"markdown descriptions should not contain script tags\"\n    more: |\n      Putting script tags in markdown descriptions is a recipe for disaster, as it might\n      try to run arbitrary JavaScript on documentation views, or who knows what else.\n\n      If the specs come from an untrusted source, this would be considered a\n      security concern.\n\n  - name: \"info-contact\"\n    object: \"info\"\n    description: \"info object should contain contact object\"\n    more: |\n      Users of your API should be able to contact you, so put your contact information in\n      the info object.\n\n      ``` yaml\n      openapi: 3.0.1\n      info:\n        contact:\n        name: API Support\n        url: http://www.example.com/support\n        email: support@example.com\n      ```\n\n  - name: \"license-apimatic-bug\"\n    object: \"license\"\n    description: \"license url should not point at gruntjs\"\n    more: |\n      There was a funny little bug with the Apimatic Transformer a while back where all\n      transformed OpenAPI specifications would have the license set to MIT with a URL to\n      the license file in the gruntjs repository.\n\n      This was fixed, but if you have that floating around in your spec you probably want\n      to point that somewhere else.\n\n      **Good**\n\n      ```\n      info:\n        license:\n          url: https://opensource.org/licenses/MIT\n      ```\n\n      **Bad**\n\n      ```\n      info:\n        license:\n          url: http://github.com/gruntjs/grunt/blob/master/LICENSE-MIT\n      ```\n\n  - name: \"no-eval-in-descriptions\"\n    object: \"*\"\n    description: \"markdown descriptions should not contain 'eval('\"\n    more: |\n      Letting specification authors eval random code is probably a Bad Idea™.\n\nstrict:\n  - name: \"contact-properties\"\n    object: \"contact\"\n    description: \"contact object should have name, url and email\"\n    more: \u003e\n        To make contact info the most useful, all of the options should be used. Including\n        a URL and an email address means the user has the most options to be able to get\n        in touch, maybe including a URL to your slack channel, or to a support portal,\n        and the email could be a team/company address to avoid having a single human as a\n        bottleneck.\n\n  - name: \"license-url\"\n    object: \"license\"\n    description: \"license object should include url\"\n    more: \u003e\n        Having a license is generally a helpful idea, it lets potential users know how\n        they are allowed to leverage your API. Pick one from this [great list](https://opensource.org/licenses),\n        anywhere else, or make your own and link to it.\n\n  - name: \"server-not-example.com\"\n    object: \"server\"\n    description: \"server url should not point at example.com\"\n    more: \u003e\n        You can do better than example.com! Set up at least a [mock server](http://openapi.tools/#mock),\n        maybe even a sandbox, or an actual implementation for users to play with.\n\n  - name: \"tag-description\"\n    object: \"tag\"\n    description: \"tag object should have a description\"\n    more: |\n        Adding descriptions to tags is a great way to explain business logic for the concept.\n\n        Often specifications will explain that there is a POST /foos and that creates a foo, and\n        there is a GET /foos which gets a bunch of foos, but nobody really explains what a Foo is\n        at any point.\n\n        ```\n        openapi: 3.0.1\n        tags:\n            - name: Foo\n              description: |\n                Multiple lines of text explain all about the concept of a foo in this system, how\n                they might related to other items, what sort of stage in the workflow are they\n                created, etc.\n\n                You can even put *markdown* in here!\n        ```\n",
			"canonicalURL": "/github.com/wework/speccy@3c2cc952261c4cb314b6a8729da99032417375bd/-/blob/docs/_data/rules.yml",
			"externalURLs": [
				{
					"url": "https://github.com/wework/speccy/blob/3c2cc952261c4cb314b6a8729da99032417375bd/docs/_data/rules.yml",
					"serviceKind": "GITHUB"
				}
			]
		}
	}
}