{
	"File": {
		"__typename": "FileMatch",
		"repository": {
			"name": "github.com/DataBooster/PyWebApi"
		},
		"file": {
			"name": "mdxetl.swagger.yaml",
			"size": 0,
			"path": "Sample/UserApps/MdxEtl/mdxetl.swagger.yaml",
			"byteSize": 7848,
			"content": "openapi: 3.0.0\ninfo:\n  description: |-\n    This service implements a common end-to-end MDX ETL process:\n\n    **db-\u003emdx-\u003edb**\n\n    1.  Call a stored procedure to obtain a group of MDX queries generated from the database; \n    2.  Concurrently execute this group of MDX queries and pass the query results to the corresponding stored procedures;\n    3.  (optional) Once all concurrent tasks get completed, a summary level post-processing stored procedure is called.\n  version: 1.0.0\n  title: MDX ETL\n  contact:\n    name: PyWebApi\n    url: 'https://github.com/DataBooster/PyWebApi'\n  license:\n    name: MIT\n    url: 'https://github.com/DataBooster/PyWebApi/blob/master/LICENSE'\n\nexternalDocs:\n  url: 'https://github.com/DataBooster/PyWebApi#mdx-etl'\n  description: Wiki\n\ntags:\n  - name: Main\n\npaths:\n  /db_mdx_db.start:\n    post:\n      summary: Start a **db-\u003emdx-\u003edb** end-to-end MDX ETL process.\n      operationId: start\n      description: |-\n        Reads all parallel/series MDX task streams from a database stored procedure, generates the descriptive JSON about services grouping for them and runs the whole process. The output of the stored procedure can specify the next similar stored procedure to repeat the similar process, or specify a post-process stored procedure to do some summary processing to end the entire chain.\n\n        In essence, what the outputs of task_sp will drive which tasks will be performed by the MDX ETL and how they will be executed in the entire process:\n\n        * The resultset is used to specify what MDX queries and corresponding tasks need to be executed in parallel;\n        * A special named output parameter (OUT_POST_SP with OUT_POST_SP_ARGS) can be used to chain-invoke another similar process if needed;\n        * Any other output parameters will be pipelined to all subtasks and post-processing stored procedures as part of their input parameters if the names match.        \n      requestBody:\n        required: true\n        content:\n          application/json:\n            schema:\n              $ref: '#/components/schemas/start'\n        description: Payload\n      responses:\n        \"200\":\n          description: Return the final results\n          content:\n            application/json:\n              schema:\n                type: object\n        \"401\":\n          $ref: '#/components/responses/Unauthorized'\n        default:\n          $ref: '#/components/responses/ServerError'\n      tags:\n        - Main\n\ncomponents:\n\n  responses:\n    Unauthorized:\n      description: Unauthorized\n      content:\n        application/json:\n          schema:\n            $ref: '#/components/schemas/error-response'\n    ServerError:\n      description: Internal Server Error\n      content:\n        application/json:\n          schema:\n            $ref: '#/components/schemas/error-response'\n\n  schemas:\n    start:\n      type: object\n      required:\n        - task_sp_url\n        - sp_args\n        - mdx_conn_str\n      properties:\n        task_sp_url:\n          type: string\n          format: url\n          example: \"http://dbwebapi.dev.com/oradev/your_schema.mdx_etl_demo.get_mdx_tasks/json?NamingCase=None\"\n          description: A valid DbWebApi URL of the stored procedure, which lists all task flows for the MDX ETL process.\n        sp_args:\n          type: object\n          example: {\"inParam1\": \"2020-08-06\", \"inParam2\": \"test from fiddler\"}\n          description: A JSON dictionary to be passed to stored procedure as input parameters.\n        mdx_conn_str:\n          type: string\n          example: \"Provider=MSOLAP;Data Source=The_OLAP;Initial Catalog=The_Cube;Integrated Security=SSPI;Format=Tabular;Connect Timeout=3600;\"\n          description: The ADOMD connection string for every MDX task.\n        timeout:\n          type: number\n          default: 180\n          example: 180\n          description: Stop waiting for any response after a given number of seconds.\n        mdx_column:\n          type: string\n          default: MDX_QUERY\n          example: MDX_QUERY\n          description: The name of the column in the resultset, which is used to specify the MDX query to be run.\n        column_map_column:\n          type: string\n          default: COLUMN_MAPPING\n          example: COLUMN_MAPPING\n          description: The name of the column in the resultset, which is used to specify the name mapping for certain columns (other columns not specified in the mapping dictionary will be returned as is. If a column header is mapped to an empty name, the corresponding column will be filtered out from the return). This is especially useful when passing the entire result of MDX directly to a stored procedure in a database. It allows you to map MDX column names to input parameter names of the stored procedure.\n        callback_sp_column:\n          type: string\n          default: CALLBACK_SP\n          example: CALLBACK_SP\n          description: The name of the output parameter, which is used to specify another stored procedure name for the MDX query result data to be pipelined to.\n        callback_args_column:\n          type: string\n          default: CALLBACK_ARGS\n          example: CALLBACK_ARGS\n          description: The name of the output parameter, which is used to specify some additional arguments for the CALLBACK_SP.\n        db_type:\n          type: string\n          default: Oracle\n          example: oracle\n          enum:\n            - Oracle\n            - SqlServer\n        post_sp_outparam:\n          type: string\n          default: OUT_POST_SP\n          example: OUT_POST_SP\n          description: The name of the output parameter, which is used to specify the name of post-processing stored procedure.\n        post_sp_args_outparam:\n          type: string\n          default: OUT_POST_SP_ARGS\n          example: OUT_POST_SP_ARGS\n          description:  The name of the output parameter, which is used to specify arguments for the post-processing stored procedure.\n        notify_url:\n          type: string\n          format: url\n          example: http://...(optional)\n          description: Send a notification to somewhere when above process get completed or an error is encountered.\n        notify_args:\n          type: object\n          example: {}\n          description: |-\n            This is a JSON dictionary. In general, any items it carries will be passed to the notification service as input arguments. However, if we want to include detailed result data and/or error information in the notification, then what parameter name(s) does the notification service use to receive them? We make a convention to use two special keys in this dictionary to indicate these two particular parameter names:\n              \n            '[=]' key - the value of this special key indicates the parameter name through which the notification service will receive detailed result data. (this is optional) If not specified, detailed result data will not be sent to the notification service;\n              \n            '[!]' key - the value of this special key indicates the parameter name through which the notification service will receive detailed error information. (this is optional) If not specified, detailed error information will not be sent to the notification service; in this case, the notification itself cannot tell whether the process has completed successfully or encountered any errors, then the notification service may require some other channel to know whether the process succeeded or failed.\n\n    error-response:\n      type: object\n      required:\n        - ExceptionMessage\n      properties:\n        ExceptionMessage:\n          type: string\n        ExceptionType:\n          type: string\n        StackTrace:\n          type: string\n\nservers:\n  - description: (Please update the local-test base URL to your actual path)\n    url: http://localhost/PyWebApi/pys/test_app/samples/mdxetl\n",
			"canonicalURL": "/github.com/DataBooster/PyWebApi@d4afed2d6b05215302bfb316a61b36cf13fb74aa/-/blob/Sample/UserApps/MdxEtl/mdxetl.swagger.yaml",
			"externalURLs": [
				{
					"url": "https://github.com/DataBooster/PyWebApi/blob/d4afed2d6b05215302bfb316a61b36cf13fb74aa/Sample/UserApps/MdxEtl/mdxetl.swagger.yaml",
					"serviceKind": "GITHUB"
				}
			]
		}
	}
}