{
	"File": {
		"__typename": "FileMatch",
		"repository": {
			"name": "github.com/restful-ma/thresholds"
		},
		"file": {
			"name": "googleapis.com-qpxExpress-v1-swagger.yaml",
			"size": 0,
			"path": "benchmark-repository/openapi/googleapis.com-qpxExpress-v1-swagger.yaml",
			"byteSize": 32253,
			"content": "openapi: 3.0.0\ninfo:\n  contact:\n    name: Google\n    url: https://google.com\n  description: Finds the least expensive flights between an origin and a destination.\n  title: QPX Express\n  version: v1\n  x-apiClientRegistration:\n    url: https://console.developers.google.com\n  x-logo:\n    url: https://www.google.com/images/branding/googlelogo/2x/googlelogo_color_272x92dp.png\n  x-origin:\n    - converter:\n        url: https://github.com/lucybot/api-spec-converter\n        version: 2.6.0\n      format: google\n      url: https://www.googleapis.com/discovery/v1/apis/qpxExpress/v1/rest\n      version: v1\n  x-preferred: true\n  x-providerName: googleapis.com\n  x-serviceName: qpxExpress\nexternalDocs:\n  url: http://developers.google.com/qpx-express\ntags:\n  - name: trips\npaths:\n  /search:\n    parameters:\n      - $ref: \"#/components/parameters/alt\"\n      - $ref: \"#/components/parameters/fields\"\n      - $ref: \"#/components/parameters/key\"\n      - $ref: \"#/components/parameters/oauth_token\"\n      - $ref: \"#/components/parameters/prettyPrint\"\n      - $ref: \"#/components/parameters/quotaUser\"\n      - $ref: \"#/components/parameters/userIp\"\n    post:\n      description: Returns a list of flights.\n      operationId: qpxExpress.trips.search\n      requestBody:\n        content:\n          application/json:\n            schema:\n              $ref: \"#/components/schemas/TripsSearchRequest\"\n      responses:\n        \"200\":\n          description: Successful response\n          content:\n            \"*/*\":\n              schema:\n                $ref: \"#/components/schemas/TripsSearchResponse\"\n      tags:\n        - trips\nservers:\n  - url: https://www.googleapis.com/qpxExpress/v1/trips\ncomponents:\n  parameters:\n    alt:\n      description: Data format for the response.\n      in: query\n      name: alt\n      schema:\n        type: string\n        enum:\n          - json\n        default: json\n    fields:\n      description: Selector specifying which fields to include in a partial response.\n      in: query\n      name: fields\n      schema:\n        type: string\n    key:\n      description: API key. Your API key identifies your project and provides you with API\n        access, quota, and reports. Required unless you provide an OAuth 2.0\n        token.\n      in: query\n      name: key\n      schema:\n        type: string\n    oauth_token:\n      description: OAuth 2.0 token for the current user.\n      in: query\n      name: oauth_token\n      schema:\n        type: string\n    prettyPrint:\n      description: Returns response with indentations and line breaks.\n      in: query\n      name: prettyPrint\n      schema:\n        type: boolean\n        default: true\n    quotaUser:\n      description: Available to use for quota purposes for server-side applications. Can be\n        any arbitrary string assigned to a user, but should not exceed 40\n        characters. Overrides userIp if both are provided.\n      in: query\n      name: quotaUser\n      schema:\n        type: string\n    userIp:\n      description: IP address of the site where the request originates. Use this if you\n        want to enforce per-user limits.\n      in: query\n      name: userIp\n      schema:\n        type: string\n  schemas:\n    AircraftData:\n      description: The make, model, and type of an aircraft.\n      properties:\n        code:\n          description: The aircraft code. For example, for a Boeing 777 the code would be\n            777.\n          type: string\n        kind:\n          default: qpxexpress#aircraftData\n          description: \"Identifies this as an aircraftData object. Value: the fixed string\n            qpxexpress#aircraftData\"\n          type: string\n        name:\n          description: The name of an aircraft, for example Boeing 777.\n          type: string\n      type: object\n    AirportData:\n      description: An airport.\n      properties:\n        city:\n          description: The city code an airport is located in. For example, for JFK\n            airport, this is NYC.\n          type: string\n        code:\n          description: An airport's code. For example, for Boston Logan airport, this is\n            BOS.\n          type: string\n        kind:\n          default: qpxexpress#airportData\n          description: \"Identifies this as an airport object. Value: the fixed string\n            qpxexpress#airportData.\"\n          type: string\n        name:\n          description: The name of an airport. For example, for airport BOS the name is\n            \"Boston Logan International\".\n          type: string\n      type: object\n    BagDescriptor:\n      description: Information about an item of baggage.\n      properties:\n        commercialName:\n          description: Provides the commercial name for an optional service.\n          type: string\n        count:\n          description: How many of this type of bag will be checked on this flight.\n          format: int32\n          type: integer\n        description:\n          description: A description of the baggage.\n          items:\n            type: string\n          type: array\n        kind:\n          default: qpxexpress#bagDescriptor\n          description: \"Identifies this as a baggage object. Value: the fixed string\n            qpxexpress#bagDescriptor.\"\n          type: string\n        subcode:\n          description: The standard IATA subcode used to identify this optional service.\n          type: string\n      type: object\n    CarrierData:\n      description: Information about a carrier (ie. an airline, bus line, railroad, etc)\n        that might be useful to display to an end-user.\n      properties:\n        code:\n          description: The IATA designator of a carrier (airline, etc). For example, for\n            American Airlines, the code is AA.\n          type: string\n        kind:\n          default: qpxexpress#carrierData\n          description: \"Identifies this as a kind of carrier (ie. an airline, bus line,\n            railroad, etc). Value: the fixed string qpxexpress#carrierData.\"\n          type: string\n        name:\n          description: \"The long, full name of a carrier. For example: American Airlines.\"\n          type: string\n      type: object\n    CityData:\n      description: Information about a city that might be useful to an end-user; typically\n        the city of an airport.\n      properties:\n        code:\n          description: The IATA character ID of a city. For example, for Boston this is BOS.\n          type: string\n        country:\n          description: The two-character country code of the country the city is located\n            in. For example, US for the United States of America.\n          type: string\n        kind:\n          default: qpxexpress#cityData\n          description: \"Identifies this as a city, typically with one or more airports.\n            Value: the fixed string qpxexpress#cityData.\"\n          type: string\n        name:\n          description: \"The full name of a city. An example would be: New York.\"\n          type: string\n      type: object\n    Data:\n      description: Detailed information about components found in the solutions of this\n        response, including a trip's airport, city, taxes, airline, and\n        aircraft.\n      properties:\n        aircraft:\n          description: The aircraft that is flying between an origin and destination.\n          items:\n            $ref: \"#/components/schemas/AircraftData\"\n          type: array\n        airport:\n          description: The airport of an origin or destination.\n          items:\n            $ref: \"#/components/schemas/AirportData\"\n          type: array\n        carrier:\n          description: The airline carrier of the aircraft flying between an origin and\n            destination. Allowed values are IATA carrier codes.\n          items:\n            $ref: \"#/components/schemas/CarrierData\"\n          type: array\n        city:\n          description: The city that is either the origin or destination of part of a trip.\n          items:\n            $ref: \"#/components/schemas/CityData\"\n          type: array\n        kind:\n          default: qpxexpress#data\n          description: \"Identifies this as QPX Express response resource, including a\n            trip's airport, city, taxes, airline, and aircraft. Value: the fixed\n            string qpxexpress#data.\"\n          type: string\n        tax:\n          description: The taxes due for flying between an origin and a destination.\n          items:\n            $ref: \"#/components/schemas/TaxData\"\n          type: array\n      type: object\n    FareInfo:\n      description: Complete information about a fare used in the solution to a low-fare\n        search query. In the airline industry a fare is a price an airline\n        charges for one-way travel between two points. A fare typically contains\n        a carrier code, two city codes, a price, and a fare basis. (A fare basis\n        is a one-to-eight character alphanumeric code used to identify a fare.)\n      properties:\n        basisCode:\n          type: string\n        carrier:\n          description: The carrier of the aircraft or other vehicle commuting between two\n            points.\n          type: string\n        destination:\n          description: The city code of the city the trip ends at.\n          type: string\n        id:\n          description: A unique identifier of the fare.\n          type: string\n        kind:\n          default: qpxexpress#fareInfo\n          description: \"Identifies this as a fare object. Value: the fixed string\n            qpxexpress#fareInfo.\"\n          type: string\n        origin:\n          description: The city code of the city the trip begins at.\n          type: string\n        private:\n          description: Whether this is a private fare, for example one offered only to\n            select customers rather than the general public.\n          type: boolean\n      type: object\n    FlightInfo:\n      description: A flight is a sequence of legs with the same airline carrier and flight\n        number. (A leg is the smallest unit of travel, in the case of a flight a\n        takeoff immediately followed by a landing at two set points on a\n        particular carrier with a particular flight number.) The naive view is\n        that a flight is scheduled travel of an aircraft between two points,\n        with possibly intermediate stops, but carriers will frequently list\n        flights that require a change of aircraft between legs.\n      properties:\n        carrier:\n          type: string\n        number:\n          description: The flight number.\n          type: string\n      type: object\n    FreeBaggageAllowance:\n      description: Information about free baggage allowed on one segment of a trip.\n      properties:\n        bagDescriptor:\n          description: A representation of a type of bag, such as an ATPCo subcode,\n            Commercial Name, or other description.\n          items:\n            $ref: \"#/components/schemas/BagDescriptor\"\n          type: array\n        kilos:\n          description: The maximum number of kilos all the free baggage together may weigh.\n          format: int32\n          type: integer\n        kilosPerPiece:\n          description: The maximum number of kilos any one piece of baggage may weigh.\n          format: int32\n          type: integer\n        kind:\n          default: qpxexpress#freeBaggageAllowance\n          description: \"Identifies this as free baggage object, allowed on one segment of a\n            trip. Value: the fixed string qpxexpress#freeBaggageAllowance.\"\n          type: string\n        pieces:\n          description: The number of free pieces of baggage allowed.\n          format: int32\n          type: integer\n        pounds:\n          description: The number of pounds of free baggage allowed.\n          format: int32\n          type: integer\n      type: object\n    LegInfo:\n      description: Information about a leg. (A leg is the smallest unit of travel, in the\n        case of a flight a takeoff immediately followed by a landing at two set\n        points on a particular carrier with a particular flight number.)\n      properties:\n        aircraft:\n          description: The aircraft (or bus, ferry, railcar, etc) travelling between the\n            two points of this leg.\n          type: string\n        arrivalTime:\n          description: The scheduled time of arrival at the destination of the leg, local\n            to the point of arrival.\n          type: string\n        changePlane:\n          description: Whether you have to change planes following this leg. Only applies\n            to the next leg.\n          type: boolean\n        connectionDuration:\n          description: Duration of a connection following this leg, in minutes.\n          format: int32\n          type: integer\n        departureTime:\n          description: The scheduled departure time of the leg, local to the point of\n            departure.\n          type: string\n        destination:\n          description: The leg destination as a city and airport.\n          type: string\n        destinationTerminal:\n          description: The terminal the flight is scheduled to arrive at.\n          type: string\n        duration:\n          description: The scheduled travelling time from the origin to the destination.\n          format: int32\n          type: integer\n        id:\n          description: An identifier that uniquely identifies this leg in the solution.\n          type: string\n        kind:\n          default: qpxexpress#legInfo\n          description: \"Identifies this as a leg object. A leg is the smallest unit of\n            travel, in the case of a flight a takeoff immediately followed by a\n            landing at two set points on a particular carrier with a particular\n            flight number. Value: the fixed string qpxexpress#legInfo.\"\n          type: string\n        meal:\n          description: 'A simple, general description of the meal(s) served on the flight,\n            for example: \"Hot meal\".'\n          type: string\n        mileage:\n          description: The number of miles in this leg.\n          format: int32\n          type: integer\n        onTimePerformance:\n          description: In percent, the published on time performance on this leg.\n          format: int32\n          type: integer\n        operatingDisclosure:\n          description: Department of Transportation disclosure information on the actual\n            operator of a flight in a code share. (A code share refers to a\n            marketing agreement between two carriers, where one carrier will\n            list in its schedules (and take bookings for) flights that are\n            actually operated by another carrier.)\n          type: string\n        origin:\n          description: The leg origin as a city and airport.\n          type: string\n        originTerminal:\n          description: The terminal the flight is scheduled to depart from.\n          type: string\n        secure:\n          description: Whether passenger information must be furnished to the United States\n            Transportation Security Administration (TSA) prior to departure.\n          type: boolean\n      type: object\n    PassengerCounts:\n      description: The number and type of passengers. Unfortunately the definition of an\n        infant, child, adult, and senior citizen varies across carriers and\n        reservation systems.\n      properties:\n        adultCount:\n          description: The number of passengers that are adults.\n          format: int32\n          type: integer\n        childCount:\n          description: The number of passengers that are children.\n          format: int32\n          type: integer\n        infantInLapCount:\n          description: The number of passengers that are infants travelling in the lap of\n            an adult.\n          format: int32\n          type: integer\n        infantInSeatCount:\n          description: The number of passengers that are infants each assigned a seat.\n          format: int32\n          type: integer\n        kind:\n          default: qpxexpress#passengerCounts\n          description: \"Identifies this as a passenger count object, representing the\n            number of passengers. Value: the fixed string\n            qpxexpress#passengerCounts.\"\n          type: string\n        seniorCount:\n          description: The number of passengers that are senior citizens.\n          format: int32\n          type: integer\n      type: object\n    PricingInfo:\n      description: The price of one or more travel segments. The currency used to purchase\n        tickets is usually determined by the sale/ticketing city or the\n        sale/ticketing country, unless none are specified, in which case it\n        defaults to that of the journey origin country.\n      properties:\n        baseFareTotal:\n          description: The total fare in the base fare currency (the currency of the\n            country of origin). This element is only present when the sales\n            currency and the currency of the country of commencement are\n            different.\n          type: string\n        fare:\n          description: The fare used to price one or more segments.\n          items:\n            $ref: \"#/components/schemas/FareInfo\"\n          type: array\n        fareCalculation:\n          description: The horizontal fare calculation. This is a field on a ticket that\n            displays all of the relevant items that go into the calculation of\n            the fare.\n          type: string\n        kind:\n          default: qpxexpress#pricingInfo\n          description: \"Identifies this as a pricing object, representing the price of one\n            or more travel segments. Value: the fixed string\n            qpxexpress#pricingInfo.\"\n          type: string\n        latestTicketingTime:\n          description: The latest ticketing time for this pricing assuming the reservation\n            occurs at ticketing time and there is no change in fares/rules. The\n            time is local to the point of sale (POS).\n          type: string\n        passengers:\n          $ref: \"#/components/schemas/PassengerCounts\"\n        ptc:\n          description: The passenger type code for this pricing. An alphanumeric code used\n            by a carrier to restrict fares to certain categories of passenger.\n            For instance, a fare might be valid only for senior citizens.\n          type: string\n        refundable:\n          description: Whether the fares on this pricing are refundable.\n          type: boolean\n        saleFareTotal:\n          description: The total fare in the sale or equivalent currency.\n          type: string\n        saleTaxTotal:\n          description: The taxes in the sale or equivalent currency.\n          type: string\n        saleTotal:\n          description: Total per-passenger price (fare and tax) in the sale or equivalent\n            currency.\n          type: string\n        segmentPricing:\n          description: The per-segment price and baggage information.\n          items:\n            $ref: \"#/components/schemas/SegmentPricing\"\n          type: array\n        tax:\n          description: The taxes used to calculate the tax total per ticket.\n          items:\n            $ref: \"#/components/schemas/TaxInfo\"\n          type: array\n      type: object\n    SegmentInfo:\n      description: \"Details of a segment of a flight; a segment is one or more consecutive\n        legs on the same flight. For example a hypothetical flight ZZ001, from\n        DFW to OGG, would have one segment with two legs: DFW to HNL (leg 1),\n        HNL to OGG (leg 2), and DFW to OGG (legs 1 and 2).\"\n      properties:\n        bookingCode:\n          description: The booking code or class for this segment.\n          type: string\n        bookingCodeCount:\n          description: The number of seats available in this booking code on this segment.\n          format: int32\n          type: integer\n        cabin:\n          description: The cabin booked for this segment.\n          type: string\n        connectionDuration:\n          description: In minutes, the duration of the connection following this segment.\n          format: int32\n          type: integer\n        duration:\n          description: The duration of the flight segment in minutes.\n          format: int32\n          type: integer\n        flight:\n          $ref: \"#/components/schemas/FlightInfo\"\n        id:\n          description: An id uniquely identifying the segment in the solution.\n          type: string\n        kind:\n          default: qpxexpress#segmentInfo\n          description: \"Identifies this as a segment object. A segment is one or more\n            consecutive legs on the same flight. For example a hypothetical\n            flight ZZ001, from DFW to OGG, could have one segment with two legs:\n            DFW to HNL (leg 1), HNL to OGG (leg 2). Value: the fixed string\n            qpxexpress#segmentInfo.\"\n          type: string\n        leg:\n          description: The legs composing this segment.\n          items:\n            $ref: \"#/components/schemas/LegInfo\"\n          type: array\n        marriedSegmentGroup:\n          description: The solution-based index of a segment in a married segment group.\n            Married segments can only be booked together. For example, an\n            airline might report a certain booking code as sold out from Boston\n            to Pittsburgh, but as available as part of two married segments\n            Boston to Chicago connecting through Pittsburgh. For example content\n            of this field, consider the round-trip flight ZZ1 PHX-PHL ZZ2\n            PHL-CLT ZZ3 CLT-PHX. This has three segments, with the two outbound\n            ones (ZZ1 ZZ2) married. In this case, the two outbound segments\n            belong to married segment group 0, and the return segment belongs to\n            married segment group 1.\n          type: string\n        subjectToGovernmentApproval:\n          description: Whether the operation of this segment remains subject to government\n            approval.\n          type: boolean\n      type: object\n    SegmentPricing:\n      description: The price of this segment.\n      properties:\n        fareId:\n          description: A segment identifier unique within a single solution. It is used to\n            refer to different parts of the same solution.\n          type: string\n        freeBaggageOption:\n          description: Details of the free baggage allowance on this segment.\n          items:\n            $ref: \"#/components/schemas/FreeBaggageAllowance\"\n          type: array\n        kind:\n          default: qpxexpress#segmentPricing\n          description: \"Identifies this as a segment pricing object, representing the price\n            of this segment. Value: the fixed string qpxexpress#segmentPricing.\"\n          type: string\n        segmentId:\n          description: Unique identifier in the response of this segment.\n          type: string\n      type: object\n    SliceInfo:\n      description: \u003e-\n        Information about a slice. A slice represents a traveller's intent, the\n        portion of a low-fare search corresponding to a traveler's request to\n        get between two points. One-way journeys are generally expressed using 1\n        slice, round-trips using 2. For example, if a traveler specifies the\n        following trip in a user interface:\n\n        | Origin | Destination | Departure Date | | BOS | LAX | March 10, 2007 | | LAX | SYD | March 17, 2007 | | SYD | BOS | March 22, 2007 |\n\n        then this is a three slice trip.\n      properties:\n        duration:\n          description: The duration of the slice in minutes.\n          format: int32\n          type: integer\n        kind:\n          default: qpxexpress#sliceInfo\n          description: \"Identifies this as a slice object. A slice represents a traveller's\n            intent, the portion of a low-fare search corresponding to a\n            traveler's request to get between two points. One-way journeys are\n            generally expressed using 1 slice, round-trips using 2. Value: the\n            fixed string qpxexpress#sliceInfo.\"\n          type: string\n        segment:\n          description: The segment(s) constituting the slice.\n          items:\n            $ref: \"#/components/schemas/SegmentInfo\"\n          type: array\n      type: object\n    SliceInput:\n      description: Criteria a desired slice must satisfy.\n      properties:\n        alliance:\n          description: Slices with only the carriers in this alliance should be returned;\n            do not use this field with permittedCarrier. Allowed values are\n            ONEWORLD, SKYTEAM, and STAR.\n          type: string\n        date:\n          description: Departure date in YYYY-MM-DD format.\n          type: string\n        destination:\n          description: Airport or city IATA designator of the destination.\n          type: string\n        kind:\n          default: qpxexpress#sliceInput\n          description: \"Identifies this as a slice input object, representing the criteria\n            a desired slice must satisfy. Value: the fixed string\n            qpxexpress#sliceInput.\"\n          type: string\n        maxConnectionDuration:\n          description: The longest connection between two legs, in minutes, you are willing\n            to accept.\n          format: int32\n          type: integer\n        maxStops:\n          description: The maximum number of stops you are willing to accept in this slice.\n          format: int32\n          type: integer\n        origin:\n          description: Airport or city IATA designator of the origin.\n          type: string\n        permittedCarrier:\n          description: A list of 2-letter IATA airline designators. Slices with only these\n            carriers should be returned.\n          items:\n            type: string\n          type: array\n        permittedDepartureTime:\n          $ref: \"#/components/schemas/TimeOfDayRange\"\n        preferredCabin:\n          description: Prefer solutions that book in this cabin for this slice. Allowed\n            values are COACH, PREMIUM_COACH, BUSINESS, and FIRST.\n          type: string\n        prohibitedCarrier:\n          description: A list of 2-letter IATA airline designators. Exclude slices that use\n            these carriers.\n          items:\n            type: string\n          type: array\n      type: object\n    TaxData:\n      description: Tax data.\n      properties:\n        id:\n          description: An identifier uniquely identifying a tax in a response.\n          type: string\n        kind:\n          default: qpxexpress#taxData\n          description: \"Identifies this as a tax data object, representing some tax. Value:\n            the fixed string qpxexpress#taxData.\"\n          type: string\n        name:\n          description: The name of a tax.\n          type: string\n      type: object\n    TaxInfo:\n      description: Tax information.\n      properties:\n        chargeType:\n          description: Whether this is a government charge or a carrier surcharge.\n          type: string\n        code:\n          description: The code to enter in the ticket's tax box.\n          type: string\n        country:\n          description: For government charges, the country levying the charge.\n          type: string\n        id:\n          description: Identifier uniquely identifying this tax in a response. Not present\n            for unnamed carrier surcharges.\n          type: string\n        kind:\n          default: qpxexpress#taxInfo\n          description: \"Identifies this as a tax information object. Value: the fixed\n            string qpxexpress#taxInfo.\"\n          type: string\n        salePrice:\n          description: The price of the tax in the sales or equivalent currency.\n          type: string\n      type: object\n    TimeOfDayRange:\n      description: Two times in a single day defining a time range.\n      properties:\n        earliestTime:\n          description: The earliest time of day in HH:MM format.\n          type: string\n        kind:\n          default: qpxexpress#timeOfDayRange\n          description: \"Identifies this as a time of day range object, representing two\n            times in a single day defining a time range. Value: the fixed string\n            qpxexpress#timeOfDayRange.\"\n          type: string\n        latestTime:\n          description: The latest time of day in HH:MM format.\n          type: string\n      type: object\n    TripOption:\n      description: Trip information.\n      properties:\n        id:\n          description: Identifier uniquely identifying this trip in a response.\n          type: string\n        kind:\n          default: qpxexpress#tripOption\n          description: \"Identifies this as a trip information object. Value: the fixed\n            string qpxexpress#tripOption.\"\n          type: string\n        pricing:\n          description: Per passenger pricing information.\n          items:\n            $ref: \"#/components/schemas/PricingInfo\"\n          type: array\n        saleTotal:\n          description: The total price for all passengers on the trip, in the form of a\n            currency followed by an amount, e.g. USD253.35.\n          type: string\n        slice:\n          description: The slices that make up this trip's itinerary.\n          items:\n            $ref: \"#/components/schemas/SliceInfo\"\n          type: array\n      type: object\n    TripOptionsRequest:\n      description: A QPX Express search request, which will yield one or more solutions.\n      properties:\n        maxPrice:\n          description: \"Do not return solutions that cost more than this price. The\n            alphabetical part of the price is in ISO 4217. The format, in regex,\n            is [A-Z]{3}\\\\d+(\\\\.\\\\d+)? Example: $102.07\"\n          type: string\n        passengers:\n          $ref: \"#/components/schemas/PassengerCounts\"\n        refundable:\n          description: Return only solutions with refundable fares.\n          type: boolean\n        saleCountry:\n          description: IATA country code representing the point of sale. This determines\n            the \"equivalent amount paid\" currency for the ticket.\n          type: string\n        slice:\n          description: The slices that make up the itinerary of this trip. A slice\n            represents a traveler's intent, the portion of a low-fare search\n            corresponding to a traveler's request to get between two points.\n            One-way journeys are generally expressed using one slice,\n            round-trips using two. An example of a one slice trip with three\n            segments might be BOS-SYD, SYD-LAX, LAX-BOS if the traveler only\n            stopped in SYD and LAX just long enough to change planes.\n          items:\n            $ref: \"#/components/schemas/SliceInput\"\n          type: array\n        solutions:\n          description: The number of solutions to return, maximum 500.\n          format: int32\n          type: integer\n        ticketingCountry:\n          description: IATA country code representing the point of ticketing.\n          type: string\n      type: object\n    TripOptionsResponse:\n      description: A QPX Express search response.\n      properties:\n        data:\n          $ref: \"#/components/schemas/Data\"\n        kind:\n          default: qpxexpress#tripOptions\n          description: \"Identifies this as a QPX Express trip response object, which\n            consists of zero or more solutions. Value: the fixed string\n            qpxexpress#tripOptions.\"\n          type: string\n        requestId:\n          description: An identifier uniquely identifying this response.\n          type: string\n        tripOption:\n          description: A list of priced itinerary solutions to the QPX Express query.\n          items:\n            $ref: \"#/components/schemas/TripOption\"\n          type: array\n      type: object\n    TripsSearchRequest:\n      description: A QPX Express search request.\n      properties:\n        request:\n          $ref: \"#/components/schemas/TripOptionsRequest\"\n      type: object\n    TripsSearchResponse:\n      description: A QPX Express search response.\n      properties:\n        kind:\n          default: qpxExpress#tripsSearch\n          description: \"Identifies this as a QPX Express API search response resource.\n            Value: the fixed string qpxExpress#tripsSearch.\"\n          type: string\n        trips:\n          $ref: \"#/components/schemas/TripOptionsResponse\"\n      type: object\n",
			"canonicalURL": "/github.com/restful-ma/thresholds@5b0b2a3322d3b2b7c0e0f2c0c0ad0e524e67bf82/-/blob/benchmark-repository/openapi/googleapis.com-qpxExpress-v1-swagger.yaml",
			"externalURLs": [
				{
					"url": "https://github.com/restful-ma/thresholds/blob/5b0b2a3322d3b2b7c0e0f2c0c0ad0e524e67bf82/benchmark-repository/openapi/googleapis.com-qpxExpress-v1-swagger.yaml",
					"serviceKind": "GITHUB"
				}
			]
		}
	},
	"Error": "notImplemented: path \"/search\": post: responses: 200: contents: unsupported content types: [*/*]",
	"NotImplemented": [
		"unsupported content types"
	]
}