{
	"File": {
		"__typename": "FileMatch",
		"repository": {
			"name": "github.com/hendt/ebay-api"
		},
		"file": {
			"name": "buy_marketplace_insights_v1_beta_oas3.json",
			"size": 0,
			"path": "test/api/restful/buy/marketplaceInsights/buy_marketplace_insights_v1_beta_oas3.json",
			"byteSize": 42629,
			"content": "{\n  \"openapi\": \"3.0.0\",\n  \"info\": {\n    \"title\": \"Marketplace Insights API\",\n    \"description\": \"\u003ca href=\\\"https://developer.ebay.com/api-docs/static/versioning.html#Limited\\\" target=\\\"_blank\\\"\u003e \u003cimg src=\\\"/cms/img/docs/partners-api.svg\\\" class=\\\"legend-icon partners-icon\\\" title=\\\"Limited Release\\\"  alt=\\\"Limited Release\\\" /\u003e(Limited Release)\u003c/a\u003e The Marketplace Insights API provides the ability to search for sold items on eBay by keyword, GTIN, category, and product and returns the of sales history of those items.\",\n    \"contact\": {\n      \"name\": \"eBay Inc,\"\n    },\n    \"license\": {\n      \"name\": \"eBay API License Agreement\",\n      \"url\": \"https://go.developer.ebay.com/api-license-agreement\"\n    },\n    \"version\": \"v1_beta.2.2\"\n  },\n  \"servers\": [\n    {\n      \"url\": \"https://api.ebay.com{basePath}\",\n      \"description\": \"Production\",\n      \"variables\": {\n        \"basePath\": {\n          \"default\": \"/buy/marketplace_insights/v1_beta\"\n        }\n      }\n    }\n  ],\n  \"paths\": {\n    \"/item_sales/search\": {\n      \"get\": {\n        \"tags\": [\n          \"item_sales\"\n        ],\n        \"description\": \"(Limited Release) This method searches for sold eBay items by various URI query parameters and retrieves the sales history of the items for the last 90 days. You can search by keyword, category, eBay product ID (ePID), or GTIN, or a combination of these. This method also supports the following: Filtering by the value of one or multiple fields, such as listing format, item condition, price range, location, and more. For the fields supported by this method, see the filter parameter. Retrieving the refinements (metadata) of an item , such as item aspects (color, brand), condition, category, etc. using the fieldgroups parameter. Filtering by item aspects and other refinements using the aspect_filter parameter. Creating aspects histograms, which enables shoppers to drill down in each refinement narrowing the search results. For details and examples of these capabilities, see Browse API in the Buying Integration Guide. Pagination and sort controls There are pagination controls (limit and offset fields) and sort query parameters that control/sort the data that is returned. By default, the results are sorted by \u0026quot;Best Match\u0026quot;. For more information about Best Match, see the eBay help page Best Match. URLs for this method Production URL: https://api.ebay.com/buy/marketplace_insights/v1_beta/item_sales/ Sandbox URL: https://api.sandbox.ebay.com/buy/marketplace_insights/v1_beta/item_sales/ Request headers You will want to use the X-EBAY-C-ENDUSERCTX request header with this method. If you are an eBay Network Partner you must use affiliateCampaignId=ePNCampaignId,affiliateReferenceId=referenceId in the header in order to be paid for selling eBay items on your site . For details see, Request headers in the Buy APIs Overview. URL Encoding for Parameters Query parameter values need to be URL encoded. For details, see URL encoding query parameter values. Restrictions For a list of supported sites and other restrictions, see API Restrictions.\",\n        \"operationId\": \"search\",\n        \"parameters\": [\n          {\n            \"name\": \"aspect_filter\",\n            \"in\": \"query\",\n            \"description\": \"This field lets you filter by item aspects. The aspect name/value pairs and category, which is required, is used to limit the results to specific aspects of the item. For example, in a clothing category one aspect pair would be Color/Red. The results are returned in the refinement container. For example, the method below uses the category ID for Women's Clothing. This will return only sold items for a woman's red or blue shirt. /buy/marketplace_insights/v1_beta/item_sales/search?q=shirt\u0026amp;category_ids=15724\u0026amp;aspect_filter=categoryId:15724,Color:{Red|Blue} To get a list of the aspects pairs and the category, which is returned in the dominantCategoryId field, set fieldgroups to ASPECT_REFINEMENTS. /buy/marketplace_insights/v1_beta/item_sales/search?q=shirt\u0026amp;category_ids=15724\u0026amp;fieldgroups=ASPECT_REFINEMENTS Format: aspectName:{value1|value2} Required: The category ID is required twice; once as a URI parameter and as part of the aspect_filter parameter. For implementation help, refer to eBay API documentation at https://developer.ebay.com/api-docs/buy/marketplace_insights/types/gct:AspectFilter\",\n            \"required\": false,\n            \"schema\": {\n              \"type\": \"string\"\n            }\n          },\n          {\n            \"name\": \"category_ids\",\n            \"in\": \"query\",\n            \"description\": \"The category ID is required and is used to limit the results. For example, if you search for 'shirt' the result set will be very large. But if you also include the category ID 137084, the results will be limited to 'Men's Athletic Apparel'. For example: /buy/marketplace-insights/v1_beta/item_sales/search?q=shirt\u0026amp;category_ids=137084 The list of eBay category IDs is not published and category IDs are not the same across all the eBay marketplaces. You can use the following techniques to find a category by site: For the US marketplace, use the Category Changes page. Use the Taxonomy API. For details see Get Categories for Buy APIs. Usage: This field can have one category ID or a comma separated list of IDs. You can use category_ids by itself or use it with any combination of the gtin, epid, and q fields, which gives you additional control over the result set. Restrictions: Partners will be given a list of categories they can use. To use a top-level (L1) category, you must also include the q, or gtin, or epid query parameter. Maximum number of categories: 4\",\n            \"required\": false,\n            \"schema\": {\n              \"type\": \"string\"\n            }\n          },\n          {\n            \"name\": \"epid\",\n            \"in\": \"query\",\n            \"description\": \"The ePID is the eBay product identifier of a product from the eBay product catalog. This field limits the results to only items in the specified ePID. /buy/marketplace-insights/v1_beta/item_sales/search?epid=241986085\u0026amp;category_ids=168058 You can use the product_summary/search method in the Catalog API to search for the ePID of the product. Required: At least 1 category_ids Maximum: 1 epid Optional: Any combination of epid, gtin, or q\",\n            \"required\": false,\n            \"schema\": {\n              \"type\": \"string\"\n            }\n          },\n          {\n            \"name\": \"fieldgroups\",\n            \"in\": \"query\",\n            \"description\": \"This field lets you control what is to be returned in the response and accepts a comma separated list of values. The default is MATCHING_ITEMS, which returns the items that match the keyword or category specified. The other values return data that can be used to create histograms. For code examples see, aspect_filter. Valid Values: ASPECT_REFINEMENTS - This returns the aspectDistributions container, which has the dominantCategoryId, matchCount, and refinementHref for the various aspects of the items found. For example, if you searched for 'Mustang', some of the aspect would be Model Year, Exterior Color, Vehicle Mileage, etc. Note: ASPECT_REFINEMENTS are category specific. BUYING_OPTION_REFINEMENTS - This returns the buyingOptionDistributions container, which has the matchCount and refinementHref for AUCTION and FIXED_PRICE (Buy It Now) items. Note: Classified items are not supported. CATEGORY_REFINEMENTS - This returns the categoryDistributions container, which has the categories that the item is in. CONDITION_REFINEMENTS - This returns the conditionDistributions container, such as NEW, USED, etc. Within these groups are multiple states of the condition. For example, New can be New without tag, New in box, New without box, etc. MATCHING_ITEMS - This is meant to be used with one or more of the refinement values above. You use this to return the specified refinements and all the matching items. FULL - This returns all the refinement containers and all the matching items. Code so that your app gracefully handles any future changes to this list. Default: MATCHING_ITEMS\",\n            \"required\": false,\n            \"schema\": {\n              \"type\": \"string\"\n            }\n          },\n          {\n            \"name\": \"filter\",\n            \"in\": \"query\",\n            \"description\": \"This field supports multiple field filters that can be used to limit/customize the result set. The following lists the supported filters. For details and examples for all the filters, see Buy API Field Filters. buyingOptions conditionIds conditions itemLocationCountry lastSoldDate price priceCurrency The following example filters the result set by price. Note: To filter by price, price and priceCurrency must always be used together. /buy/marketplace-insights/v1_beta/item_sales/search?q=iphone\u0026amp;category_ids=15724\u0026amp;filter=price:[50..500],priceCurrency:USD For implementation help, refer to eBay API documentation at https://developer.ebay.com/api-docs/buy/marketplace_insights/types/cos:FilterField\",\n            \"required\": false,\n            \"schema\": {\n              \"type\": \"string\"\n            }\n          },\n          {\n            \"name\": \"gtin\",\n            \"in\": \"query\",\n            \"description\": \"This field lets you search by the Global Trade Item Number of the item as defined by https://www.gtin.info. This can be a UPC (Universal Product Code), EAN (European Article Number), or an ISBN (International Standard Book Number) value. /buy/marketplace-insights/v1_beta/item_sales/search?gtin=241986085\u0026amp;category_ids=9355 Required: At least 1 category_ids Maximum: 1 gtin Optional: Any combination of epid, gtin, or q\",\n            \"required\": false,\n            \"schema\": {\n              \"type\": \"string\"\n            }\n          },\n          {\n            \"name\": \"limit\",\n            \"in\": \"query\",\n            \"description\": \"The number of items, from the result set, returned in a single page. Default: 50 Maximum number of items per page (limit): 200 Maximum number of items in a result set: 10,000\",\n            \"required\": false,\n            \"schema\": {\n              \"type\": \"string\"\n            }\n          },\n          {\n            \"name\": \"offset\",\n            \"in\": \"query\",\n            \"description\": \"Specifies the number of items to skip in the result set. This is used with the limit field to control the pagination of the output. If offset is 0 and limit is 10, the method will retrieve items 1-10 from the list of items returned, if offset is 10 and limit is 10, the method will retrieve items 11 thru 20 from the list of items returned. Valid Values: 0-10,000 (inclusive) Default: 0 Maximum number of items returned: 10,000\",\n            \"required\": false,\n            \"schema\": {\n              \"type\": \"string\"\n            }\n          },\n          {\n            \"name\": \"q\",\n            \"in\": \"query\",\n            \"description\": \"A string consisting of one or more keywords that are used to search for items on eBay. The keywords are handled as follows: If the keywords are separated by a comma, it is treated as an AND. In the following example, the query returns items that have iphone AND ipad. /buy/marketplace-insights/v1_beta/item_sales/search?q=iphone,ipad\u0026amp;category_ids=15724 If the keywords are separated by a space, it is treated as an OR. In the following examples, the query returns items that have iphone OR ipad. /buy/marketplace-insights/v1_beta/item_sales/search?q=iphone\u0026amp;category_ids=15724\u0026nbsp;ipad /buy/marketplace-insights/v1_beta/item_sales/search?q=iphone,\u0026nbsp;ipad\u0026amp;category_ids=15724 Restriction: The * wildcard character is not allowed in this field. Required: At least 1 category_ids Optional: Any combination of epid, gtin, or q\",\n            \"required\": false,\n            \"schema\": {\n              \"type\": \"string\"\n            }\n          },\n          {\n            \"name\": \"sort\",\n            \"in\": \"query\",\n            \"description\": \"This field specifies the order and the field name to use to sort the items. To sort in descending order use - before the field name. Currently, you can only sort by price (in ascending or descending order). If no sort parameter is submitted, the result set is sorted by \u0026quot;Best Match\u0026quot;. The following are examples of using the sort query parameter. Sort Result \u0026amp;sort=price Sorts by price in ascending order (lowest price first) \u0026amp;sort=-price Sorts by price in descending order (highest price first) Default: ascending For implementation help, refer to eBay API documentation at https://developer.ebay.com/api-docs/buy/marketplace_insights/types/cos:SortField\",\n            \"required\": false,\n            \"schema\": {\n              \"type\": \"string\"\n            }\n          }\n        ],\n        \"responses\": {\n          \"200\": {\n            \"description\": \"Success\",\n            \"content\": {\n              \"application/json\": {\n                \"schema\": {\n                  \"$ref\": \"#/components/schemas/SalesHistoryPagedCollection\"\n                }\n              }\n            }\n          },\n          \"400\": {\n            \"description\": \"Bad Request\",\n            \"x-response-codes\": {\n              \"errors\": {\n                \"100001\": {\n                  \"domain\": \"API_MARKETPLACE_INSIGHTS\",\n                  \"category\": \"REQUEST\",\n                  \"description\": \"The call must have a valid 'q', 'category_ids', 'epid' or 'gtin' query parameter.\"\n                },\n                \"100002\": {\n                  \"domain\": \"API_MARKETPLACE_INSIGHTS\",\n                  \"category\": \"REQUEST\",\n                  \"description\": \"The 'offset' value is invalid. Offset cannot be negative and must be an integer.\"\n                },\n                \"100003\": {\n                  \"domain\": \"API_MARKETPLACE_INSIGHTS\",\n                  \"category\": \"REQUEST\",\n                  \"description\": \"The 'limit' value should be between 1 and 200 (inclusive).\"\n                },\n                \"100006\": {\n                  \"domain\": \"API_MARKETPLACE_INSIGHTS\",\n                  \"category\": \"REQUEST\",\n                  \"description\": \"The 'sort' value is invalid. For the valid values, refer to the API call documentation.\"\n                },\n                \"100007\": {\n                  \"domain\": \"API_MARKETPLACE_INSIGHTS\",\n                  \"category\": \"REQUEST\",\n                  \"description\": \"A valid 'price' filter and a valid 'priceCurrency' filter is required to filter based on price.\"\n                },\n                \"100008\": {\n                  \"domain\": \"API_MARKETPLACE_INSIGHTS\",\n                  \"category\": \"REQUEST\",\n                  \"description\": \"The 'epid' value {epid} is invalid. For more information, see the API call reference documentation.\"\n                },\n                \"100009\": {\n                  \"domain\": \"API_MARKETPLACE_INSIGHTS\",\n                  \"category\": \"REQUEST\",\n                  \"description\": \"The 'gtin' value {gtin} is invalid. Please input a valid UPC, EAN, or ISBN value.\"\n                },\n                \"100010\": {\n                  \"domain\": \"API_MARKETPLACE_INSIGHTS\",\n                  \"category\": \"REQUEST\",\n                  \"description\": \"This keyword search results in a response that is too large to return. Either change the keyword or add additional query parameters and/or filters.\"\n                },\n                \"100011\": {\n                  \"domain\": \"API_MARKETPLACE_INSIGHTS\",\n                  \"category\": \"REQUEST\",\n                  \"description\": \"The {filterName} value is invalid. For the valid values, refer to the API call documentation.\"\n                },\n                \"100012\": {\n                  \"domain\": \"API_MARKETPLACE_INSIGHTS\",\n                  \"category\": \"REQUEST\",\n                  \"description\": \"The 'fieldgroups' value {fieldgroups} is invalid. The supported fieldgroups are: {supportedFieldgroups}\"\n                },\n                \"100013\": {\n                  \"domain\": \"API_MARKETPLACE_INSIGHTS\",\n                  \"category\": \"REQUEST\",\n                  \"description\": \"The 'aspect_filter' query parameter must include a categoryId. For more information, see the API call reference documentation.\"\n                },\n                \"100014\": {\n                  \"domain\": \"API_MARKETPLACE_INSIGHTS\",\n                  \"category\": \"REQUEST\",\n                  \"description\": \"The {aspectFilter} aspect_filter value is invalid. For more information, see the API call reference documentation.\"\n                },\n                \"100017\": {\n                  \"domain\": \"API_MARKETPLACE_INSIGHTS\",\n                  \"category\": \"REQUEST\",\n                  \"description\": \"Insufficient permissions to use this API.\"\n                },\n                \"100018\": {\n                  \"domain\": \"API_MARKETPLACE_INSIGHTS\",\n                  \"category\": \"REQUEST\",\n                  \"description\": \"This query requires at least one category.\"\n                },\n                \"100019\": {\n                  \"domain\": \"API_MARKETPLACE_INSIGHTS\",\n                  \"category\": \"REQUEST\",\n                  \"description\": \"You have exceeded the maximum number of categories. The maximum number is {categorySizeLimit}.\"\n                },\n                \"100020\": {\n                  \"domain\": \"API_MARKETPLACE_INSIGHTS\",\n                  \"category\": \"REQUEST\",\n                  \"description\": \"The header 'X-EBAY-C-MARKETPLACE-ID' is required. The valid Marketplaces are: {allowedMarketplaces}.\"\n                },\n                \"100021\": {\n                  \"domain\": \"API_MARKETPLACE_INSIGHTS\",\n                  \"category\": \"REQUEST\",\n                  \"description\": \"The maximum number of listings that can be retrieved is 10,000, so your offset value must be less than 10,000. If 10,000 or more listings are matching your search criteria, consider narrowing the scope of your search.\"\n                }\n              }\n            }\n          },\n          \"409\": {\n            \"description\": \"Conflict\",\n            \"x-response-codes\": {\n              \"errors\": {\n                \"100004\": {\n                  \"domain\": \"API_MARKETPLACE_INSIGHTS\",\n                  \"category\": \"BUSINESS\",\n                  \"description\": \"The category specified is a top-level category. To use this category, you must include a keyword or epid or gtin.\"\n                },\n                \"100005\": {\n                  \"domain\": \"API_MARKETPLACE_INSIGHTS\",\n                  \"category\": \"BUSINESS\",\n                  \"description\": \"Currently, the {marketplaceId} marketplace is not supported. The supported Marketplaces are: {allowedMarketplaces} .\"\n                },\n                \"100015\": {\n                  \"domain\": \"API_MARKETPLACE_INSIGHTS\",\n                  \"category\": \"BUSINESS\",\n                  \"description\": \"The category {categoryId} is not supported.\"\n                },\n                \"100016\": {\n                  \"domain\": \"API_MARKETPLACE_INSIGHTS\",\n                  \"category\": \"BUSINESS\",\n                  \"description\": \"The 'fieldgroups' value {fieldgroups} is invalid when multiple 'category_ids' are specified. Either change the call to have only one value in 'category_ids' or remove the 'fieldgroups'.\"\n                }\n              }\n            }\n          },\n          \"500\": {\n            \"description\": \"Internal Server Error\",\n            \"x-response-codes\": {\n              \"errors\": {\n                \"100000\": {\n                  \"domain\": \"API_MARKETPLACE_INSIGHTS\",\n                  \"category\": \"APPLICATION\",\n                  \"description\": \"There was a problem with an eBay internal system or process. Contact eBay developer support for assistance.\"\n                }\n              }\n            }\n          }\n        },\n        \"security\": [\n          {\n            \"api_auth\": [\n              \"https://api.ebay.com/oauth/api_scope/buy.marketplace.insights\"\n            ]\n          }\n        ]\n      }\n    }\n  },\n  \"components\": {\n    \"schemas\": {\n      \"AspectDistribution\": {\n        \"type\": \"object\",\n        \"properties\": {\n          \"aspectValueDistributions\": {\n            \"type\": \"array\",\n            \"description\": \"An array of containers for the various values of the aspect and the match count and a HATEOAS reference ( refinementHref) for this aspect.\",\n            \"items\": {\n              \"$ref\": \"#/components/schemas/AspectValueDistribution\"\n            }\n          },\n          \"localizedAspectName\": {\n            \"type\": \"string\",\n            \"description\": \"Name of an aspect, such as Brand, Color, etc.\"\n          }\n        },\n        \"description\": \"The type that define the fields for the aspect information. Aspects are the variations of an item, such as color, size, etc.\"\n      },\n      \"AspectValueDistribution\": {\n        \"type\": \"object\",\n        \"properties\": {\n          \"localizedAspectValue\": {\n            \"type\": \"string\",\n            \"description\": \"The value of an aspect. For example, Red is a value for the aspect Color.\"\n          },\n          \"matchCount\": {\n            \"type\": \"integer\",\n            \"description\": \"The number of items with this aspect.\",\n            \"format\": \"int32\"\n          },\n          \"refinementHref\": {\n            \"type\": \"string\",\n            \"description\": \"A HATEOAS reference for this aspect.\"\n          }\n        },\n        \"description\": \"The container that defines the fields for the conditions refinements. This container is returned when fieldgroups is set to ASPECT_REFINEMENTS or FULL in the request.\"\n      },\n      \"BuyingOptionDistribution\": {\n        \"type\": \"object\",\n        \"properties\": {\n          \"buyingOption\": {\n            \"type\": \"string\"\n          },\n          \"matchCount\": {\n            \"type\": \"integer\",\n            \"description\": \"The number of items having this buying option.\",\n            \"format\": \"int32\"\n          },\n          \"refinementHref\": {\n            \"type\": \"string\",\n            \"description\": \"The HATEOAS reference for this buying option.\"\n          }\n        },\n        \"description\": \"The container that defines the fields for the buying options refinements. This container is returned when fieldgroups is set to BUYING_OPTION_REFINEMENTS or FULL in the request.\"\n      },\n      \"Category\": {\n        \"type\": \"object\",\n        \"properties\": {\n          \"categoryId\": {\n            \"type\": \"string\",\n            \"description\": \"The unique identifier of the primary item category of the item, as well as the secondary item category if item was listed in two categories.\"\n          }\n        },\n        \"description\": \"This type is used by the categories container in the response of the search method, and contains the primary item category ID of the item, as well as the secondary item category if the item was listed in two categories.\"\n      },\n      \"CategoryDistribution\": {\n        \"type\": \"object\",\n        \"properties\": {\n          \"categoryId\": {\n            \"type\": \"string\",\n            \"description\": \"The identifier of the category.\"\n          },\n          \"categoryName\": {\n            \"type\": \"string\",\n            \"description\": \"The name of the category, such as Baby \u0026amp; Toddler Clothing.\"\n          },\n          \"matchCount\": {\n            \"type\": \"integer\",\n            \"description\": \"The number of items in this category.\",\n            \"format\": \"int32\"\n          },\n          \"refinementHref\": {\n            \"type\": \"string\",\n            \"description\": \"The HATEOAS reference of this category.\"\n          }\n        },\n        \"description\": \"The container that defines the fields for the category refinements. This container is returned when fieldgroups is set to CATEGORY_REFINEMENTS or FULL in the request.\"\n      },\n      \"ConditionDistribution\": {\n        \"type\": \"object\",\n        \"properties\": {\n          \"condition\": {\n            \"type\": \"string\",\n            \"description\": \"The text describing the condition of the item, such as New or Used. For a list of condition names, see ConditionEnum. Code so that your app gracefully handles any future changes to this list.\"\n          },\n          \"conditionId\": {\n            \"type\": \"string\",\n            \"description\": \"The identifier of the condition. For example, 1000 is the identifier for NEW.\"\n          },\n          \"matchCount\": {\n            \"type\": \"integer\",\n            \"description\": \"The number of items having the condition.\",\n            \"format\": \"int32\"\n          },\n          \"refinementHref\": {\n            \"type\": \"string\",\n            \"description\": \"The HATEOAS reference of this condition.\"\n          }\n        },\n        \"description\": \"The container that defines the fields for the conditions refinements. This container is returned when fieldgroups is set to CONDITION_REFINEMENTS or FULL in the request.\"\n      },\n      \"ConvertedAmount\": {\n        \"type\": \"object\",\n        \"properties\": {\n          \"convertedFromCurrency\": {\n            \"type\": \"string\",\n            \"description\": \"A three-letter ISO 4217 code that indicates the currency of the amount in the convertedFromValue field. This value represents the pre-conversion currency. For implementation help, refer to \u003ca href='https://developer.ebay.com/api-docs/buy/marketplace_insights/types/ba:CurrencyCodeEnum'\u003eeBay API documentation\u003c/a\u003e\"\n          },\n          \"convertedFromValue\": {\n            \"type\": \"string\",\n            \"description\": \"The monetary amount before any conversion is performed, in the currency specified by the convertedFromCurrency field. The value field contains the converted amount of this value, in the currency specified by the currency field.\"\n          },\n          \"currency\": {\n            \"type\": \"string\",\n            \"description\": \"A three-letter ISO 4217 code that indicates the currency of the amount in the value field. This value represents the post-conversion currency of the amount in the value field. For implementation help, refer to \u003ca href='https://developer.ebay.com/api-docs/buy/marketplace_insights/types/ba:CurrencyCodeEnum'\u003eeBay API documentation\u003c/a\u003e\"\n          },\n          \"value\": {\n            \"type\": \"string\",\n            \"description\": \"The monetary value in the currency specified in the currency field.\"\n          }\n        }\n      },\n      \"Error\": {\n        \"type\": \"object\",\n        \"properties\": {\n          \"category\": {\n            \"type\": \"string\",\n            \"description\": \"Identifies the type of erro.\"\n          },\n          \"domain\": {\n            \"type\": \"string\",\n            \"description\": \"Name for the primary system where the error occurred. This is relevant for application errors.\"\n          },\n          \"errorId\": {\n            \"type\": \"integer\",\n            \"description\": \"A unique number to identify the error.\",\n            \"format\": \"int32\"\n          },\n          \"inputRefIds\": {\n            \"type\": \"array\",\n            \"description\": \"An array of request elements most closely associated to the error.\",\n            \"items\": {\n              \"type\": \"string\"\n            }\n          },\n          \"longMessage\": {\n            \"type\": \"string\",\n            \"description\": \"A more detailed explanation of the error.\"\n          },\n          \"message\": {\n            \"type\": \"string\",\n            \"description\": \"Information on how to correct the problem, in the end user's terms and language where applicable.\"\n          },\n          \"outputRefIds\": {\n            \"type\": \"array\",\n            \"description\": \"An array of request elements most closely associated to the error.\",\n            \"items\": {\n              \"type\": \"string\"\n            }\n          },\n          \"parameters\": {\n            \"type\": \"array\",\n            \"description\": \"An array of name/value pairs that describe details the error condition. These are useful when multiple errors are returned.\",\n            \"items\": {\n              \"$ref\": \"#/components/schemas/ErrorParameter\"\n            }\n          },\n          \"subdomain\": {\n            \"type\": \"string\",\n            \"description\": \"Further helps indicate which subsystem the error is coming from. System subcategories include: Initialization, Serialization, Security, Monitoring, Rate Limiting, etc.\"\n          }\n        },\n        \"description\": \"This type defines the fields that can be returned in an error.\"\n      },\n      \"ErrorParameter\": {\n        \"type\": \"object\",\n        \"properties\": {\n          \"name\": {\n            \"type\": \"string\",\n            \"description\": \"The object of the error.\"\n          },\n          \"value\": {\n            \"type\": \"string\",\n            \"description\": \"The value of the object.\"\n          }\n        }\n      },\n      \"Image\": {\n        \"type\": \"object\",\n        \"properties\": {\n          \"height\": {\n            \"type\": \"integer\",\n            \"description\": \"Reserved for future use.\",\n            \"format\": \"int32\"\n          },\n          \"imageUrl\": {\n            \"type\": \"string\",\n            \"description\": \"The URL of the image.\"\n          },\n          \"width\": {\n            \"type\": \"integer\",\n            \"description\": \"Reserved for future use.\",\n            \"format\": \"int32\"\n          }\n        },\n        \"description\": \"Type the defines the details of an image, such as size and image URL. Currently only imageUrl is populated. The height and width were added for future use.\"\n      },\n      \"ItemLocation\": {\n        \"type\": \"object\",\n        \"properties\": {\n          \"addressLine1\": {\n            \"type\": \"string\",\n            \"description\": \"The first line of the street address.\"\n          },\n          \"addressLine2\": {\n            \"type\": \"string\",\n            \"description\": \"The second line of the street address. This field may contain such values as an apartment or suite number.\"\n          },\n          \"city\": {\n            \"type\": \"string\",\n            \"description\": \"The city in which the item is located.\"\n          },\n          \"country\": {\n            \"type\": \"string\",\n            \"description\": \"The two-letter ISO 3166 standard code that indicates the country in which the item is located. For implementation help, refer to \u003ca href='https://developer.ebay.com/api-docs/buy/marketplace_insights/types/ba:CountryCodeEnum'\u003eeBay API documentation\u003c/a\u003e\"\n          },\n          \"county\": {\n            \"type\": \"string\",\n            \"description\": \"The county in which the item is located.\"\n          },\n          \"postalCode\": {\n            \"type\": \"string\",\n            \"description\": \"The postal code (or zip code in US) where the item is located. Note: Beginning in late January 2020, the displayed postal code will be masked to all users. Different countries will mask postal/zip codes in slightly different ways, but an example would be 951**.\"\n          },\n          \"stateOrProvince\": {\n            \"type\": \"string\",\n            \"description\": \"The state or province in which the item is located.\"\n          }\n        },\n        \"description\": \"The type that defines the fields for the locaton of an item, including postal code, county, state/province, street address, city, and country (2-digit ISO code).\"\n      },\n      \"ItemSales\": {\n        \"type\": \"object\",\n        \"properties\": {\n          \"additionalImages\": {\n            \"type\": \"array\",\n            \"description\": \"An array of containers with the URLs for the images that are in addition to the primary image. The primary image is returned in the image.imageUrl field.\",\n            \"items\": {\n              \"$ref\": \"#/components/schemas/Image\"\n            }\n          },\n          \"adultOnly\": {\n            \"type\": \"boolean\",\n            \"description\": \"This indicates if the item is for adults only. For more information about adult-only items on eBay, see Adult items policy for sellers and Adult-Only items on eBay for buyers.\"\n          },\n          \"bidCount\": {\n            \"type\": \"integer\",\n            \"description\": \"This integer value indicates the total number of bids that have been placed for an auction item. This field is only returned for auction items.\",\n            \"format\": \"int32\"\n          },\n          \"buyingOptions\": {\n            \"type\": \"array\",\n            \"description\": \"A comma separated list of the purchase options available for the item, such as FIXED_PRICE, AUCTION. FIXED_PRICE - Returned for fixed-price items (non-auction) AUCTION - Returned for auction items without Buy It Now feature FIXED_PRICE and AUCTION - Returned for auction items enabled with the Buy It Now feature Code so that your app gracefully handles any future changes to this list.\",\n            \"items\": {\n              \"type\": \"string\"\n            }\n          },\n          \"categories\": {\n            \"type\": \"array\",\n            \"description\": \"This container returns the primary category ID of the item, as well as the secondary category if the item was listed in two categories.\",\n            \"items\": {\n              \"$ref\": \"#/components/schemas/Category\"\n            }\n          },\n          \"condition\": {\n            \"type\": \"string\",\n            \"description\": \"The text describing the condition of the item, such as New or Used. For a list of condition names, see Item Condition IDs and Names. Code so that your app gracefully handles any future changes to this list.\"\n          },\n          \"conditionId\": {\n            \"type\": \"string\",\n            \"description\": \"The identifier of the condition of the item. For example, 1000 is the identifier for NEW. For a list of condition names and IDs, see Item Condition IDs and Names. Code so that your app gracefully handles any future changes to this list.\"\n          },\n          \"epid\": {\n            \"type\": \"string\",\n            \"description\": \"An ePID is the eBay product identifier of a product from the eBay product catalog. This indicates the product in which the item belongs.\"\n          },\n          \"image\": {\n            \"description\": \"The URL to the primary image of the item.\",\n            \"$ref\": \"#/components/schemas/Image\"\n          },\n          \"itemAffiliateWebUrl\": {\n            \"type\": \"string\",\n            \"description\": \"The URL to the View Item page of the item, which includes the affiliate tracking ID. This field is only returned if the eBay partner enables affiliate tracking for the item by including the X-EBAY-C-ENDUSERCTX request header in the method.\"\n          },\n          \"itemGroupHref\": {\n            \"type\": \"string\",\n            \"description\": \"The HATEOAS reference of the parent page of the item group. An item group is an item that has various aspect differences, such as color, size, storage capacity, etc. Note: This field is returned only for item groups.\"\n          },\n          \"itemGroupType\": {\n            \"type\": \"string\",\n            \"description\": \"Indicates the item group type. An item group is an item that has various aspect differences, such as color, size, storage capacity, etc. Currently, only the SELLER_DEFINED_VARIATIONS group type is supported and indicates that this is an item group created by the seller. Note: This field is returned only for item groups. Code so that your app gracefully handles any future changes to this list.\"\n          },\n          \"itemHref\": {\n            \"type\": \"string\",\n            \"description\": \"The URI of the item.\"\n          },\n          \"itemId\": {\n            \"type\": \"string\",\n            \"description\": \"The unique RESTful identifier of the item.\"\n          },\n          \"itemLocation\": {\n            \"description\": \"This container returns the postal code and country of the location of the item.\",\n            \"$ref\": \"#/components/schemas/ItemLocation\"\n          },\n          \"itemWebUrl\": {\n            \"type\": \"string\",\n            \"description\": \"The URL to the View Item page of the item.\"\n          },\n          \"lastSoldDate\": {\n            \"type\": \"string\",\n            \"description\": \"The date the last item was purchased within the last 90 days. The totalSoldQuantity returns the total number of items that were sold. This field returns the date the last item in that group was sold.\"\n          },\n          \"lastSoldPrice\": {\n            \"description\": \"The sold price of the last item purchased within the last 90 days. The totalSoldQuantity returns the total number of items that were sold. This field returns the date the last item in that group was sold..\",\n            \"$ref\": \"#/components/schemas/ConvertedAmount\"\n          },\n          \"seller\": {\n            \"description\": \"This container returns basic information about the seller of the item, such as name, feedback score, etc.\",\n            \"$ref\": \"#/components/schemas/Seller\"\n          },\n          \"thumbnailImages\": {\n            \"type\": \"array\",\n            \"description\": \"An array of thumbnail images for the item.\",\n            \"items\": {\n              \"$ref\": \"#/components/schemas/Image\"\n            }\n          },\n          \"title\": {\n            \"type\": \"string\",\n            \"description\": \"The seller-created title of the item. Maximum Length: 80 characters\"\n          },\n          \"totalSoldQuantity\": {\n            \"type\": \"integer\",\n            \"description\": \"The total number of this item that have been sold.\",\n            \"format\": \"int32\"\n          }\n        },\n        \"description\": \"This type defines the fields for the sold items sales history information.\"\n      },\n      \"Refinement\": {\n        \"type\": \"object\",\n        \"properties\": {\n          \"aspectDistributions\": {\n            \"type\": \"array\",\n            \"description\": \"A array of containers for the all the aspect refinements.\",\n            \"items\": {\n              \"$ref\": \"#/components/schemas/AspectDistribution\"\n            }\n          },\n          \"buyingOptionDistributions\": {\n            \"type\": \"array\",\n            \"description\": \"A array of containers for the all the buying option refinements.\",\n            \"items\": {\n              \"$ref\": \"#/components/schemas/BuyingOptionDistribution\"\n            }\n          },\n          \"categoryDistributions\": {\n            \"type\": \"array\",\n            \"description\": \"A array of containers for the all the category refinements.\",\n            \"items\": {\n              \"$ref\": \"#/components/schemas/CategoryDistribution\"\n            }\n          },\n          \"conditionDistributions\": {\n            \"type\": \"array\",\n            \"description\": \"A array of containers for the all the condition refinements.\",\n            \"items\": {\n              \"$ref\": \"#/components/schemas/ConditionDistribution\"\n            }\n          },\n          \"dominantCategoryId\": {\n            \"type\": \"string\",\n            \"description\": \"The identifier of the category that most of the items are part of.\"\n          }\n        },\n        \"description\": \"This type defines the fields for the various refinements of an item. You can use the information in this container to create histograms, which help shoppers choose exactly what they want.\"\n      },\n      \"SalesHistoryPagedCollection\": {\n        \"type\": \"object\",\n        \"properties\": {\n          \"href\": {\n            \"type\": \"string\",\n            \"description\": \"The URI of the current page of results from the result set. The following example returns items 1 thru 5 from the list of items found. https://api.ebay.com/buy/marketplace_insights/v1_beta/item_sales/search?q=shirt\u0026amp;\u0026amp;limit=5\u0026amp;offset=0\"\n          },\n          \"itemSales\": {\n            \"type\": \"array\",\n            \"description\": \"The type that defines the fields for a paginated result set of the sold items. The response consists of 0 or more sequenced result sets where each result sets has 0 or more items. Note: For items with multiple quantities that might result in multiple transactions, and items with the SELLER_DEFINED_VARIATIONS group type that might result in multiple transactions, only one deduped transaction is returned in the search results.\",\n            \"items\": {\n              \"$ref\": \"#/components/schemas/ItemSales\"\n            }\n          },\n          \"limit\": {\n            \"type\": \"integer\",\n            \"description\": \"The number of items returned on a single page from the result set. This value can be set in the request with the limit query parameter.\",\n            \"format\": \"int32\"\n          },\n          \"next\": {\n            \"type\": \"string\",\n            \"description\": \"The URI for the following page of results. This value is returned only if there is an additional page of results to display from the result set. Max length: 2048\"\n          },\n          \"offset\": {\n            \"type\": \"integer\",\n            \"description\": \"The number of results skipped in the result set before listing the first returned result. This value can be set in the request with the offset query parameter.\",\n            \"format\": \"int32\"\n          },\n          \"prev\": {\n            \"type\": \"string\",\n            \"description\": \"The URI for the preceding page of results. This value is returned only if there is a previous page of results to display from the result set. Max length: 2048\"\n          },\n          \"refinement\": {\n            \"description\": \"The container for all the search refinements.\",\n            \"$ref\": \"#/components/schemas/Refinement\"\n          },\n          \"total\": {\n            \"type\": \"integer\",\n            \"description\": \"The total number of items retrieved in the result set. If no items are found, this field is returned with a value of 0.\",\n            \"format\": \"int32\"\n          }\n        }\n      },\n      \"Seller\": {\n        \"type\": \"object\",\n        \"properties\": {\n          \"feedbackPercentage\": {\n            \"type\": \"string\",\n            \"description\": \"The percentage of the total positive feedback.\"\n          },\n          \"feedbackScore\": {\n            \"type\": \"integer\",\n            \"description\": \"The feedback score of the seller. This value is based on the ratings from eBay members that bought items from this seller.\",\n            \"format\": \"int32\"\n          },\n          \"username\": {\n            \"type\": \"string\",\n            \"description\": \"The username created by the seller for use on eBay.\"\n          }\n        },\n        \"description\": \"The type that defines the fields for basic information about the seller of the item.\"\n      }\n    },\n    \"securitySchemes\": {\n      \"api_auth\": {\n        \"type\": \"oauth2\",\n        \"description\": \"The security definitions for this API. Please check individual operations for applicable scopes.\",\n        \"flows\": {\n          \"clientCredentials\": {\n            \"tokenUrl\": \"https://api.ebay.com/identity/v1/oauth2/token\",\n            \"scopes\": {\n              \"https://api.ebay.com/oauth/api_scope/buy.marketplace.insights\": \"View historical sales data to help buyers make informed purchasing decisions\"\n            }\n          }\n        }\n      }\n    }\n  }\n}",
			"canonicalURL": "/github.com/hendt/ebay-api@a9d1c67e5f5846b72b544231c77446696034459d/-/blob/test/api/restful/buy/marketplaceInsights/buy_marketplace_insights_v1_beta_oas3.json",
			"externalURLs": [
				{
					"url": "https://github.com/hendt/ebay-api/blob/a9d1c67e5f5846b72b544231c77446696034459d/test/api/restful/buy/marketplaceInsights/buy_marketplace_insights_v1_beta_oas3.json",
					"serviceKind": "GITHUB"
				}
			]
		}
	},
	"Error": "notImplemented: path \"/item_sales/search\": get: security: security \"api_auth\" (index 0): oauth2 security not implemented",
	"NotImplemented": [
		"oauth2 security"
	]
}