{
	"File": {
		"__typename": "FileMatch",
		"repository": {
			"name": "github.com/ballerina-platform/openapi-connectors"
		},
		"file": {
			"name": "openapi.yml",
			"size": 0,
			"path": "openapi/ebay.finances/openapi.yml",
			"byteSize": 92314,
			"content": "openapi: 3.0.0\ninfo:\n  x-ballerina-display:\n    label: eBay Finances\n    iconPath: \"icon.png\"\n  title: eBay Finances API\n  description: \u003e-\n    This is a generated connector for [eBay finances API v1.9.0](https://developer.ebay.com/api-docs/sell/finances/overview.html) OpenAPI Specification. \n    \n    The eBay Developers Program is hosted on the eBay Developer Site. The program provides information and services for \n    the eBay developer community. This API is used to retrieve seller payouts and monetary transaction details\n    related to those payouts. The finances API is used by sellers in eBay's managed payments program to retrieve seller payout information. \n    The data provided through this public API is similar to the data that the seller will see under the Payments tab of \n    Seller Hub in My eBay. With eBay's managed payments program, eBay manages the entire payments process, including the \n    available payment methods, and shortly after a buyer's payment clears, eBay distributes payouts directly to the \n    seller's preferred bank account.\n  x-ballerina-init-description: \u003e- \n    The connector initialization requires setting the API credentials. \n    \n    Create a [developer account](https://developer.ebay.com/api-docs/static/creating-edp-account.html) \n    and obtain tokens following [this guide](https://developer.ebay.com/api-docs/static/oauth-tokens.html).\n  contact:\n    name: 'eBay Inc,'\n  license:\n    name: eBay API License Agreement\n    url: 'https://go.developer.ebay.com/api-license-agreement'\n  version: 1.9.0\nservers:\n  - url: 'https://apiz.ebay.com{basePath}'\n    description: Production\n    variables:\n      basePath:\n        default: /sell/finances/v1\npaths:\n  '/payout/{payout_Id}':\n    get:\n      tags:\n        - payout\n      summary: \u003e-\n        This method retrieves details on a specific seller payout. The unique\n        identfier of the payout is passed in as a path parameter at the end of\n        the call URI. The getPayouts method can be used to retrieve the unique\n        identifier of a payout, or the user can check Seller Hub.\n      operationId: getPayout\n      parameters:\n        - name: payout_Id\n          in: path\n          description: \u003e-\n            The unique identfier of the payout is passed in as a path parameter\n            at the end of the call URI. The getPayouts method can be used to\n            retrieve the unique identifier of a payout, or the user can check\n            Seller Hub to get the payout ID.\n          required: true\n          schema:\n            type: string\n      responses:\n        '200':\n          description: Success\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/Payout'\n        '400':\n          description: Bad Request\n        '404':\n          description: Not found\n          x-response-codes:\n            errors:\n              '135001':\n                domain: API_FINANCES\n                category: REQUEST\n                description: The payout id was not found.\n        '500':\n          description: Internal Server Error\n          x-response-codes:\n            errors:\n              '135000':\n                domain: API_FINANCES\n                category: APPLICATION\n                description: \u003e-\n                  There was a problem with an eBay internal system or process.\n                  Contact eBay developer support for assistance.\n      security:\n        - api_auth:\n            - 'https://api.ebay.com/oauth/api_scope/sell.finances'\n  /payout:\n    get:\n      tags:\n        - payout\n      summary: \u003e-\n        This method is used to retrieve the details of one or more seller\n        payouts. By using the filter query parameter, users can retrieve payouts\n        processed within a specific date range, and/or they can retrieve payouts\n        in a specific state. There are also pagination and sort query parameters\n        that allow users to control the payouts that are returned in the\n        response. If no payouts match the input criteria, an empty payload is\n        returned.\n      operationId: getPayouts\n      parameters:\n        - name: filter\n          in: query\n          description: \u003e-\n            The three filter types that can be used here are discussed below. If\n            none of these filters are used, all recent payouts in all states are\n            returned: payoutDate: search for payouts within a specific range of\n            dates. The date format to use is YYYY-MM-DDTHH:MM:SS.SSSZ. Below is\n            the proper syntax to use if filtering by a date range:\n            https://apiz.ebay.com/sell/finances/v1/payout?filter=payoutDate:[2018-12-17T00:00:01.000Z..2018-12-24T00:00:01.000Z]\n            Alternatively, the user could omit the ending date, and the date\n            range would include the starting date and up to 90 days past that\n            date, or the current date if the starting date is less than 90 days\n            in the past. lastAttemptedPayoutDate: search for attempted payouts\n            that failed within a specific range of dates. In order to use this\n            filter, the payoutStatus filter must also be used and its value must\n            be set to RETRYABLE_FAILED. The date format to use is\n            YYYY-MM-DDTHH:MM:SS.SSSZ. The same syntax used for the payoutDate\n            filter is also used for the lastAttemptedPayoutDate filter. This\n            filter is only applicable (and will return results) if one or more\n            seller payouts have failed, but are retryable. payoutStatus: search\n            for payouts in a particular state. Only one payout state can be\n            specified with this filter. The supported payoutStatus values are as\n            follows: INITIATED: search for payouts that have been initiated but\n            not processed. SUCCEEDED: search for successful payouts.\n            RETRYABLE_FAILED: search for payouts that failed, but ones which\n            will be tried again. This value must be used if filtering by\n            lastAttemptedPayoutDate. TERMINAL_FAILED: search for payouts that\n            failed, and ones that will not be tried again. REVERSED: search for\n            payouts that were reversed. Below is the proper syntax to use if\n            filtering by payout status:\n            https://apiz.ebay.com/sell/finances/v1/payout?filter=payoutStatus:{SUCCEEDED}\n            If both the payoutDate and payoutStatus filters are used, payouts\n            must satisfy both criteria to be returned. For implementation help,\n            refer to eBay API documentation at\n            https://developer.ebay.com/api-docs/sell/finances/types/cos:FilterField\n          required: false\n          schema:\n            type: string\n        - name: sort\n          in: query\n          description: \u003e-\n            By default, payouts or failed payouts that match the input criteria\n            are sorted in ascending order according to the payout date/last\n            attempted payout date (oldest payouts returned first). To view\n            payouts in descending order instead (most recent payouts/attempted\n            payouts first), you would include the sort query parameter, and then\n            set the value of its field parameter to payoutDate or\n            lastAttemptedPayoutDate (if searching for failed, retrybable\n            payouts). Below is the proper syntax to use if filtering by a payout\n            date range in descending order:\n            https://apiz.ebay.com/sell/finances/v1/payout?filter=payoutDate:[2018-12-17T00:00:01.000Z..2018-12-24T00:00:01.000Z]\u0026amp;sort=payoutDate\n            Payouts can only be sorted according to payout date, and can not be\n            sorted by payout status. For implementation help, refer to eBay API\n            documentation at\n            https://developer.ebay.com/api-docs/sell/finances/types/cos:SortField\n          required: false\n          schema:\n            type: string\n        - name: limit\n          in: query\n          description: \u003e-\n            The number of payouts to return per page of the result set. Use this\n            parameter in conjunction with the offset parameter to control the\n            pagination of the output. For example, if offset is set to 10 and\n            limit is set to 10, the method retrieves payouts 11 thru 20 from the\n            result set. Note: This feature employs a zero-based list, where the\n            first payout in the results set has an offset value of 0. Maximum:\n            200 Default: 20\n          required: false\n          schema:\n            type: string\n        - name: offset\n          in: query\n          description: \u003e-\n            This integer value indicates the actual position that the first\n            payout returned on the current page has in the results set. So, if\n            you wanted to view the 11th payout of the result set, you would set\n            the offset value in the request to 10. In the request, you can use\n            the offset parameter in conjunction with the limit parameter to\n            control the pagination of the output. For example, if offset is set\n            to 30 and limit is set to 10, the method retrieves payouts 31 thru\n            40 from the resulting collection of payouts. Note: This feature\n            employs a zero-based list, where the first payout in the results set\n            has an offset value of 0. Default: 0 (zero)\n          required: false\n          schema:\n            type: string\n      responses:\n        '200':\n          description: Success\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/Payouts'\n        '204':\n          description: No Content\n        '400':\n          description: Bad Request\n          x-response-codes:\n            errors:\n              '135002':\n                domain: API_FINANCES\n                category: REQUEST\n                description: The value of payout status filter is invalid.\n              '135003':\n                domain: API_FINANCES\n                category: REQUEST\n                description: The value of pagination is invalid.\n              '135004':\n                domain: API_FINANCES\n                category: REQUEST\n                description: The value of payout date filter is invalid.\n              '135005':\n                domain: API_FINANCES\n                category: REQUEST\n                description: The value of sorting is invalid.\n        '500':\n          description: Internal Server Error\n          x-response-codes:\n            errors:\n              '135000':\n                domain: API_FINANCES\n                category: APPLICATION\n                description: \u003e-\n                  There was a problem with an eBay internal system or process.\n                  Contact eBay developer support for assistance.\n      security:\n        - api_auth:\n            - 'https://api.ebay.com/oauth/api_scope/sell.finances'\n  /payout_summary:\n    get:\n      tags:\n        - payout\n      summary: \u003e-\n        This method is used to retrieve cumulative values for payouts in a\n        particular state, or all states. The metadata in the response includes\n        total payouts, the total number of monetary transactions (sales,\n        refunds, credits) associated with those payouts, and the total dollar\n        value of all payouts. If the filter query parameter is used to filter by\n        payout status, only one payout status value may be used. If the filter\n        query parameter is not used to filter by a specific payout status,\n        cumulative values for payouts in all states are returned. The user can\n        also use the filter query parameter to specify a date range, and then\n        only payouts that were processed within that date range are considered.\n      operationId: getPayoutSummary\n      parameters:\n        - name: filter\n          in: query\n          description: \u003e-\n            The two filter types that can be used here are discussed below. One\n            or both of these filter types can be used. If none of these filters\n            are used, the data returned in the response will reflect payouts, in\n            all states, processed within the last 90 days. payoutDate: consider\n            payouts processed within a specific range of dates. The date format\n            to use is YYYY-MM-DDTHH:MM:SS.SSSZ. Below is the proper syntax to\n            use if filtering by a date range:\n            https://apiz.ebay.com/sell/finances/v1/payout_summary?filter=payoutDate:[2018-12-17T00:00:01.000Z..2018-12-24T00:00:01.000Z]\n            Alternatively, the user could omit the ending date, and the date\n            range would include the starting date and up to 90 days past that\n            date, or the current date if the starting date is less than 90 days\n            in the past. payoutStatus: consider only the payouts in a particular\n            state. Only one payout state can be specified with this filter. The\n            supported payoutStatus values are as follows: INITIATED: search for\n            payouts that have been initiated but not processed. SUCCEEDED:\n            consider only successful payouts. RETRYABLE_FAILED: consider only\n            payouts that failed, but ones which will be tried again.\n            TERMINAL_FAILED: consider only payouts that failed, and ones that\n            will not be tried again. REVERSED: consider only payouts that were\n            reversed. Below is the proper syntax to use if filtering by payout\n            status:\n            https://apiz.ebay.com/sell/finances/v1/payout_summary?filter=payoutStatus:{SUCCEEDED}\n            If both the payoutDate and payoutStatus filters are used, only the\n            payouts that satisfy both criteria are considered in the results.\n            For implementation help, refer to eBay API documentation at\n            https://developer.ebay.com/api-docs/sell/finances/types/cos:FilterField\n          required: false\n          schema:\n            type: string\n      responses:\n        '200':\n          description: Success\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/PayoutSummaryResponse'\n        '400':\n          description: Bad Request\n          x-response-codes:\n            errors:\n              '135002':\n                domain: API_FINANCES\n                category: REQUEST\n                description: The value of payout status filter is invalid\n              '135004':\n                domain: API_FINANCES\n                category: REQUEST\n                description: The value of payout date filter is invalid\n        '500':\n          description: Internal Server Error\n          x-response-codes:\n            errors:\n              '135000':\n                domain: API_FINANCES\n                category: APPLICATION\n                description: \u003e-\n                  There was a problem with an eBay internal system or process.\n                  Contact eBay developer support for assistance.\n      security:\n        - api_auth:\n            - 'https://api.ebay.com/oauth/api_scope/sell.finances'\n  /transaction:\n    get:\n      tags:\n        - transaction\n      summary: \u003e-\n        This method allows a seller to retrieve one or monetary transactions. In\n        this case, 'monetary transactions' include sales orders, buyer refunds,\n        seller credits, buyer-initiated payment disputes, eBay shipping label\n        purchases, and transfers. There are numerous input filters available for\n        use, including filters to retrieve specific types of monetary\n        transactions, to retrieve monetary transactions processed within a\n        specific date range, or to retrieve monetary transactions in a specific\n        state. See the filter field for more information on each filter, and how\n        each one is used. There are also pagination and sort query parameters\n        that allow users to further control the monetary transactions that are\n        returned in the response. If no monetary transactions match the input\n        criteria, an http status code of 204 No Content is returned with no\n        response payload.\n      operationId: getTransactions\n      parameters:\n        - name: filter\n          in: query\n          description: \u003e-\n            Numerous filters are available for the getTransactions method, and\n            these filters are discussed below. One or more of these filter types\n            can be used. If none of these filters are used, all monetary\n            transactions from the last 90 days are returned: transactionDate:\n            search for monetary transactions that occurred within a specific\n            range of dates. Note: All dates must be input using UTC format\n            (YYYY-MM-DDTHH:MM:SS.SSSZ) and should be adjusted accordingly for\n            the local timezone of the user. Below is the proper syntax to use if\n            filtering by a date range:\n            https://apiz.ebay.com/sell/finances/v1/transaction?filter=transactionDate:[2018-10-23T00:00:01.000Z..2018-11-09T00:00:01.000Z]\n            Alternatively, the user could omit the ending date, and the date\n            range would include the starting date and up to 90 days past that\n            date, or the current date if the starting date is less than 90 days\n            in the past. transactionType: search for a specific type of monetary\n            transaction. The supported transactionType values are as follows:\n            SALE: a sales order. REFUND: a refund to the buyer after an order\n            cancellation or return. CREDIT: a credit issued by eBay to the\n            seller's account. DISPUTE: a monetary transaction associated with a\n            payment dispute between buyer and seller. NON_SALE_CHARGE: a\n            monetary transaction involving a seller transferring money to eBay\n            for the balance of a charge for NON_SALE_CHARGE transactions\n            (transactions that contain non-transactional seller fees). These can\n            include a one-time payment, monthly/yearly subscription fees charged\n            monthly, NRC charges, and fee credits. SHIPPING_LABEL: a monetary\n            transaction where eBay is billing the seller for an eBay shipping\n            label. Note that the shipping label functionality will initially\n            only be available to a select number of sellers. TRANSFER: A\n            transfer is a monetary transaction where eBay is billing the seller\n            for reimbursement of a charge. An example of a transfer is a seller\n            reimbursing eBay for a buyer refund.Below is the proper syntax to\n            use if filtering by a monetary transaction type:\n            https://apiz.ebay.com/sell/finances/v1/transaction?filter=transactionType:{SALE}\n            transactionStatus: this filter type is only applicable for sales\n            orders, and allows the user to filter seller payouts in a particular\n            state. The supported transactionStatus values are as follows:\n            PAYOUT: this indicates that the proceeds from the corresponding\n            sales order has been paid out to the seller's account.\n            FUNDS_PROCESSING: this indicates that the funds for the\n            corresponding monetary transaction are currently being processed.\n            FUNDS_AVAILABLE_FOR_PAYOUT: this indicates that the proceeds from\n            the corresponding sales order are available for a seller payout, but\n            processing has not yet begun. FUNDS_ON_HOLD: this indicates that the\n            proceeds from the corresponding sales order are currently being held\n            by eBay, and are not yet available for a seller payout. COMPLETED:\n            this indicates that the funds for the corresponding TRANSFER\n            monetary transaction have transferred and the transaction has\n            completed. FAILED: this indicates the process has failed for the\n            corresponding TRANSFER monetary transaction. Below is the proper\n            syntax to use if filtering by transaction status:\n            https://apiz.ebay.com/sell/finances/v1/transaction?filter=transactionStatus:{PAYOUT}\n            buyerUsername: the eBay user ID of the buyer involved in the\n            monetary transaction. Only monetary transactions involving this\n            buyer are returned. Below is the proper syntax to use if filtering\n            by a specific eBay buyer:\n            https://apiz.ebay.com/sell/finances/v1/transaction?filter=buyerUsername:{buyer1234}\n            salesRecordReference: the unique Selling Manager identifier of the\n            order involved in the monetary transaction. Only monetary\n            transactions involving this Selling Manager Sales Record ID are\n            returned. Below is the proper syntax to use if filtering by a\n            specific Selling Manager Sales Record ID:\n            https://apiz.ebay.com/sell/finances/v1/transaction?filter=salesRecordReference:{123}\n            Note: For all orders originating after February 1, 2020, a value of\n            0 will be returned in the salesRecordReference field. So, this\n            filter will only be useful to retrieve orders than occurred before\n            this date. payoutId: the unique identifier of a seller payout. This\n            value is auto-generated by eBay once the seller payout is set to be\n            processed. Only monetary transactions involving this Payout ID are\n            returned. Below is the proper syntax to use if filtering by a\n            specific Payout ID:\n            https://apiz.ebay.com/sell/finances/v1/transaction?filter=payoutId:{5000106638}\n            transactionId: the unique identifier of a monetary transaction. For\n            a sales order, the orderId filter should be used instead. Only the\n            monetary transaction defined by the identifier is returned. Note:\n            This filter cannot be used alone; the transactionType must also be\n            specified when filtering by transaction ID. Below is the proper\n            syntax to use if filtering by a specific transaction ID:\n            https://apiz.ebay.com/sell/finances/v1/transaction?filter=transactionId:{03-03620-33763}\u0026amp;filter=transactionType:{SALE}\n            orderId: the unique identifier of a sales order. For any other\n            monetary transaction, the transactionId filter should be used\n            instead. Only the sales order defined by the identifier is returned.\n            Below is the proper syntax to use if filtering by a specific order\n            ID:\n            https://apiz.ebay.com/sell/finances/v1/transaction?filter=orderId:{03-03620-33763}\n            For implementation help, refer to eBay API documentation at\n            https://developer.ebay.com/api-docs/sell/finances/types/cos:FilterField\n          required: false\n          schema:\n            type: string\n        - name: sort\n          in: query\n          description: \u003e-\n            Sorting is not yet available for the getTransactions method. By\n            default, monetary transactions that match the input criteria are\n            sorted in descending order according to the transaction date. For\n            implementation help, refer to eBay API documentation at\n            https://developer.ebay.com/api-docs/sell/finances/types/cos:SortField\n          required: false\n          schema:\n            type: string\n        - name: limit\n          in: query\n          description: \u003e-\n            The number of monetary transactions to return per page of the result\n            set. Use this parameter in conjunction with the offset parameter to\n            control the pagination of the output. For example, if offset is set\n            to 10 and limit is set to 10, the method retrieves monetary\n            transactions 11 thru 20 from the result set. Note: This feature\n            employs a zero-based list, where the first item in the list has an\n            offset of 0. If an orderId, transactionId, or payoutId filter is\n            included in the request, any limit value will be ignored. Maximum:\n            1000 Default: 20\n          required: false\n          schema:\n            type: string\n        - name: offset\n          in: query\n          description: \u003e-\n            This integer value indicates the actual position that the first\n            monetary transaction returned on the current page has in the results\n            set. So, if you wanted to view the 11th monetary transaction of the\n            result set, you would set the offset value in the request to 10. In\n            the request, you can use the offset parameter in conjunction with\n            the limit parameter to control the pagination of the output. For\n            example, if offset is set to 30 and limit is set to 10, the method\n            retrieves transactions 31 thru 40 from the resulting collection of\n            transactions. Note: This feature employs a zero-based list, where\n            the first item in the list has an offset of 0. Default: 0 (zero)\n          required: false\n          schema:\n            type: string\n      responses:\n        '200':\n          description: Success\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/Transactions'\n        '204':\n          description: No Content\n        '400':\n          description: Bad Request\n          x-response-codes:\n            errors:\n              '135003':\n                domain: API_FINANCES\n                category: REQUEST\n                description: The value of pagination is invalid.\n              '135005':\n                domain: API_FINANCES\n                category: REQUEST\n                description: The value of sorting is invalid.\n              '135006':\n                domain: API_FINANCES\n                category: REQUEST\n                description: The value of transaction type filter is invalid.\n              '135007':\n                domain: API_FINANCES\n                category: REQUEST\n                description: The value of transaction status filter is invalid.\n              '135008':\n                domain: API_FINANCES\n                category: REQUEST\n                description: The value of transaction date filter is invalid.\n              '135009':\n                domain: API_FINANCES\n                category: REQUEST\n                description: Transaction type filter is missing.\n        '500':\n          description: Internal Server Error\n          x-response-codes:\n            errors:\n              '135000':\n                domain: API_FINANCES\n                category: APPLICATION\n                description: \u003e-\n                  There was a problem with an eBay internal system or process.\n                  Contact eBay developer support for assistance.\n      security:\n        - api_auth:\n            - 'https://api.ebay.com/oauth/api_scope/sell.finances'\n  /transaction_summary:\n    get:\n      tags:\n        - transaction\n      summary: \u003e-\n        This method is used to retrieve cumulative values for five types of\n        monetary transactions (order sales, seller credits, buyer refunds,\n        buyer-initiated payment disputes, eBay shipping label purchases, and\n        transfers). If applicable, the number of payment holds and the amount of\n        the holds are also returned. See the description for the filter query\n        parameter for more information on the available filters. Note: Unless\n        the transactionType filter is used to retrieve a specific type of\n        monetary transaction (sale, buyer refund, seller credit, payment\n        dispute, shipping label, transfer), the creditCount and creditAmount\n        response fields account for both order sales and seller credits (the\n        count and value is not distinguished between the two monetary\n        transaction types).\n      operationId: getTransactionSummary\n      parameters:\n        - name: filter\n          in: query\n          description: \u003e-\n            Numerous filters are available for the getTransactionSummary method,\n            and these filters are discussed below. One or more of these filter\n            types can be used. The transactionStatus filter must be used. All\n            other filters are optional. transactionStatus: the data returned in\n            the response pertains to the sales, payouts, and transfer status\n            set. The supported transactionStatus values are as follows: PAYOUT:\n            only consider monetary transactions where the proceeds from the\n            sales order(s) have been paid out to the seller's bank account.\n            FUNDS_PROCESSING: only consider monetary transactions where the\n            proceeds from the sales order(s) are currently being processed.\n            FUNDS_AVAILABLE_FOR_PAYOUT: only consider monetary transactions\n            where the proceeds from the sales order(s) are available for a\n            seller payout, but processing has not yet begun. FUNDS_ON_HOLD: only\n            consider monetary transactions where the proceeds from the sales\n            order(s) are currently being held by eBay, and are not yet available\n            for a seller payout. COMPLETED: this indicates that the funds for\n            the corresponding TRANSFER monetary transaction have transferred and\n            the transaction has completed. FAILED: this indicates the process\n            has failed for the corresponding TRANSFER monetary transaction.\n            Below is the proper syntax to use when setting up the\n            transactionStatus filter:\n            https://apiz.ebay.com/sell/finances/v1/transaction_summary?filter=transactionStatus:{PAYOUT}\n            transactionDate: only consider monetary transactions that occurred\n            within a specific range of dates. Note: All dates must be input\n            using UTC format (YYYY-MM-DDTHH:MM:SS.SSSZ) and should be adjusted\n            accordingly for the local timezone of the user. Below is the proper\n            syntax to use if filtering by a date range:\n            https://apiz.ebay.com/sell/finances/v1/transaction_summary?filter=transactionDate:[2018-10-23T00:00:01.000Z..2018-11-09T00:00:01.000Z]\n            Alternatively, the user could omit the ending date, and the date\n            range would include the starting date and up to 90 days past that\n            date, or the current date if the starting date is less than 90 days\n            in the past. transactionType: only consider a specific type of\n            monetary transaction. The supported transactionType values are as\n            follows: SALE: a sales order. REFUND: a refund to the buyer after an\n            order cancellation or return. CREDIT: a credit issued by eBay to the\n            seller's account. DISPUTE: a monetary transaction associated with a\n            payment dispute between buyer and seller. NON_SALE_CHARGE: a\n            monetary transaction involving a seller transferring money to eBay\n            for the balance of a charge for NON_SALE_CHARGE transactions\n            (transactions that contain non-transactional seller fees). These can\n            include a one-time payment, monthly/yearly subscription fees charged\n            monthly, NRC charges, and fee credits. SHIPPING_LABEL: a monetary\n            transaction where eBay is billing the seller for an eBay shipping\n            label. Note that the shipping label functionality will initially\n            only be available to a select number of sellers. TRANSFER: A\n            transfer is a monetary transaction where eBay is billing the seller\n            for reimbursement of a charge. An example of a transfer is a seller\n            reimbursing eBay for a buyer refund.Below is the proper syntax to\n            use if filtering by a monetary transaction type:\n            https://apiz.ebay.com/sell/finances/v1/transaction_summary?filter=transactionType:{SALE}\n            buyerUsername: only consider monetary transactions involving a\n            specific buyer (specified with the buyer's eBay user ID). Below is\n            the proper syntax to use if filtering by a specific eBay buyer:\n            https://apiz.ebay.com/sell/finances/v1/transaction_summary?filter=buyerUsername:{buyer1234}\n            salesRecordReference: only consider monetary transactions\n            corresponding to a specific order (identified with a Selling Manager\n            order identifier). Below is the proper syntax to use if filtering by\n            a specific Selling Manager Sales Record ID:\n            https://apiz.ebay.com/sell/finances/v1/transaction_summary?filter=salesRecordReference:{123}\n            Note: For all orders originating after February 1, 2020, a value of\n            0 will be returned in the salesRecordReference field. So, this\n            filter will only be useful to retrieve orders than occurred before\n            this date. payoutId: only consider monetary transactions related to\n            a specific seller payout (identified with a Payout ID). This value\n            is auto-generated by eBay once the seller payout is set to be\n            processed. Below is the proper syntax to use if filtering by a\n            specific Payout ID:\n            https://apiz.ebay.com/sell/finances/v1/transaction_summary?filter=payoutId:{5000106638}\n            transactionId: the unique identifier of a monetary transaction. For\n            a sales order, the orderId filter should be used instead. Only the\n            monetary transaction(s) associated with this transactionId value are\n            returned. Note: This filter cannot be used alone; the\n            transactionType must also be specified when filtering by transaction\n            ID. Below is the proper syntax to use if filtering by a specific\n            transaction ID:\n            https://apiz.ebay.com/sell/finances/v1/transaction_summary?filter=transactionId:{03-03620-33763}\u0026amp;filter=transactionType:{SALE}\n            orderId: the unique identifier of a sales order. For any other\n            monetary transaction, the transactionId filter should be used\n            instead. Only the monetary transaction(s) associated with this\n            orderId value are returned. Below is the proper syntax to use if\n            filtering by a specific order ID:\n            https://apiz.ebay.com/sell/finances/v1/transaction_summary?filter=orderId:{03-03620-33763}\n            For implementation help, refer to eBay API documentation at\n            https://developer.ebay.com/api-docs/sell/finances/types/cos:FilterField\n          required: false\n          schema:\n            type: string\n      responses:\n        '200':\n          description: Success\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/TransactionSummaryResponse'\n        '400':\n          description: Bad Request\n          x-response-codes:\n            errors:\n              '135006':\n                domain: API_FINANCES\n                category: REQUEST\n                description: The value of transaction type filter is invalid.\n              '135007':\n                domain: API_FINANCES\n                category: REQUEST\n                description: The value of transaction status filter is invalid.\n              '135008':\n                domain: API_FINANCES\n                category: REQUEST\n                description: The value of transaction date filter is invalid.\n              '135009':\n                domain: API_FINANCES\n                category: REQUEST\n                description: Transaction type filter is missing.\n              '135011':\n                domain: API_FINANCES\n                category: REQUEST\n                description: Transaction status filter is mandatory.\n        '500':\n          description: Internal Server Error\n          x-response-codes:\n            errors:\n              '135000':\n                domain: API_FINANCES\n                category: APPLICATION\n                description: \u003e-\n                  There was a problem with an eBay internal system or process.\n                  Contact eBay developer support for assistance.\n      security:\n        - api_auth:\n            - 'https://api.ebay.com/oauth/api_scope/sell.finances'\n  '/transfer/{transfer_Id}':\n    get:\n      tags:\n        - transfer\n      summary: \u003e-\n        This method retrieves detailed information regarding a TRANSFER\n        transaction type. A TRANSFER is a monetary transaction type that\n        involves a seller transferring money to eBay for reimbursement of one or\n        more charges. For example, when a seller reimburses eBay for a buyer\n        refund. If an ID is passed into the URI that is an identifier for\n        another transaction type, this call will return an http status code of\n        404 Not found.\n      operationId: getTransfer\n      parameters:\n        - name: transfer_Id\n          in: path\n          description: \u003e-\n            The unique identifier of the TRANSFER transaction type you wish to\n            retrieve.\n          required: true\n          schema:\n            type: string\n      responses:\n        '200':\n          description: Success.\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/Transfer'\n        '400':\n          description: Bad Request\n        '404':\n          description: Not found.\n          x-response-codes:\n            errors:\n              '135012':\n                domain: API_FINANCES\n                category: REQUEST\n                description: The transfer id was not found.\n        '500':\n          description: Internal Server Error\n          x-response-codes:\n            errors:\n              '135000':\n                domain: API_FINANCES\n                category: APPLICATION\n                description: \u003e-\n                  There was a problem with an eBay internal system or process.\n                  Contact eBay developer support for assistance.\n      security:\n        - api_auth:\n            - 'https://api.ebay.com/oauth/api_scope/sell.finances'\n  /seller_funds_summary:\n    get:\n      tags:\n        - seller_funds_summary\n      summary: \u003e-\n        This method retrieves all pending funds that have not yet been\n        distibuted through a seller payout. There are no input parameters for\n        this method. The response payload includes available funds, funds being\n        processed, funds on hold, and also an aggregate count of all three of\n        these categories. If there are no funds that are pending, on hold, or\n        being processed for the seller's account, no response payload is\n        returned, and an http status code of 204 - No Content is returned\n        instead.\n      operationId: getSellerFundsSummary\n      responses:\n        '200':\n          description: Success\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/SellerFundsSummaryResponse'\n        '204':\n          description: No Content\n        '500':\n          description: Internal Server Error\n          x-response-codes:\n            errors:\n              '135000':\n                domain: API_FINANCES\n                category: APPLICATION\n                description: \u003e-\n                  There was a problem with an eBay internal system or process.\n                  Contact eBay developer support for assistance.\n      security:\n        - api_auth:\n            - 'https://api.ebay.com/oauth/api_scope/sell.finances'\ncomponents:\n  schemas:\n    Amount:\n      type: object\n      properties:\n        currency:\n          type: string\n          description: \u003e-\n            A three-letter ISO 4217 code that indicates the currency of the\n            amount in the value field. This field is always returned with any\n            container using Amount type. Default: The currency of the\n            authenticated user's country. For implementation help, refer to \u003ca\n            href='https://developer.ebay.com/api-docs/sell/finances/types/ba:CurrencyCodeEnum'\u003eeBay\n            API documentation\u003c/a\u003e\n        convertedFromCurrency:\n          type: string\n          description: \u003e-\n            The three-letter ISO 4217 code representing the currency of the\n            amount in the convertedFromValue field. This value is the\n            pre-conversion currency. This field is only returned if/when\n            currency conversion was applied by eBay. For implementation help,\n            refer to \u003ca\n            href='https://developer.ebay.com/api-docs/sell/finances/types/ba:CurrencyCodeEnum'\u003eeBay\n            API documentation\u003c/a\u003e\n        convertedFromValue:\n          type: string\n          description: \u003e-\n            The monetary amount before any conversion is performed, in the\n            currency specified by the convertedFromCurrency field. This value is\n            the pre-conversion amount. The value field contains the converted\n            amount of this value, in the currency specified by the currency\n            field. This field is only returned if/when currency conversion was\n            applied by eBay.\n        exchangeRate:\n          type: string\n          description: \u003e-\n            The exchange rate used for the monetary conversion. This field shows\n            the exchange rate used to convert the dollar value in the value\n            field from the dollar value in the convertedFromValue field. This\n            field is only returned when eBay does a currency version, and a\n            currency conversion is generally needed if the buyer is viewing, or\n            has purchased an item on an international site. This field is only\n            returned if/when currency conversion was applied by eBay.\n        value:\n          type: string\n          description: \u003e-\n            The monetary amount, in the currency specified by the currency\n            field. This field is always returned with any container using Amount\n            type.\n      description: \u003e-\n        This type is used to express the dollar value and currency used for any\n        transaction retrieved with the Finances API, including an order total, a\n        seller payout, a buyer refund, or a seller credit.\n    BalanceAdjustment:\n      type: object\n      properties:\n        adjustmentAmount:\n          description: \u003e-\n            The seller payout balance amount that will be applied toward the\n            charges outlined in the charges array.\n          $ref: '#/components/schemas/Amount'\n        adjustmentType:\n          type: string\n          description: \u003e-\n            The enumeration value returned here indicates if the charge is a\n            DEBIT or a CREDIT to the seller. Generally, all transfer transaction\n            types are going to be DEBIT, since the money is being tranferred\n            from the seller to eBay. For implementation help, refer to \u003ca\n            href='https://developer.ebay.com/api-docs/sell/finances/types/pay:BookingEntryEnum'\u003eeBay\n            API documentation\u003c/a\u003e\n      description: \u003e-\n        This type is used by the balanceAdjustment container, which shows the\n        seller payout balance that will be applied toward the charges outlined\n        in the charges array.\n    Buyer:\n      type: object\n      properties:\n        username:\n          type: string\n          description: The eBay user ID of the order's buyer.\n      description: \u003e-\n        This type is used to express details about the buyer associated with an\n        order. At this time, the only field in this type is the eBay user ID of\n        the buyer, but more fields may get added at a later date.\n    Charge:\n      type: object\n      properties:\n        cancellationId:\n          type: string\n          description: \u003e-\n            The unique identifier of an order cancellation. This field is only\n            applicable and returned if the charge is related to an order\n            cancellation.\n        caseId:\n          type: string\n          description: \u003e-\n            The unique identifier of a case filed against an order. This field\n            is only applicable and returned if the charge is related to a case\n            filed against an order.\n        chargeNetAmount:\n          description: \u003e-\n            This container shows the net amount of the charge, which is the\n            total amount of the charge minus the total amount of fees credited\n            towards this refund as per eBay policy. It is possible for there to\n            be multiple charges from multiple orders with one transfer. The net\n            aggregate amount for all charges found in the charges array can be\n            found in the transferDetail.totalChargeNetAmount container.\n          $ref: '#/components/schemas/Amount'\n        inquiryId:\n          type: string\n          description: \u003e-\n            The unique identifier of an Item Not Received (INR) inquiry filed\n            against an order. This field is only applicable and returned if the\n            charge is related to has an INR inquiry filed against the order.\n        orderId:\n          type: string\n          description: \u003e-\n            The unique identifier of the order that is associated with the\n            charge.\n        paymentDisputeId:\n          type: string\n          description: \u003e-\n            The unique identifier of a third-party payment dispute filed against\n            an order. This occurs when the buyer files a dispute against the\n            order with their payment provider, and then the dispute comes into\n            eBay's system. This field is only applicable and returned if the\n            charge is related to a third-party payment dispute filed against an\n            order.\n        refundId:\n          type: string\n          description: The unique identifier of a buyer refund associated with the charge.\n        returnId:\n          type: string\n          description: \u003e-\n            The unique identifier of an order return. This field is only\n            applicable and returned if the charge is related to an order that\n            was returned by the buyer.\n      description: \u003e-\n        This type is used by the charge container, which is an array of one or\n        more charges related to the transfer.\n    Error:\n      type: object\n      properties:\n        category:\n          type: string\n          description: Identifies the type of erro.\n        domain:\n          type: string\n          description: \u003e-\n            Name for the primary system where the error occurred. This is\n            relevant for application errors.\n        errorId:\n          type: integer\n          description: A unique number to identify the error.\n          format: int32\n        inputRefIds:\n          type: array\n          description: An array of request elements most closely associated to the error.\n          items:\n            type: string\n        longMessage:\n          type: string\n          description: A more detailed explanation of the error.\n        message:\n          type: string\n          description: \u003e-\n            Information on how to correct the problem, in the end user's terms\n            and language where applicable.\n        outputRefIds:\n          type: array\n          description: An array of request elements most closely associated to the error.\n          items:\n            type: string\n        parameters:\n          type: array\n          description: \u003e-\n            An array of name/value pairs that describe details the error\n            condition. These are useful when multiple errors are returned.\n          items:\n            $ref: '#/components/schemas/ErrorParameter'\n        subdomain:\n          type: string\n          description: \u003e-\n            Further helps indicate which subsystem the error is coming from.\n            System subcategories include: Initialization, Serialization,\n            Security, Monitoring, Rate Limiting, etc.\n      description: This type defines the fields that can be returned in an error.\n    ErrorParameter:\n      type: object\n      properties:\n        name:\n          type: string\n          description: The object of the error.\n        value:\n          type: string\n          description: The value of the object.\n    Fee:\n      type: object\n      properties:\n        amount:\n          description: The amount of the fee.\n          $ref: '#/components/schemas/Amount'\n        feeMemo:\n          type: string\n          description: A description of the fee that was deducted from the seller payout.\n        feeType:\n          type: string\n          description: \u003e-\n            The enumeration value returned here indicates the type of fee that\n            was deducted from the seller payout. For implementation help, refer\n            to \u003ca\n            href='https://developer.ebay.com/api-docs/sell/finances/types/api:FeeTypeEnum'\u003eeBay\n            API documentation\u003c/a\u003e\n      description: \u003e-\n        This type is used to display fees that are automatically deducted from\n        seller payouts.\n    FundingSource:\n      type: object\n      properties:\n        brand:\n          type: string\n          description: \u003e-\n            The brand name of the credit card or the name of the financial\n            institution that is the source of payment. This field may not be\n            populated for other funding sources.\n        memo:\n          type: string\n          description: \u003e-\n            This field provides a note about the funding source. If the seller's\n            credit card or bank account is the funding source, this field might\n            contain the last four digits of the credit card or bank account.\n            This field may also be returned as null.\n        type:\n          type: string\n          description: \u003e-\n            The string value returned here indicates the funding source.\n            Possible values include the following: AVAILABLE_FUNDS: transfer is\n            funded with seller payout funds CREDIT_CARD: transfer is funded with\n            seller's credit card BANK: transfer is funded with a direct debit to\n            seller's bank account on file with eBay PAY_UPON_INVOICE: eBay will\n            bill the seller for the transfer on the monthly invoice\n      description: This type provided details on the funding source for the transfer.\n    OrderLineItem:\n      type: object\n      properties:\n        feeBasisAmount:\n          description: \u003e-\n            This is the total amount of fees accrued for the order line item and\n            deducted from a seller payout. All of the fees under the\n            marketplaceFees container should equal this amount.\n          $ref: '#/components/schemas/Amount'\n        lineItemId:\n          type: string\n          description: The unique identifier of an order line item.\n        marketplaceFees:\n          type: array\n          description: \u003e-\n            An array of all fees accrued for the order line item and deducted\n            from a seller payout.\n          items:\n            $ref: '#/components/schemas/Fee'\n      description: \u003e-\n        This type is used to show the fees that are deducted from a seller\n        payout for each line item in an order.\n    Payout:\n      type: object\n      properties:\n        amount:\n          description: \u003e-\n            This the total amount of the seller payout. The container shows the\n            dollar amount of the payout and the currency used. The value of the\n            payout is always shown, even if the payout has failed.\n          $ref: '#/components/schemas/Amount'\n        bankReference:\n          type: string\n          description: \u003e-\n            This field contains additional information provided by the bank and\n            passed on by the payment processor; e.g., the manner in which the\n            transaction will appear on the seller's bank statement. The field is\n            returned only when provided by the bank and processor.\n        lastAttemptedPayoutDate:\n          type: string\n          description: \u003e-\n            This timestamp indicates the date/time when eBay last attempted to\n            process a seller payout but it failed. This field is only returned\n            if a seller payout fails, and the payoutStatus value shows\n            RETRYABLE_FAILED or TERMINAL_FAILED. A seller can filter on the\n            lastAttemptedPayoutDate in a getPayouts request.\n        payoutDate:\n          type: string\n          description: \u003e-\n            This timestamp indicates when the seller payout began processing.\n            The following format is used: YYYY-MM-DDTHH:MM:SS.SSSZ. For example,\n            2015-08-04T19:09:02.768Z. This field is still returned even if the\n            payout was pending but failed (payoutStatus value shows\n            RETRYABLE_FAILED or TERMINAL_FAILED).\n        payoutId:\n          type: string\n          description: \u003e-\n            The unique identifier of the seller payout. This identifier is\n            generated once eBay begins processing the payout to the seller's\n            bank account.\n        payoutMemo:\n          type: string\n          description: \u003e-\n            This field contains information provided by upstream components,\n            based on internal and external commitments. A typical message would\n            contain the expected arrival time of the payout.\n        payoutInstrument:\n          description: \u003e-\n            This container provides details about the seller's account that\n            received (or is scheduled to receive) the payout. This container is\n            still returned even if the payout failed.\n          $ref: '#/components/schemas/PayoutInstrument'\n        payoutStatus:\n          type: string\n          description: \u003e-\n            This enumeration value indicates the current status of the seller\n            payout. For a successful payout, the value returned will be\n            SUCCEEDED. See the PayoutStatusEnum type for more details on each\n            payout status value. For implementation help, refer to \u003ca\n            href='https://developer.ebay.com/api-docs/sell/finances/types/pay:PayoutStatusEnum'\u003eeBay\n            API documentation\u003c/a\u003e\n        payoutStatusDescription:\n          type: string\n          description: \u003e-\n            This field provides more details about the current status of payout.\n            The description returned here will correspond with enumeration value\n            returned in the payoutStatus field. The following shows what\n            description text might appear based on the different payoutStatus\n            values: INITIATED: Preparing to send SUCCEEDED: Funds sent REVERSED:\n            Waiting to retry : Money rejected by seller's bank RETRYABLE_FAILED:\n            Waiting to retry TERMINAL_FAILED: Payout failed\n        transactionCount:\n          type: integer\n          description: \u003e-\n            This integer value indicates the number of monetary transactions\n            (all orders, refunds, and credits, etc.) that have occurred with the\n            corresponding payout. Its value should always be at least 1, since\n            there is at least one order per seller payout.\n          format: int32\n      description: \u003e-\n        This type is used to express the details of one seller payout that is\n        returned with the getPayout or getPayouts methods.\n    PayoutInstrument:\n      type: object\n      properties:\n        accountLastFourDigits:\n          type: string\n          description: \u003e-\n            This string value is the last four digits of the seller's account\n            number.\n        instrumentType:\n          type: string\n          description: \u003e-\n            This string value indicates the type of account that received the\n            payout. At this time, seller payouts can only be distributed to bank\n            acounts, so the string value returned in this field will always be\n            BankAccount.\n        nickname:\n          type: string\n          description: \u003e-\n            This string value is a seller-provided nickname that the seller uses\n            to represent the bank account.\n      description: \u003e-\n        This type provides details about the seller's account that received (or\n        is scheduled to receive) a payout.\n    PayoutSummaryResponse:\n      type: object\n      properties:\n        amount:\n          description: \u003e-\n            This container shows the total value (and currency type used) of the\n            seller payouts that match the input criteria. This field is not\n            returned if there are no payouts that match the input criteria.\n          $ref: '#/components/schemas/Amount'\n        payoutCount:\n          type: integer\n          description: \u003e-\n            This integer value indicates the total count of payouts to the\n            seller that match the input criteria. This field is always returned,\n            even if there are no payouts that match the input criteria (its\n            value will show 0).\n          format: int32\n        transactionCount:\n          type: integer\n          description: \u003e-\n            This integer value indicates the total count of monetary\n            transactions (order payments, buyer refunds, and seller credits)\n            associated with the payouts that match the input criteria. This\n            field is always returned, even if there are no payouts that match\n            the input criteria (its value will show 0). If there is at least one\n            payout that matches the input criteria, the value in this field will\n            be at least 1.\n          format: int32\n      description: \u003e-\n        This type is the base response type of the getPayoutSummary method, and\n        contains the total count of seller payouts (that match the input\n        criteria), the total count of monetary transactions (order payment,\n        buyer refunds, or seller credits) associated with those payouts, and the\n        total value of those seller payouts.\n    Payouts:\n      type: object\n      properties:\n        href:\n          type: string\n          description: \u003e-\n            The URI of the getPayouts call request that produced the current\n            page of the result set.\n        limit:\n          type: integer\n          description: \u003e-\n            The maximum number of payouts that may be returned per page of the\n            result set. The limit value can be passed in as a query parameter,\n            or if omitted, its value defaults to 20. Note: If this is the last\n            or only page of the result set, the page may contain fewer payouts\n            than the limit value. To determine the number of pages in a result\n            set, divide the total value (total number of payouts matching input\n            criteria) by this limit value, and then round up to the next\n            integer. For example, if the total value was 120 (120 total payouts)\n            and the limit value was 50 (show 50 payouts per page), the total\n            number of pages in the result set is three, so the seller would have\n            to make three separate getPayouts calls to view all payouts matching\n            the input criteria. Maximum: 200 Default: 20\n          format: int32\n        next:\n          type: string\n          description: \u003e-\n            The getPayouts call URI to use if you wish to view the next page of\n            the result set. This field is only returned if there is a next page\n            of results to view based on the current input criteria.\n        offset:\n          type: integer\n          description: \u003e-\n            This integer value indicates the actual position that the first\n            payout returned on the current page has in the results set. So, if\n            you wanted to view the 11th payout of the result set, you would set\n            the offset value in the request to 10. In the request, you can use\n            the offset parameter in conjunction with the limit parameter to\n            control the pagination of the output. For example, if offset is set\n            to 30 and limit is set to 10, the call retrieves payouts 31 thru 40\n            from the resulting collection of payouts. Note: This feature employs\n            a zero-based list, where the first item in the list has an offset of\n            0. Default: 0 (zero)\n          format: int32\n        payouts:\n          type: array\n          description: \u003e-\n            An array of one or more payouts that match the input criteria.\n            Details for each payout include the unique identifier of the payout,\n            the status of the payout, the amount of the payout, and the number\n            of monetary transactions associated with the payout.\n          items:\n            $ref: '#/components/schemas/Payout'\n        prev:\n          type: string\n          description: \u003e-\n            The getPayouts call URI to use if you wish to view the previous page\n            of the result set. This field is only returned if there is a\n            previous page of results to view based on the current input\n            criteria.\n        total:\n          type: integer\n          description: \u003e-\n            This integer value is the total number of payouts in the results set\n            based on the current input criteria. Based on the total number of\n            payouts that match the criteria, and on the limit and offset values,\n            there may be additional pages in the results set.\n          format: int32\n      description: \u003e-\n        This type is the base response type of the getPayouts method, and\n        contains an array of one or more payouts (that match the input\n        criteria), the total count of payouts in the response, and various\n        pagination data for the results set.\n    Reference:\n      type: object\n      properties:\n        referenceId:\n          type: string\n          description: \u003e-\n            The identifier of the transaction as specified by the referenceType.\n            For example, with a referenceType of item_id, the referenceId refers\n            to a unique item. This item may have several NON_SALE_CHARGE\n            transactions.\n        referenceType:\n          type: string\n          description: \u003e-\n            An enumeration value that identifies the reference type associated\n            with the referenceId. For implementation help, refer to \u003ca\n            href='https://developer.ebay.com/api-docs/sell/finances/types/pay:ReferenceTypeEnum'\u003eeBay\n            API documentation\u003c/a\u003e\n      description: \u003e-\n        This field is returned for NON_SALE_CHARGE transactions that contain\n        non-transactional seller fees.\n    SellerFundsSummaryResponse:\n      type: object\n      properties:\n        availableFunds:\n          description: \u003e-\n            The dollar value in this field represents the total amount of order\n            funds that are available for a payout, but processing for a seller\n            payout has not yet begun. If a seller wants to get more details on\n            sales transactions that have yet to be processed, the seller can use\n            the getTransactions method, and use the transactionStatus filter\n            with its value set to FUNDS_AVAILABLE_FOR_PAYOUT. This container is\n            not returned if there are no funds available to be processed for a\n            payout.\n          $ref: '#/components/schemas/Amount'\n        fundsOnHold:\n          description: \u003e-\n            The dollar value in this field represents the total amount of order\n            funds on hold. Seller payment holds can occur for different reasons.\n            If a seller wants to get more details on sales transactions where\n            funds are currently on hold, the seller can use the getTransactions\n            method, and use the transactionStatus filter with its value set to\n            FUNDS_ON_HOLD. This container is not returned if there are no seller\n            payment holds that will eventually be processed for a payout.\n          $ref: '#/components/schemas/Amount'\n        processingFunds:\n          description: \u003e-\n            The dollar value in this field represents the total amount of order\n            funds being prepared and processed for a seller payout. If a seller\n            wants to get more details on sales transactions that are being\n            processed, the seller can use the getTransactions method, and use\n            the transactionStatus filter with its value set to FUNDS_PROCESSING.\n            This container is not returned if there are no funds being processed\n            for a payout.\n          $ref: '#/components/schemas/Amount'\n        totalFunds:\n          description: \u003e-\n            The dollar value in this field represents the total amount of order\n            funds still due to be distributed to the seller through a seller\n            payout. The dollar value in this field should equal the amounts\n            found in the three other containers. If there are no pending funds\n            due to the seller through a payout, this container is not returned,\n            and there will not be any response payload at all. Instead, an http\n            status code of 204 - No Content is returned\n          $ref: '#/components/schemas/Amount'\n      description: \u003e-\n        This type is used by the response payload of the getSellerFundsSummary\n        method. All of the funds returned in getSellerFundsSummary are funds\n        that have not yet been paid to the seller through a seller payout. If\n        there are no funds that are pending, on hold, or being processed for the\n        seller's account, no response payload is returned, and an http status\n        code of 204 - No Content is returned instead.\n    Transaction:\n      type: object\n      properties:\n        amount:\n          description: \u003e-\n            This container shows the dollar value and currency type of the\n            monetary transaction. This field is always returned even when eBay\n            has yet to initiate a payout for the order.\n          $ref: '#/components/schemas/Amount'\n        bookingEntry:\n          type: string\n          description: \u003e-\n            The enumeration value returned in this field indicates if the\n            monetary transaction amount is a (CREDIT) or a (DEBIT) to the\n            seller's account. Typically, the SALE and CREDIT transaction types\n            are credits to the seller's account, and the REFUND, DISPUTE,\n            SHIPPING_LABEL, and TRANSFER transaction types are debits to the\n            seller's account. For implementation help, refer to \u003ca\n            href='https://developer.ebay.com/api-docs/sell/finances/types/pay:BookingEntryEnum'\u003eeBay\n            API documentation\u003c/a\u003e\n        buyer:\n          description: \u003e-\n            This is the unique eBay user ID for the buyer who purchased the\n            order. This field is not returned for TRANSFER monetary transaction\n            types.\n          $ref: '#/components/schemas/Buyer'\n        feeType:\n          type: string\n          description: \u003e-\n            The type of fee. For implementation help, refer to \u003ca\n            href='https://developer.ebay.com/api-docs/sell/finances/types/api:FeeTypeEnum'\u003eeBay\n            API documentation\u003c/a\u003e\n        orderId:\n          type: string\n          description: \u003e-\n            The unique identifier of the eBay order associated with the monetary\n            transaction.\n        orderLineItems:\n          type: array\n          description: \u003e-\n            This array shows the fees that are deducted from a seller payout for\n            each line item in an order.\n          items:\n            $ref: '#/components/schemas/OrderLineItem'\n        paymentsEntity:\n          type: string\n          description: \u003e-\n            This string value indicates the entity that is processing the\n            payment.\n        payoutId:\n          type: string\n          description: \u003e-\n            The unique identifier of the seller payout associated with the\n            monetary transaction. This identifier is generated once eBay begins\n            processing the payout for the corresponding order. This field will\n            not be returned if eBay has not yet begun processing the payout for\n            an order.\n        references:\n          type: array\n          description: \u003e-\n            This field contains reference information for the transaction fee.\n            This includes an ID and the type of ID provided (such as item ID).\n          items:\n            $ref: '#/components/schemas/Reference'\n        salesRecordReference:\n          type: string\n          description: \u003e-\n            The Sales Record Number associated with a sales order. Sales Record\n            Numbers are Selling Manager/Selling Manager Pro identifiers that are\n            created at order checkout. Note: For all orders originating after\n            February 1, 2020, a value of 0 will be returned in this field. The\n            Sales Record Number field has also been removed from Seller Hub.\n            Instead of salesRecordReference, depend on orderId instead as the\n            identifier of the order. The salesRecordReference field has been\n            scheduled for deprecation, and a date for when this field will no\n            longer be returned at all will be announced soon.\n        totalFeeBasisAmount:\n          description: \u003e-\n            This amount is the total amount of the order before selling fees are\n            deducted from the seller payout associated with the order. To\n            determine the actual amount of the order that will be paid out\n            through a seller payout, deduct the totalFeeAmount from the\n            basePayoutAmount.\n          $ref: '#/components/schemas/Amount'\n        totalFeeAmount:\n          description: \u003e-\n            This amount is the total amount of selling fees paid for order. A\n            breakdown of fees for each order line item can be found in the\n            orderLineItems array. This field is even returned if it is 0.0 (no\n            fees deducted from seller payout).\n          $ref: '#/components/schemas/Amount'\n        transactionDate:\n          type: string\n          description: \u003e-\n            This timestamp indicates when the monetary transaction (order\n            purchase, buyer refund, seller credit) occurred. The following (UTC)\n            format is used: YYYY-MM-DDTHH:MM:SS.SSSZ. For example,\n            2015-08-04T19:09:02.768Z.\n        transactionId:\n          type: string\n          description: \u003e-\n            The unique identifier of the monetary transaction. A monetary\n            transaction can be a sales order, an order refund to the buyer, a\n            credit to the seller's account, a debit to the seller for the\n            purchase of a shipping label, or a transaction where eBay recouped\n            money from the seller if the seller lost a buyer-initiated payment\n            dispute.\n        transactionMemo:\n          type: string\n          description: \u003e-\n            This field provides more details on shipping label transactions and\n            transactions where the funds are being held by eBay. For shipping\n            label transactions, the transactionMemo gives details about a\n            purchase, a refund, or a price adjustment to the cost of the\n            shipping label. For on-hold transactions, the transactionMemo\n            provides information on the reason for the hold or when the hold\n            will be released (e.g., \u0026quot;Funds on hold. Estimated release on\n            Jun 1\u0026quot;). This field is only returned if applicable/available.\n        transactionStatus:\n          type: string\n          description: \u003e-\n            This enumeration value indicates the current status of the seller\n            payout associated with the monetary transaction. See the\n            TransactionStatusEnum type for more information on the different\n            states. For implementation help, refer to \u003ca\n            href='https://developer.ebay.com/api-docs/sell/finances/types/pay:TransactionStatusEnum'\u003eeBay\n            API documentation\u003c/a\u003e\n        transactionType:\n          type: string\n          description: \u003e-\n            This enumeration value indicates whether the monetary transaction is\n            a buyer's payment for an order, a refund to the buyer for a returned\n            item or cancelled order, a credit issued by eBay to the seller's\n            account, a payment dispute between the buyer and seller, or where\n            eBay is billing the seller for an eBay shipping label or another\n            charge (such as a refund to a buyer). Note that the shipping label\n            functionality will initially only be available to a select number of\n            sellers. For implementation help, refer to \u003ca\n            href='https://developer.ebay.com/api-docs/sell/finances/types/pay:TransactionTypeEnum'\u003eeBay\n            API documentation\u003c/a\u003e\n      description: \u003e-\n        This type is used to express the details of one of the following\n        monetary transactions: a buyer's payment for an order, a refund to the\n        buyer for a returned item or cancelled order, or a credit issued by eBay\n        to the seller's account.\n    TransactionSummaryResponse:\n      type: object\n      properties:\n        adjustmentAmount:\n          description: Total adjustment amount for given payee within a specified period.\n          $ref: '#/components/schemas/Amount'\n        adjustmentBookingEntry:\n          type: string\n          description: \u003e-\n            The credit debit sign indicator for adjustment. For implementation\n            help, refer to \u003ca\n            href='https://developer.ebay.com/api-docs/sell/finances/types/pay:BookingEntryEnum'\u003eeBay\n            API documentation\u003c/a\u003e\n        adjustmentCount:\n          type: integer\n          description: Total adjustment count for given payee within a specified period.\n          format: int32\n        balanceTransferAmount:\n          description: \u003e-\n            The total balance transfer amount for given payee within the\n            specified period.\n          $ref: '#/components/schemas/Amount'\n        balanceTransferBookingEntry:\n          type: string\n          description: \u003e-\n            The credit debit sign indicator for the balance transfer. For\n            implementation help, refer to \u003ca\n            href='https://developer.ebay.com/api-docs/sell/finances/types/pay:BookingEntryEnum'\u003eeBay\n            API documentation\u003c/a\u003e\n        balanceTransferCount:\n          type: integer\n          description: \u003e-\n            The total balance transfer count for given payee within the\n            specified period.\n          format: int32\n        creditAmount:\n          description: \u003e-\n            This amount is the total dollar value of all the seller's sales\n            and/or credits that match the input criteria. Note: Unless the\n            transactionType filter is used in the request to retrieve a specific\n            type of monetary transaction, the creditCount and creditAmount\n            fields account for both order sales and seller credits (the count\n            and value is not distinguished between the two monetary transaction\n            types). If there are no sales/credits (creditCount=0), this\n            container is not returned.\n          $ref: '#/components/schemas/Amount'\n        creditBookingEntry:\n          type: string\n          description: \u003e-\n            The enumeration value indicates whether the dollar amount in the\n            creditAmount field is a charge (debit) to the seller or a credit.\n            Typically, the enumeration value returned here will be CREDIT. For\n            implementation help, refer to \u003ca\n            href='https://developer.ebay.com/api-docs/sell/finances/types/pay:BookingEntryEnum'\u003eeBay\n            API documentation\u003c/a\u003e\n        creditCount:\n          type: integer\n          description: \u003e-\n            This integer value indicates the total number of the seller's sales\n            and/or credits that match the input criteria. Note: Unless the\n            transactionType filter is used in the request to retrieve a specific\n            type of monetary transaction (sale, buyer refund, or seller credit),\n            the creditCount and creditAmount fields account for both order sales\n            and seller credits (the count and value is not distinguished between\n            the two monetary transaction types). This field is generally\n            returned, even if 0, but it will not be returned if a\n            transactionType filter is used, and its value is set to either\n            REFUND, DISPUTE, or SHIPPING_LABEL.\n          format: int32\n        disputeAmount:\n          description: \u003e-\n            This amount is the total dollar value associated with any existing\n            payment disputes that have been initiated by one or more buyers.\n            Only the orders that match the input criteria are considered. The\n            Payment Disputes methods in the Fulfillment API can be used by the\n            seller to retrieve more information about any payment disputes. If\n            there are no payment disputes (disputeCount=0), this container is\n            not returned.\n          $ref: '#/components/schemas/Amount'\n        disputeBookingEntry:\n          type: string\n          description: \u003e-\n            The enumeration value indicates whether the dollar amount in the\n            disputeAmount field is a charge (debit) to the seller or a credit.\n            Typically, the enumeration value returned here will be DEBIT, but\n            its possible that CREDIT could be returned if the seller contested\n            one or more payment disputes and won the dispute. For implementation\n            help, refer to \u003ca\n            href='https://developer.ebay.com/api-docs/sell/finances/types/pay:BookingEntryEnum'\u003eeBay\n            API documentation\u003c/a\u003e\n        disputeCount:\n          type: integer\n          description: \u003e-\n            This integer value indicates the total number of payment disputes\n            that have been initiated by one or more buyers. Only the orders that\n            match the input criteria are considered. The Payment Disputes\n            methods in the Fulfillment API can be used by the seller to retrieve\n            more information about any payment disputes. This field is generally\n            returned, even if 0, but it will not be returned if a\n            transactionType filter is used, and its value is set to any value\n            other than DISPUTE.\n          format: int32\n        nonSaleChargeAmount:\n          description: \u003e-\n            The total non-sale charge amount for given payee within a specified\n            period.\n          $ref: '#/components/schemas/Amount'\n        nonSaleChargeBookingEntry:\n          type: string\n          description: \u003e-\n            The credit/debit sign indicator for the non-sale charge. For\n            implementation help, refer to \u003ca\n            href='https://developer.ebay.com/api-docs/sell/finances/types/pay:BookingEntryEnum'\u003eeBay\n            API documentation\u003c/a\u003e\n        nonSaleChargeCount:\n          type: integer\n          description: \u003e-\n            The total non-sale charge count for given payee within a specified\n            period.\n          format: int32\n        onHoldAmount:\n          description: \u003e-\n            This amount is the total dollar value of order sales where the\n            associated funds are on hold. Only the orders that match the input\n            criteria are considered. If there are no seller payment holds\n            (onHoldCount=0), this container is not returned.\n          $ref: '#/components/schemas/Amount'\n        onHoldBookingEntry:\n          type: string\n          description: \u003e-\n            The enumeration value indicates whether the dollar amount in the\n            onHoldAmount field is a charge (debit) to the seller or a credit.\n            Typically, the enumeration value returned here will be CREDIT, since\n            on-hold funds should eventually be released as part of a payout to\n            the seller once the hold is cleared. For implementation help, refer\n            to \u003ca\n            href='https://developer.ebay.com/api-docs/sell/finances/types/pay:BookingEntryEnum'\u003eeBay\n            API documentation\u003c/a\u003e\n        onHoldCount:\n          type: integer\n          description: \u003e-\n            This integer value indicates the total number of order sales where\n            the associated funds are on hold. Only the orders that match the\n            input criteria are considered. This field is generally returned,\n            even if 0, but it will not be returned if a transactionStatus filter\n            is used, and its value is set to any value other than FUNDS_ON_HOLD.\n          format: int32\n        refundAmount:\n          description: \u003e-\n            This amount is the total dollar value of buyer refunds that match\n            the input criteria. If there are no refunds (refundCount=0), this\n            container is not returned.\n          $ref: '#/components/schemas/Amount'\n        refundBookingEntry:\n          type: string\n          description: \u003e-\n            The enumeration value indicates whether the dollar amount in the\n            refundAmount field is a charge (debit) to the seller or a credit.\n            Typically, the enumeration value returned here will be DEBIT since\n            this a refund from the seller to the buyer. For implementation help,\n            refer to \u003ca\n            href='https://developer.ebay.com/api-docs/sell/finances/types/pay:BookingEntryEnum'\u003eeBay\n            API documentation\u003c/a\u003e\n        refundCount:\n          type: integer\n          description: \u003e-\n            This integer value indicates the total number of buyer refunds that\n            match the input criteria. This field is generally returned, even if\n            0, but it will not be returned if a transactionType filter is used,\n            and its value is set to any value other than REFUND.\n          format: int32\n        shippingLabelAmount:\n          description: \u003e-\n            This is the total dollar value of the eBay shipping labels purchased\n            by the seller.\n          $ref: '#/components/schemas/Amount'\n        shippingLabelBookingEntry:\n          type: string\n          description: \u003e-\n            The enumeration value indicates whether the dollar amount in the\n            shippingLabelAmount field is a charge (debit) to the seller or a\n            credit. Typically, the enumeration value returned here will be\n            DEBIT, as eBay will charge the seller when eBay shipping labels are\n            purchased, but it can be CREDIT if the seller was refunded for a\n            shipping label or was possibly overcharged for a shipping label. For\n            implementation help, refer to \u003ca\n            href='https://developer.ebay.com/api-docs/sell/finances/types/pay:BookingEntryEnum'\u003eeBay\n            API documentation\u003c/a\u003e\n        shippingLabelCount:\n          type: integer\n          description: \u003e-\n            This is the total number of eBay shipping labels purchased by the\n            seller. The count returned here may depend on the specified input\n            criteria.\n          format: int32\n        transferAmount:\n          description: \u003e-\n            This amount is the total dollar value of buyer refund transfers that\n            match the input criteria. If there are no transfers (refundCount=0),\n            this container is not returned.\n          $ref: '#/components/schemas/Amount'\n        transferBookingEntry:\n          type: string\n          description: \u003e-\n            The enumeration value indicates whether the dollar amount in the\n            transferAmount field is a charge (debit) to the seller or a credit.\n            Typically, the enumeration value returned here will be DEBIT since\n            this a seller reimbursement to eBay for buyer refunds. For\n            implementation help, refer to \u003ca\n            href='https://developer.ebay.com/api-docs/sell/finances/types/pay:BookingEntryEnum'\u003eeBay\n            API documentation\u003c/a\u003e\n        transferCount:\n          type: integer\n          description: \u003e-\n            This integer value indicates the total number of buyer refund\n            transfers that match the input criteria. This field is generally\n            returned, even if 0, but it will not be returned if a\n            transactionType filter is used, and its value is set to any value\n            other than TRANSFER.\n          format: int32\n      description: \u003e-\n        This type is the base response type of the getTransactionSummary method,\n        and based on the filters that are used in the getTransactionSummary call\n        URI, the response may include total count and amount of the seller's\n        sales and credits, total count and amount of buyer refunds, and total\n        count and amount of seller payment holds.\n    Transactions:\n      type: object\n      properties:\n        href:\n          type: string\n          description: \u003e-\n            The URI of the getTransactions method request that produced the\n            current page of the result set.\n        limit:\n          type: integer\n          description: \u003e-\n            The maximum number of monetary transactions that may be returned per\n            page of the result set. The limit value can be passed in as a query\n            parameter, or if omitted, its value defaults to 20. Note: If this is\n            the last or only page of the result set, the page may contain fewer\n            monetary transactions than the limit value. To determine the number\n            of pages in a result set, divide the total value (total number of\n            monetary transactions matching input criteria) by this limit value,\n            and then round up to the next integer. For example, if the total\n            value was 120 (120 total monetary transactions) and the limit value\n            was 50 (show 50 monetary transactions per page), the total number of\n            pages in the result set is three, so the seller would have to make\n            three separate getTransactions calls to view all monetary\n            transactions matching the input criteria. Maximum: 200 Default: 20\n          format: int32\n        next:\n          type: string\n          description: \u003e-\n            The getTransactions method URI to use if you wish to view the next\n            page of the result set. This field is only returned if there is a\n            next page of results to view based on the current input criteria.\n        offset:\n          type: integer\n          description: \u003e-\n            This integer value indicates the actual position that the first\n            monetary transaction returned on the current page has in the results\n            set. So, if you wanted to view the 11th monetary transaction of the\n            result set, you would set the offset value in the request to 10. In\n            the request, you can use the offset parameter in conjunction with\n            the limit parameter to control the pagination of the output. For\n            example, if offset is set to 30 and limit is set to 10, the method\n            retrieves monetary transactions 31 thru 40 from the resulting\n            collection of monetary transactions. Note: This feature employs a\n            zero-based list, where the first item in the list has an offset of\n            0. Default: 0 (zero)\n          format: int32\n        prev:\n          type: string\n          description: \u003e-\n            The getTransactions method URI to use if you wish to view the\n            previous page of the result set. This field is only returned if\n            there is a previous page of results to view based on the current\n            input criteria.\n        total:\n          type: integer\n          description: \u003e-\n            This integer value is the total amount of monetary transactions in\n            the result set based on the current input criteria. Based on the\n            total number of monetary transactions that match the criteria, and\n            on the limit and offset values, there may be additional pages in the\n            results set.\n          format: int32\n        transactions:\n          type: array\n          description: \u003e-\n            An array of one or more monetary transactions that match the input\n            criteria. Details for each monetary transaction may include the\n            unique identifier of the order associated with the monetary\n            transaction, the status of the transaction, the amount of the order,\n            the order's buyer, and the unique identifier of the payout (if a\n            payout has been initiated/issued for the order).\n          items:\n            $ref: '#/components/schemas/Transaction'\n      description: \u003e-\n        This is the base response type of the getTransactions method. The\n        getTransactions response includes details on one or more monetary\n        transactions that match the input criteria, as well as pagination data.\n    Transfer:\n      type: object\n      properties:\n        fundingSource:\n          description: \u003e-\n            This container provides details about the seller's funding source to\n            reimburse eBay for the transfer, such as a bank account, a credit\n            card, or available seller payout funds.\n          $ref: '#/components/schemas/FundingSource'\n        transactionDate:\n          type: string\n          description: \u003e-\n            This timestamp indicates the date/time of the transfer. The\n            following (UTC) format is used: YYYY-MM-DDTHH:MM:SS.SSSZ. For\n            example, 2020-08-04T19:09:02.768Z\n        transferAmount:\n          description: The amount of the transfer being deducted from the funding source.\n          $ref: '#/components/schemas/Amount'\n        transferDetail:\n          description: \u003e-\n            This container provides more details about the transfer, including\n            details on the charge(s) associated with the transfer. Multiple\n            charges can be addressed with one transfer.\n          $ref: '#/components/schemas/TransferDetail'\n        transferId:\n          type: string\n          description: \u003e-\n            The unique identifier of the TRANSFER transaction type. This is the\n            same value that was passed into the end of the call URI.\n      description: \u003e-\n        This type is the base response type used by TRANSFER transaction type\n        that is returned in the response.\n    TransferDetail:\n      type: object\n      properties:\n        balanceAdjustment:\n          description: \u003e-\n            This container shows the seller payout balance that will be applied\n            toward the charges outlined in the charges array.\n          $ref: '#/components/schemas/BalanceAdjustment'\n        charges:\n          type: array\n          description: \u003e-\n            This container is an array of one or more charges related to the\n            transfer. Charges can be related to an order cancellation, order\n            return, case, payment dispute, etc.\n          items:\n            $ref: '#/components/schemas/Charge'\n        totalChargeNetAmount:\n          description: \u003e-\n            This container shows the total amount that the seller owes for all\n            of the charges outlined in the charges array.\n          $ref: '#/components/schemas/Amount'\n      description: \u003e-\n        This type is used by the transferDetail container, which provides more\n        details about the transfer and the charge(s) associated with the\n        transfer.\n  securitySchemes:\n    api_auth:\n      type: oauth2\n      description: \u003e-\n        The security definitions for this API. Please check individual\n        operations for applicable scopes.\n      flows:\n        authorizationCode:\n          authorizationUrl: 'https://auth.ebay.com/oauth2/authorize'\n          tokenUrl: 'https://api.ebay.com/identity/v1/oauth2/token'\n          scopes:\n            'https://api.ebay.com/oauth/api_scope/sell.finances': \u003e-\n              View and manage your payment and order information to display this\n              information to you and allow you to initiate refunds using the\n              third party application\n",
			"canonicalURL": "/github.com/ballerina-platform/openapi-connectors@c3641dddbc4e41686ae3d1b9bacf1621b639a019/-/blob/openapi/ebay.finances/openapi.yml",
			"externalURLs": [
				{
					"url": "https://github.com/ballerina-platform/openapi-connectors/blob/c3641dddbc4e41686ae3d1b9bacf1621b639a019/openapi/ebay.finances/openapi.yml",
					"serviceKind": "GITHUB"
				}
			]
		}
	},
	"Error": "notImplemented: path \"/seller_funds_summary\": get: security: security \"api_auth\" (index 0): oauth2 security not implemented",
	"NotImplemented": [
		"oauth2 security"
	]
}