{
	"File": {
		"__typename": "FileMatch",
		"repository": {
			"name": "github.com/factset/enterprise-sdk"
		},
		"file": {
			"name": "openapi.yaml",
			"size": 0,
			"path": "code/java/AITextSummarization/v1/api/openapi.yaml",
			"byteSize": 15717,
			"content": "openapi: 3.0.1\ninfo:\n  description: AI Text Summarization\n  title: AI Text Summarization\n  version: 1.0.0\nservers:\n- url: //api.factset.com/cognitive/summarization/v1\nsecurity:\n- FactSetApiKey: []\n- FactSetOAuth2: []\ntags:\n- description: Default namespace\n  name: default\npaths:\n  /headline:\n    post:\n      description: Endpoint for initiating a processing job to create a headline from\n        input text.\n      operationId: post_headline_/v1/headline\n      requestBody:\n        content:\n          application/json:\n            schema:\n              $ref: '#/components/schemas/Request'\n        required: true\n      responses:\n        \"201\":\n          content:\n            application/json:\n              schema:\n                description: |-\n                  A unique string ID representing a processing job.\n\n                  The user can later use this ID to hit the '/result' endpoint to get the actual output.\n                type: string\n          description: Unique Result ID\n        \"400\":\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/BadRequestResponse'\n          description: Bad Request\n        \"401\":\n          content: {}\n          description: Access Denied\n        \"500\":\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/InternalServerErrorResponse'\n          description: Internal Server Error\n      summary: POST request to create a headline from input text\n      tags:\n      - default\n      x-codegen-request-body-name: payload\n      x-contentType: application/json\n      x-accepts: application/json\n  /headline-and-summary:\n    post:\n      description: Endpoint for initiating a processing job to create a 2-3 sentence\n        summary from input text.\n      operationId: post_headline_and_summary_/v1/headline-and-summary\n      requestBody:\n        content:\n          application/json:\n            schema:\n              $ref: '#/components/schemas/Request'\n        required: true\n      responses:\n        \"201\":\n          content:\n            application/json:\n              schema:\n                description: |-\n                  A unique string ID representing a processing job.\n\n                  The user can later use this ID to hit the '/result' endpoint to get the actual output.\n                type: string\n          description: Unique Result ID\n        \"400\":\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/BadRequestResponse'\n          description: Bad Request\n        \"401\":\n          content: {}\n          description: Access Denied\n        \"500\":\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/InternalServerErrorResponse'\n          description: Internal Server Error\n      summary: POST request to create a 2-3 sentence summary from input text\n      tags:\n      - default\n      x-codegen-request-body-name: payload\n      x-contentType: application/json\n      x-accepts: application/json\n  /result/{result_id}:\n    get:\n      description: Endpoint that returns the full headline and summary results from\n        the initial POST requests.\n      operationId: get_result_/v1/result/\u003cresult_id\u003e\n      parameters:\n      - in: path\n        name: result_id\n        required: true\n        schema:\n          type: string\n      responses:\n        \"200\":\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/SuccessResponse'\n          description: Success\n        \"202\":\n          content: {}\n          description: Processing\n        \"400\":\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/BadRequestResponse'\n          description: Bad Request\n        \"401\":\n          content: {}\n          description: Access Denied\n        \"404\":\n          content: {}\n          description: Invalid Result ID\n        \"500\":\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/InternalServerErrorResponse'\n          description: Internal Server Error\n      summary: GET request that returns the full headline and summary results from\n        the initial POST requests\n      tags:\n      - default\n      x-accepts: application/json\n  /summary:\n    post:\n      description: Endpoint for initiating a processing job to create a headline and\n        summary from input text.\n      operationId: post_summary_/v1/summary\n      requestBody:\n        content:\n          application/json:\n            schema:\n              $ref: '#/components/schemas/Request'\n        required: true\n      responses:\n        \"201\":\n          content:\n            application/json:\n              schema:\n                description: |-\n                  A unique string ID representing a processing job.\n\n                  The user can later use this ID to hit the '/result' endpoint to get the actual output.\n                type: string\n          description: Unique Result ID\n        \"400\":\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/BadRequestResponse'\n          description: Bad Request\n        \"401\":\n          content: {}\n          description: Access Denied\n        \"500\":\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/InternalServerErrorResponse'\n          description: Internal Server Error\n      summary: POST request to create a headline and summary from input text\n      tags:\n      - default\n      x-codegen-request-body-name: payload\n      x-contentType: application/json\n      x-accepts: application/json\ncomponents:\n  responses:\n    MaskError:\n      content: {}\n      description: When any error occurs on mask\n    ParseError:\n      content: {}\n      description: When a mask can't be parsed\n  schemas:\n    Request:\n      example:\n        text: 'Advanced Energy Transforms Indoor Farming With Intelligent New Lighting\n          Power and Control System Friday, December 11, 2020 01:00:00 PM (GMT)Innovative\n          technology breaks down barriers to indoor, vertical and greenhouse farming\n          by reducing power consumption, cutting costs and increasing crop yield Advanced\n          Energy (Nasdaq: AEIS) – a global leader in highly engineered, precision\n          power conversion, measurement, and control solutions – today unveiled its\n          newest lighting and power control system for indoor, vertical and greenhouse\n          farming. This press release features multimedia. Advanced Energy''s new\n          Artesyn iTS provides the industry''s first solution for switching or sharing\n          a single power source between two different rooms. This reduces installation\n          costs by cutting the number of iHP power supplies needed in half and it\n          substantially reduces ongoing utility costs. (Photo: Business Wire)AE''s\n          new lighting and power system transforms the use of LED technology in horticultural\n          lighting systems, which plays a fundamental role in cutting-edge farming\n          practices that can address production challenges in food, pharmaceutical\n          ingredients, plants and flowers. Utilizing AE''s system, customers reduce\n          their power conversion costs by as much as 50 percent, significantly lower\n          installation and operating costs, and increase the quality of crop yield.\n          \"Our groundbreaking lighting, power and control system delivers significant\n          improvements over conventional lighting solutions and opens up new opportunities\n          for the industry,\" said Joe Voyles, vice president, industrial marketing,\n          at Advanced Energy. \"We are transforming our customers'' operations by both\n          reducing the amount of needed equipment and improving the efficiency of\n          the lighting systems, thereby reducing cost and energy spend. Not only do\n          these innovative new products increase the efficiency and quality of fruit\n          and vegetable production, but they also open the door to establishing indoor\n          farming facilities in harsh environments anywhere in the world.\" The new\n          system consists of the patented Artesyn iTS (intelligent Transfer Switch)\n          and iHPS configurable power supply. Alongside Artesyn''s compact new 12\n          kW 300 VDC module, AE delivers a cost-effective platform for the most advanced\n          indoor farming applications. The system is estimated to produce a 38 percent\n          savings to lighting power and control installation cost, while eliminating\n          substantial amounts of wasted energy. The new iHPS is a \"short\" version\n          of AE''s market-leading iHP power supply. The shorter design allows for\n          more space within the lighting and power cabinet for other crucial components,\n          reduces the weight and cost, and increases the life of the system. The new\n          iTS provides the industry''s first solution for switching or sharing a single\n          power source between two different rooms. This reduces installation costs\n          by cutting the number of iHP power supplies needed in half and it substantially\n          reduces ongoing utility costs.'\n      properties:\n        text:\n          description: The text that needs to be summarized.\n          example: 'Advanced Energy Transforms Indoor Farming With Intelligent New\n            Lighting Power and Control System Friday, December 11, 2020 01:00:00 PM\n            (GMT)Innovative technology breaks down barriers to indoor, vertical and\n            greenhouse farming by reducing power consumption, cutting costs and increasing\n            crop yield Advanced Energy (Nasdaq: AEIS) – a global leader in highly\n            engineered, precision power conversion, measurement, and control solutions\n            – today unveiled its newest lighting and power control system for indoor,\n            vertical and greenhouse farming. This press release features multimedia.\n            Advanced Energy''s new Artesyn iTS provides the industry''s first solution\n            for switching or sharing a single power source between two different rooms.\n            This reduces installation costs by cutting the number of iHP power supplies\n            needed in half and it substantially reduces ongoing utility costs. (Photo:\n            Business Wire)AE''s new lighting and power system transforms the use of\n            LED technology in horticultural lighting systems, which plays a fundamental\n            role in cutting-edge farming practices that can address production challenges\n            in food, pharmaceutical ingredients, plants and flowers. Utilizing AE''s\n            system, customers reduce their power conversion costs by as much as 50\n            percent, significantly lower installation and operating costs, and increase\n            the quality of crop yield. \"Our groundbreaking lighting, power and control\n            system delivers significant improvements over conventional lighting solutions\n            and opens up new opportunities for the industry,\" said Joe Voyles, vice\n            president, industrial marketing, at Advanced Energy. \"We are transforming\n            our customers'' operations by both reducing the amount of needed equipment\n            and improving the efficiency of the lighting systems, thereby reducing\n            cost and energy spend. Not only do these innovative new products increase\n            the efficiency and quality of fruit and vegetable production, but they\n            also open the door to establishing indoor farming facilities in harsh\n            environments anywhere in the world.\" The new system consists of the patented\n            Artesyn iTS (intelligent Transfer Switch) and iHPS configurable power\n            supply. Alongside Artesyn''s compact new 12 kW 300 VDC module, AE delivers\n            a cost-effective platform for the most advanced indoor farming applications.\n            The system is estimated to produce a 38 percent savings to lighting power\n            and control installation cost, while eliminating substantial amounts of\n            wasted energy. The new iHPS is a \"short\" version of AE''s market-leading\n            iHP power supply. The shorter design allows for more space within the\n            lighting and power cabinet for other crucial components, reduces the weight\n            and cost, and increases the life of the system. The new iTS provides the\n            industry''s first solution for switching or sharing a single power source\n            between two different rooms. This reduces installation costs by cutting\n            the number of iHP power supplies needed in half and it substantially reduces\n            ongoing utility costs.'\n          type: string\n      required:\n      - text\n      type: object\n    InternalServerErrorResponse:\n      properties:\n        type:\n          description: Type of exception that occured.\n          type: string\n        status:\n          description: The route for which the exception occured.\n          type: string\n        message:\n          description: The verbose message for the exception.\n          type: string\n      type: object\n    BadRequestResponse:\n      properties:\n        errors:\n          description: Error message.\n          type: string\n        message:\n          description: The reason for the error.\n          type: string\n      type: object\n    SuccessResponse:\n      example:\n        summary: Advanced Energy unveiled its newest lighting and power control system\n          for indoor, vertical and greenhouse farming. The new system consists of\n          the patented Artesyn iTS (intelligent Transfer Switch) and iHPS power supply.\n          Alongside Artesyn's compact new 12 kW 300 VDC module, AE delivers a cost-effective\n          platform for the most advanced indoor farming applications. The system is\n          estimated to produce a 38 percent savings to lighting power and control\n          installation cost, while eliminating substantial amounts of wasted energy.\n        headline: Advanced Energy unveils new lighting and power control system for\n          indoor, vertical and greenhouse farming.\n      properties:\n        headline:\n          description: A short headline generated for the input text.\n          example: Advanced Energy unveils new lighting and power control system for\n            indoor, vertical and greenhouse farming.\n          type: string\n        summary:\n          description: The generated summary for the input text.\n          example: Advanced Energy unveiled its newest lighting and power control\n            system for indoor, vertical and greenhouse farming. The new system consists\n            of the patented Artesyn iTS (intelligent Transfer Switch) and iHPS power\n            supply. Alongside Artesyn's compact new 12 kW 300 VDC module, AE delivers\n            a cost-effective platform for the most advanced indoor farming applications.\n            The system is estimated to produce a 38 percent savings to lighting power\n            and control installation cost, while eliminating substantial amounts of\n            wasted energy.\n          type: string\n      type: object\n  securitySchemes:\n    FactSetApiKey:\n      scheme: basic\n      type: http\n    FactSetOAuth2:\n      flows:\n        clientCredentials:\n          scopes: {}\n          tokenUrl: https://auth.factset.com/as/token.oauth2\n      type: oauth2\nx-original-swagger-version: \"2.0\"\n\n",
			"canonicalURL": "/github.com/factset/enterprise-sdk@dcf75a02daedc726c313912a349d2863114bc92c/-/blob/code/java/AITextSummarization/v1/api/openapi.yaml",
			"externalURLs": [
				{
					"url": "https://github.com/factset/enterprise-sdk/blob/dcf75a02daedc726c313912a349d2863114bc92c/code/java/AITextSummarization/v1/api/openapi.yaml",
					"serviceKind": "GITHUB"
				}
			]
		}
	},
	"Error": "notImplemented: path \"/headline\": post: security: security \"FactSetOAuth2\" (index 1): oauth2 security not implemented",
	"NotImplemented": [
		"oauth2 security"
	]
}