{
	"File": {
		"__typename": "FileMatch",
		"repository": {
			"name": "github.com/stackql/stackql-provider-registry"
		},
		"file": {
			"name": "groupssettings-v1.yaml",
			"size": 0,
			"path": "providers/src/googleapis.com/v0.1.2/services/groupssettings-v1.yaml",
			"byteSize": 31625,
			"content": "components:\n  parameters:\n    alt:\n      description: Data format for the response.\n      in: query\n      name: alt\n      schema:\n        enum:\n        - atom\n        - json\n        type: string\n    fields:\n      description: Selector specifying which fields to include in a partial response.\n      in: query\n      name: fields\n      schema:\n        type: string\n    key:\n      description: API key. Your API key identifies your project and provides you\n        with API access, quota, and reports. Required unless you provide an OAuth\n        2.0 token.\n      in: query\n      name: key\n      schema:\n        type: string\n    oauth_token:\n      description: OAuth 2.0 token for the current user.\n      in: query\n      name: oauth_token\n      schema:\n        type: string\n    prettyPrint:\n      description: Returns response with indentations and line breaks.\n      in: query\n      name: prettyPrint\n      schema:\n        type: boolean\n    quotaUser:\n      description: An opaque string that represents a user for quota purposes. Must\n        not exceed 40 characters.\n      in: query\n      name: quotaUser\n      schema:\n        type: string\n    userIp:\n      description: Deprecated. Please use quotaUser instead.\n      in: query\n      name: userIp\n      schema:\n        type: string\n  schemas:\n    Groups:\n      description: JSON template for Group resource\n      properties:\n        allowExternalMembers:\n          description: \"Identifies whether members external to your organization can\\\n            \\ join the group. Possible values are:  \\n- true: G Suite users external\\\n            \\ to your organization can become members of this group. \\n- false: Users\\\n            \\ not belonging to the organization are not allowed to become members\\\n            \\ of this group.\"\n          type: string\n        allowGoogleCommunication:\n          description: \"Deprecated. Allows Google to contact administrator of the\\\n            \\ group.  \\n- true: Allow Google to contact managers of this group. Occasionally\\\n            \\ Google may send updates on the latest features, ask for input on new\\\n            \\ features, or ask for permission to highlight your group. \\n- false:\\\n            \\ Google can not contact managers of this group.\"\n          type: string\n        allowWebPosting:\n          description: \"Allows posting from web. Possible values are:  \\n- true: Allows\\\n            \\ any member to post to the group forum. \\n- false: Members only use Gmail\\\n            \\ to communicate with the group.\"\n          type: string\n        archiveOnly:\n          description: \"Allows the group to be archived only. Possible values are:\\\n            \\  \\n- true: Group is archived and the group is inactive. New messages\\\n            \\ to this group are rejected. The older archived messages are browseable\\\n            \\ and searchable.  \\n- If true, the whoCanPostMessage property is set\\\n            \\ to NONE_CAN_POST.  \\n- If reverted from true to false, whoCanPostMessages\\\n            \\ is set to ALL_MANAGERS_CAN_POST.  \\n- false: The group is active and\\\n            \\ can receive messages.  \\n- When false, updating whoCanPostMessage to\\\n            \\ NONE_CAN_POST, results in an error.\"\n          type: string\n        customFooterText:\n          description: Set the content of custom footer text. The maximum number of\n            characters is 1,000.\n          type: string\n        customReplyTo:\n          description: \"An email address used when replying to a message if the replyTo\\\n            \\ property is set to REPLY_TO_CUSTOM. This address is defined by an account\\\n            \\ administrator.  \\n- When the group's ReplyTo property is set to REPLY_TO_CUSTOM,\\\n            \\ the customReplyTo property holds a custom email address used when replying\\\n            \\ to a message. \\n- If the group's ReplyTo property is set to REPLY_TO_CUSTOM,\\\n            \\ the customReplyTo property must have a text value or an error is returned.\"\n          type: string\n        customRolesEnabledForSettingsToBeMerged:\n          description: \"Specifies whether the group has a custom role that's included\\\n            \\ in one of the settings being merged. This field is read-only and update/patch\\\n            \\ requests to it are ignored. Possible values are:  \\n- true \\n- false\"\n          type: string\n        defaultMessageDenyNotificationText:\n          description: 'When a message is rejected, this is text for the rejection\n            notification sent to the message''s author. By default, this property\n            is empty and has no value in the API''s response body. The maximum notification\n            text size is 10,000 characters. Note: Requires sendMessageDenyNotification\n            property to be true.'\n          type: string\n        default_sender:\n          description: 'Default sender for members who can post messages as the group.\n            Possible values are: - `DEFAULT_SELF`: By default messages will be sent\n            from the user - `GROUP`: By default messages will be sent from the group'\n          type: string\n        description:\n          description: Description of the group. This property value may be an empty\n            string if no group description has been entered. If entered, the maximum\n            group description is no more than 300 characters.\n          type: string\n        email:\n          description: 'The group''s email address. This property can be updated using\n            the Directory API. Note: Only a group owner can change a group''s email\n            address. A group manager can''t do this.\n\n            When you change your group''s address using the Directory API or the control\n            panel, you are changing the address your subscribers use to send email\n            and the web address people use to access your group. People can''t reach\n            your group by visiting the old address.'\n          type: string\n        enableCollaborativeInbox:\n          description: \"Specifies whether a collaborative inbox will remain turned\\\n            \\ on for the group. Possible values are:  \\n- true \\n- false\"\n          type: string\n        favoriteRepliesOnTop:\n          description: \"Indicates if favorite replies should be displayed above other\\\n            \\ replies.  \\n- true: Favorite replies will be displayed above other replies.\\\n            \\ \\n- false: Favorite replies will not be displayed above other replies.\"\n          type: string\n        includeCustomFooter:\n          description: \"Whether to include custom footer. Possible values are:  \\n\\\n            - true \\n- false\"\n          type: string\n        includeInGlobalAddressList:\n          description: \"Enables the group to be included in the Global Address List.\\\n            \\ For more information, see the help center. Possible values are:  \\n\\\n            - true: Group is included in the Global Address List. \\n- false: Group\\\n            \\ is not included in the Global Address List.\"\n          type: string\n        isArchived:\n          description: \"Allows the Group contents to be archived. Possible values\\\n            \\ are:  \\n- true: Archive messages sent to the group. \\n- false: Do not\\\n            \\ keep an archive of messages sent to this group. If false, previously\\\n            \\ archived messages remain in the archive.\"\n          type: string\n        kind:\n          default: groupsSettings#groups\n          description: The type of the resource. It is always groupsSettings#groups.\n          type: string\n        maxMessageBytes:\n          description: Deprecated. The maximum size of a message is 25Mb.\n          format: int32\n          type: integer\n        membersCanPostAsTheGroup:\n          description: \"Enables members to post messages as the group. Possible values\\\n            \\ are:  \\n- true: Group member can post messages using the group's email\\\n            \\ address instead of their own email address. Message appear to originate\\\n            \\ from the group itself. Note: When true, any message moderation settings\\\n            \\ on individual users or new members do not apply to posts made on behalf\\\n            \\ of the group. \\n- false: Members can not post in behalf of the group's\\\n            \\ email address.\"\n          type: string\n        messageDisplayFont:\n          description: Deprecated. The default message display font always has a value\n            of \"DEFAULT_FONT\".\n          type: string\n        messageModerationLevel:\n          description: \"Moderation level of incoming messages. Possible values are:\\\n            \\  \\n- MODERATE_ALL_MESSAGES: All messages are sent to the group owner's\\\n            \\ email address for approval. If approved, the message is sent to the\\\n            \\ group. \\n- MODERATE_NON_MEMBERS: All messages from non group members\\\n            \\ are sent to the group owner's email address for approval. If approved,\\\n            \\ the message is sent to the group. \\n- MODERATE_NEW_MEMBERS: All messages\\\n            \\ from new members are sent to the group owner's email address for approval.\\\n            \\ If approved, the message is sent to the group. \\n- MODERATE_NONE: No\\\n            \\ moderator approval is required. Messages are delivered directly to the\\\n            \\ group. Note: When the whoCanPostMessage is set to ANYONE_CAN_POST, we\\\n            \\ recommend the messageModerationLevel be set to MODERATE_NON_MEMBERS\\\n            \\ to protect the group from possible spam.\\nWhen memberCanPostAsTheGroup\\\n            \\ is true, any message moderation settings on individual users or new\\\n            \\ members will not apply to posts made on behalf of the group.\"\n          type: string\n        name:\n          description: Name of the group, which has a maximum size of 75 characters.\n          type: string\n        primaryLanguage:\n          description: The primary language for group. For a group's primary language\n            use the language tags from the G Suite languages found at G Suite Email\n            Settings API Email Language Tags.\n          type: string\n        replyTo:\n          description: \"Specifies who receives the default reply. Possible values\\\n            \\ are:  \\n- REPLY_TO_CUSTOM: For replies to messages, use the group's\\\n            \\ custom email address.\\nWhen the group's ReplyTo property is set to REPLY_TO_CUSTOM,\\\n            \\ the customReplyTo property holds the custom email address used when\\\n            \\ replying to a message. If the group's ReplyTo property is set to REPLY_TO_CUSTOM,\\\n            \\ the customReplyTo property must have a value. Otherwise an error is\\\n            \\ returned.\\n \\n- REPLY_TO_SENDER: The reply sent to author of message.\\\n            \\ \\n- REPLY_TO_LIST: This reply message is sent to the group. \\n- REPLY_TO_OWNER:\\\n            \\ The reply is sent to the owner(s) of the group. This does not include\\\n            \\ the group's managers. \\n- REPLY_TO_IGNORE: Group users individually\\\n            \\ decide where the message reply is sent. \\n- REPLY_TO_MANAGERS: This\\\n            \\ reply message is sent to the group's managers, which includes all managers\\\n            \\ and the group owner.\"\n          type: string\n        sendMessageDenyNotification:\n          description: \"Allows a member to be notified if the member's message to\\\n            \\ the group is denied by the group owner. Possible values are:  \\n- true:\\\n            \\ When a message is rejected, send the deny message notification to the\\\n            \\ message author.\\nThe defaultMessageDenyNotificationText property is\\\n            \\ dependent on the sendMessageDenyNotification property being true.\\n\\\n            \\ \\n- false: When a message is rejected, no notification is sent.\"\n          type: string\n        showInGroupDirectory:\n          description: \"Deprecated. This is merged into the new whoCanDiscoverGroup\\\n            \\ setting. Allows the group to be visible in the Groups Directory. Possible\\\n            \\ values are:  \\n- true: All groups in the account are listed in the Groups\\\n            \\ directory. \\n- false: All groups in the account are not listed in the\\\n            \\ directory.\"\n          type: string\n        spamModerationLevel:\n          description: \"Specifies moderation levels for messages detected as spam.\\\n            \\ Possible values are:  \\n- ALLOW: Post the message to the group. \\n-\\\n            \\ MODERATE: Send the message to the moderation queue. This is the default.\\\n            \\ \\n- SILENTLY_MODERATE: Send the message to the moderation queue, but\\\n            \\ do not send notification to moderators. \\n- REJECT: Immediately reject\\\n            \\ the message.\"\n          type: string\n        whoCanAdd:\n          description: \"Deprecated. This is merged into the new whoCanModerateMembers\\\n            \\ setting. Permissions to add members. Possible values are:  \\n- ALL_MEMBERS_CAN_ADD:\\\n            \\ Managers and members can directly add new members. \\n- ALL_MANAGERS_CAN_ADD:\\\n            \\ Only managers can directly add new members. this includes the group's\\\n            \\ owner. \\n- ALL_OWNERS_CAN_ADD: Only owners can directly add new members.\\\n            \\ \\n- NONE_CAN_ADD: No one can directly add new members.\"\n          type: string\n        whoCanAddReferences:\n          description: Deprecated. This functionality is no longer supported in the\n            Google Groups UI. The value is always \"NONE\".\n          type: string\n        whoCanApproveMembers:\n          description: \"Specifies who can approve members who ask to join groups.\\\n            \\ This permission will be deprecated once it is merged into the new whoCanModerateMembers\\\n            \\ setting. Possible values are:  \\n- ALL_MEMBERS_CAN_APPROVE \\n- ALL_MANAGERS_CAN_APPROVE\\\n            \\ \\n- ALL_OWNERS_CAN_APPROVE \\n- NONE_CAN_APPROVE\"\n          type: string\n        whoCanApproveMessages:\n          description: \"Deprecated. This is merged into the new whoCanModerateContent\\\n            \\ setting. Specifies who can approve pending messages in the moderation\\\n            \\ queue. Possible values are:  \\n- ALL_MEMBERS \\n- OWNERS_AND_MANAGERS\\\n            \\ \\n- OWNERS_ONLY \\n- NONE\"\n          type: string\n        whoCanAssignTopics:\n          description: \"Deprecated. This is merged into the new whoCanAssistContent\\\n            \\ setting. Permission to assign topics in a forum to another user. Possible\\\n            \\ values are:  \\n- ALL_MEMBERS \\n- OWNERS_AND_MANAGERS \\n- MANAGERS_ONLY\\\n            \\ \\n- OWNERS_ONLY \\n- NONE\"\n          type: string\n        whoCanAssistContent:\n          description: \"Specifies who can moderate metadata. Possible values are:\\\n            \\  \\n- ALL_MEMBERS \\n- OWNERS_AND_MANAGERS \\n- MANAGERS_ONLY \\n- OWNERS_ONLY\\\n            \\ \\n- NONE\"\n          type: string\n        whoCanBanUsers:\n          description: \"Specifies who can deny membership to users. This permission\\\n            \\ will be deprecated once it is merged into the new whoCanModerateMembers\\\n            \\ setting. Possible values are:  \\n- ALL_MEMBERS \\n- OWNERS_AND_MANAGERS\\\n            \\ \\n- OWNERS_ONLY \\n- NONE\"\n          type: string\n        whoCanContactOwner:\n          description: \"Permission to contact owner of the group via web UI. Possible\\\n            \\ values are:  \\n- ALL_IN_DOMAIN_CAN_CONTACT \\n- ALL_MANAGERS_CAN_CONTACT\\\n            \\ \\n- ALL_MEMBERS_CAN_CONTACT \\n- ANYONE_CAN_CONTACT \\n- ALL_OWNERS_CAN_CONTACT\"\n          type: string\n        whoCanDeleteAnyPost:\n          description: \"Deprecated. This is merged into the new whoCanModerateContent\\\n            \\ setting. Specifies who can delete replies to topics. (Authors can always\\\n            \\ delete their own posts). Possible values are:  \\n- ALL_MEMBERS \\n- OWNERS_AND_MANAGERS\\\n            \\ \\n- OWNERS_ONLY \\n- NONE\"\n          type: string\n        whoCanDeleteTopics:\n          description: \"Deprecated. This is merged into the new whoCanModerateContent\\\n            \\ setting. Specifies who can delete topics. Possible values are:  \\n-\\\n            \\ ALL_MEMBERS \\n- OWNERS_AND_MANAGERS \\n- OWNERS_ONLY \\n- NONE\"\n          type: string\n        whoCanDiscoverGroup:\n          description: \"Specifies the set of users for whom this group is discoverable.\\\n            \\ Possible values are:  \\n- ANYONE_CAN_DISCOVER \\n- ALL_IN_DOMAIN_CAN_DISCOVER\\\n            \\ \\n- ALL_MEMBERS_CAN_DISCOVER\"\n          type: string\n        whoCanEnterFreeFormTags:\n          description: \"Deprecated. This is merged into the new whoCanAssistContent\\\n            \\ setting. Permission to enter free form tags for topics in a forum. Possible\\\n            \\ values are:  \\n- ALL_MEMBERS \\n- OWNERS_AND_MANAGERS \\n- MANAGERS_ONLY\\\n            \\ \\n- OWNERS_ONLY \\n- NONE\"\n          type: string\n        whoCanHideAbuse:\n          description: \"Deprecated. This is merged into the new whoCanModerateContent\\\n            \\ setting. Specifies who can hide posts by reporting them as abuse. Possible\\\n            \\ values are:  \\n- ALL_MEMBERS \\n- OWNERS_AND_MANAGERS \\n- OWNERS_ONLY\\\n            \\ \\n- NONE\"\n          type: string\n        whoCanInvite:\n          description: \"Deprecated. This is merged into the new whoCanModerateMembers\\\n            \\ setting. Permissions to invite new members. Possible values are:  \\n\\\n            - ALL_MEMBERS_CAN_INVITE: Managers and members can invite a new member\\\n            \\ candidate. \\n- ALL_MANAGERS_CAN_INVITE: Only managers can invite a new\\\n            \\ member. This includes the group's owner. \\n- ALL_OWNERS_CAN_INVITE:\\\n            \\ Only owners can invite a new member. \\n- NONE_CAN_INVITE: No one can\\\n            \\ invite a new member candidate.\"\n          type: string\n        whoCanJoin:\n          description: \"Permission to join group. Possible values are:  \\n- ANYONE_CAN_JOIN:\\\n            \\ Anyone in the account domain can join. This includes accounts with multiple\\\n            \\ domains. \\n- ALL_IN_DOMAIN_CAN_JOIN: Any Internet user who is outside\\\n            \\ your domain can access your Google Groups service and view the list\\\n            \\ of groups in your Groups directory. Warning: Group owners can add external\\\n            \\ addresses, outside of the domain to their groups. They can also allow\\\n            \\ people outside your domain to join their groups. If you later disable\\\n            \\ this option, any external addresses already added to users' groups remain\\\n            \\ in those groups. \\n- INVITED_CAN_JOIN: Candidates for membership can\\\n            \\ be invited to join.  \\n- CAN_REQUEST_TO_JOIN: Non members can request\\\n            \\ an invitation to join.\"\n          type: string\n        whoCanLeaveGroup:\n          description: \"Permission to leave the group. Possible values are:  \\n- ALL_MANAGERS_CAN_LEAVE\\\n            \\ \\n- ALL_MEMBERS_CAN_LEAVE \\n- NONE_CAN_LEAVE\"\n          type: string\n        whoCanLockTopics:\n          description: \"Deprecated. This is merged into the new whoCanModerateContent\\\n            \\ setting. Specifies who can prevent users from posting replies to topics.\\\n            \\ Possible values are:  \\n- ALL_MEMBERS \\n- OWNERS_AND_MANAGERS \\n- OWNERS_ONLY\\\n            \\ \\n- NONE\"\n          type: string\n        whoCanMakeTopicsSticky:\n          description: \"Deprecated. This is merged into the new whoCanModerateContent\\\n            \\ setting. Specifies who can make topics appear at the top of the topic\\\n            \\ list. Possible values are:  \\n- ALL_MEMBERS \\n- OWNERS_AND_MANAGERS\\\n            \\ \\n- OWNERS_ONLY \\n- NONE\"\n          type: string\n        whoCanMarkDuplicate:\n          description: \"Deprecated. This is merged into the new whoCanAssistContent\\\n            \\ setting. Permission to mark a topic as a duplicate of another topic.\\\n            \\ Possible values are:  \\n- ALL_MEMBERS \\n- OWNERS_AND_MANAGERS \\n- MANAGERS_ONLY\\\n            \\ \\n- OWNERS_ONLY \\n- NONE\"\n          type: string\n        whoCanMarkFavoriteReplyOnAnyTopic:\n          description: \"Deprecated. This is merged into the new whoCanAssistContent\\\n            \\ setting. Permission to mark any other user's post as a favorite reply.\\\n            \\ Possible values are:  \\n- ALL_MEMBERS \\n- OWNERS_AND_MANAGERS \\n- MANAGERS_ONLY\\\n            \\ \\n- OWNERS_ONLY \\n- NONE\"\n          type: string\n        whoCanMarkFavoriteReplyOnOwnTopic:\n          description: \"Deprecated. This is merged into the new whoCanAssistContent\\\n            \\ setting. Permission to mark a post for a topic they started as a favorite\\\n            \\ reply. Possible values are:  \\n- ALL_MEMBERS \\n- OWNERS_AND_MANAGERS\\\n            \\ \\n- MANAGERS_ONLY \\n- OWNERS_ONLY \\n- NONE\"\n          type: string\n        whoCanMarkNoResponseNeeded:\n          description: \"Deprecated. This is merged into the new whoCanAssistContent\\\n            \\ setting. Permission to mark a topic as not needing a response. Possible\\\n            \\ values are:  \\n- ALL_MEMBERS \\n- OWNERS_AND_MANAGERS \\n- MANAGERS_ONLY\\\n            \\ \\n- OWNERS_ONLY \\n- NONE\"\n          type: string\n        whoCanModerateContent:\n          description: \"Specifies who can moderate content. Possible values are: \\\n            \\ \\n- ALL_MEMBERS \\n- OWNERS_AND_MANAGERS \\n- OWNERS_ONLY \\n- NONE\"\n          type: string\n        whoCanModerateMembers:\n          description: \"Specifies who can manage members. Possible values are:  \\n\\\n            - ALL_MEMBERS \\n- OWNERS_AND_MANAGERS \\n- OWNERS_ONLY \\n- NONE\"\n          type: string\n        whoCanModifyMembers:\n          description: \"Deprecated. This is merged into the new whoCanModerateMembers\\\n            \\ setting. Specifies who can change group members' roles. Possible values\\\n            \\ are:  \\n- ALL_MEMBERS \\n- OWNERS_AND_MANAGERS \\n- OWNERS_ONLY \\n- NONE\"\n          type: string\n        whoCanModifyTagsAndCategories:\n          description: \"Deprecated. This is merged into the new whoCanAssistContent\\\n            \\ setting. Permission to change tags and categories. Possible values are:\\\n            \\  \\n- ALL_MEMBERS \\n- OWNERS_AND_MANAGERS \\n- MANAGERS_ONLY \\n- OWNERS_ONLY\\\n            \\ \\n- NONE\"\n          type: string\n        whoCanMoveTopicsIn:\n          description: \"Deprecated. This is merged into the new whoCanModerateContent\\\n            \\ setting. Specifies who can move topics into the group or forum. Possible\\\n            \\ values are:  \\n- ALL_MEMBERS \\n- OWNERS_AND_MANAGERS \\n- OWNERS_ONLY\\\n            \\ \\n- NONE\"\n          type: string\n        whoCanMoveTopicsOut:\n          description: \"Deprecated. This is merged into the new whoCanModerateContent\\\n            \\ setting. Specifies who can move topics out of the group or forum. Possible\\\n            \\ values are:  \\n- ALL_MEMBERS \\n- OWNERS_AND_MANAGERS \\n- OWNERS_ONLY\\\n            \\ \\n- NONE\"\n          type: string\n        whoCanPostAnnouncements:\n          description: \"Deprecated. This is merged into the new whoCanModerateContent\\\n            \\ setting. Specifies who can post announcements, a special topic type.\\\n            \\ Possible values are:  \\n- ALL_MEMBERS \\n- OWNERS_AND_MANAGERS \\n- OWNERS_ONLY\\\n            \\ \\n- NONE\"\n          type: string\n        whoCanPostMessage:\n          description: \"Permissions to post messages. Possible values are:  \\n- NONE_CAN_POST:\\\n            \\ The group is disabled and archived. No one can post a message to this\\\n            \\ group.  \\n- When archiveOnly is false, updating whoCanPostMessage to\\\n            \\ NONE_CAN_POST, results in an error. \\n- If archiveOnly is reverted from\\\n            \\ true to false, whoCanPostMessages is set to ALL_MANAGERS_CAN_POST. \\\n            \\ \\n- ALL_MANAGERS_CAN_POST: Managers, including group owners, can post\\\n            \\ messages. \\n- ALL_MEMBERS_CAN_POST: Any group member can post a message.\\\n            \\ \\n- ALL_OWNERS_CAN_POST: Only group owners can post a message. \\n- ALL_IN_DOMAIN_CAN_POST:\\\n            \\ Anyone in the account can post a message.  \\n- ANYONE_CAN_POST: Any\\\n            \\ Internet user who outside your account can access your Google Groups\\\n            \\ service and post a message. Note: When whoCanPostMessage is set to ANYONE_CAN_POST,\\\n            \\ we recommend the messageModerationLevel be set to MODERATE_NON_MEMBERS\\\n            \\ to protect the group from possible spam.\"\n          type: string\n        whoCanTakeTopics:\n          description: \"Deprecated. This is merged into the new whoCanAssistContent\\\n            \\ setting. Permission to take topics in a forum. Possible values are:\\\n            \\  \\n- ALL_MEMBERS \\n- OWNERS_AND_MANAGERS \\n- MANAGERS_ONLY \\n- OWNERS_ONLY\\\n            \\ \\n- NONE\"\n          type: string\n        whoCanUnassignTopic:\n          description: \"Deprecated. This is merged into the new whoCanAssistContent\\\n            \\ setting. Permission to unassign any topic in a forum. Possible values\\\n            \\ are:  \\n- ALL_MEMBERS \\n- OWNERS_AND_MANAGERS \\n- MANAGERS_ONLY \\n-\\\n            \\ OWNERS_ONLY \\n- NONE\"\n          type: string\n        whoCanUnmarkFavoriteReplyOnAnyTopic:\n          description: \"Deprecated. This is merged into the new whoCanAssistContent\\\n            \\ setting. Permission to unmark any post from a favorite reply. Possible\\\n            \\ values are:  \\n- ALL_MEMBERS \\n- OWNERS_AND_MANAGERS \\n- MANAGERS_ONLY\\\n            \\ \\n- OWNERS_ONLY \\n- NONE\"\n          type: string\n        whoCanViewGroup:\n          description: \"Permissions to view group messages. Possible values are: \\\n            \\ \\n- ANYONE_CAN_VIEW: Any Internet user can view the group's messages.\\\n            \\  \\n- ALL_IN_DOMAIN_CAN_VIEW: Anyone in your account can view this group's\\\n            \\ messages. \\n- ALL_MEMBERS_CAN_VIEW: All group members can view the group's\\\n            \\ messages. \\n- ALL_MANAGERS_CAN_VIEW: Any group manager can view this\\\n            \\ group's messages.\"\n          type: string\n        whoCanViewMembership:\n          description: \"Permissions to view membership. Possible values are:  \\n-\\\n            \\ ALL_IN_DOMAIN_CAN_VIEW: Anyone in the account can view the group members\\\n            \\ list.\\nIf a group already has external members, those members can still\\\n            \\ send email to this group.\\n \\n- ALL_MEMBERS_CAN_VIEW: The group members\\\n            \\ can view the group members list. \\n- ALL_MANAGERS_CAN_VIEW: The group\\\n            \\ managers can view group members list.\"\n          type: string\n      type: object\n  securitySchemes:\n    Oauth2:\n      description: Oauth 2.0 implicit authentication\n      flows:\n        implicit:\n          authorizationUrl: https://accounts.google.com/o/oauth2/auth\n          scopes:\n            https://www.googleapis.com/auth/apps.groups.settings: View and manage\n              the settings of a G Suite group\n      type: oauth2\n    Oauth2c:\n      description: Oauth 2.0 authorizationCode authentication\n      flows:\n        authorizationCode:\n          authorizationUrl: https://accounts.google.com/o/oauth2/auth\n          scopes:\n            https://www.googleapis.com/auth/apps.groups.settings: View and manage\n              the settings of a G Suite group\n          tokenUrl: https://accounts.google.com/o/oauth2/token\n      type: oauth2\n  x-stackQL-resources:\n    groups:\n      id: google.groupssettings.groups\n      methods:\n        get:\n          operation:\n            $ref: '#/paths/~1{groupUniqueId}/get'\n          response:\n            mediaType: application/json\n            openAPIDocKey: '200'\n        patch:\n          operation:\n            $ref: '#/paths/~1{groupUniqueId}/patch'\n          request:\n            mediaType: application/json\n          response:\n            mediaType: application/json\n            openAPIDocKey: '200'\n        update:\n          operation:\n            $ref: '#/paths/~1{groupUniqueId}/put'\n          request:\n            mediaType: application/json\n          response:\n            mediaType: application/json\n            openAPIDocKey: '200'\n      name: groups\n      title: groups\nexternalDocs:\n  url: https://developers.google.com/google-apps/groups-settings/get_started\ninfo:\n  contact:\n    name: Google\n    url: https://google.com\n    x-twitter: youtube\n  description: Manages permission levels and related settings of a group.\n  license:\n    name: Creative Commons Attribution 3.0\n    url: http://creativecommons.org/licenses/by/3.0/\n  termsOfService: https://developers.google.com/terms/\n  title: Groups Settings API\n  version: v1\n  x-apiClientRegistration:\n    url: https://console.developers.google.com\n  x-apisguru-categories:\n  - analytics\n  - media\n  x-logo:\n    url: https://api.apis.guru/v2/cache/logo/https_www.google.com_images_branding_googlelogo_2x_googlelogo_color_272x92dp.png\n  x-origin:\n  - format: google\n    url: https://groupssettings.googleapis.com/$discovery/rest?version=v1\n    version: v1\n  x-providerName: googleapis.com\n  x-serviceName: groupssettings\nopenapi: 3.0.0\npaths:\n  /{groupUniqueId}:\n    get:\n      description: Gets one resource by id.\n      operationId: groupsSettings.groups.get\n      parameters:\n      - description: The group's email address.\n        in: path\n        name: groupUniqueId\n        required: true\n        schema:\n          type: string\n      responses:\n        '200':\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/Groups'\n          description: Successful response\n      security:\n      - Oauth2:\n        - https://www.googleapis.com/auth/apps.groups.settings\n        Oauth2c:\n        - https://www.googleapis.com/auth/apps.groups.settings\n      tags:\n      - groups\n    parameters:\n    - $ref: '#/components/parameters/alt'\n    - $ref: '#/components/parameters/fields'\n    - $ref: '#/components/parameters/key'\n    - $ref: '#/components/parameters/oauth_token'\n    - $ref: '#/components/parameters/prettyPrint'\n    - $ref: '#/components/parameters/quotaUser'\n    - $ref: '#/components/parameters/userIp'\n    patch:\n      description: Updates an existing resource. This method supports patch semantics.\n      operationId: groupsSettings.groups.patch\n      parameters:\n      - description: The group's email address.\n        in: path\n        name: groupUniqueId\n        required: true\n        schema:\n          type: string\n      requestBody:\n        content:\n          application/json:\n            schema:\n              $ref: '#/components/schemas/Groups'\n      responses:\n        '200':\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/Groups'\n          description: Successful response\n      security:\n      - Oauth2:\n        - https://www.googleapis.com/auth/apps.groups.settings\n        Oauth2c:\n        - https://www.googleapis.com/auth/apps.groups.settings\n      tags:\n      - groups\n    put:\n      description: Updates an existing resource.\n      operationId: groupsSettings.groups.update\n      parameters:\n      - description: The group's email address.\n        in: path\n        name: groupUniqueId\n        required: true\n        schema:\n          type: string\n      requestBody:\n        content:\n          application/json:\n            schema:\n              $ref: '#/components/schemas/Groups'\n      responses:\n        '200':\n          content:\n            application/json:\n              schema:\n                $ref: '#/components/schemas/Groups'\n          description: Successful response\n      security:\n      - Oauth2:\n        - https://www.googleapis.com/auth/apps.groups.settings\n        Oauth2c:\n        - https://www.googleapis.com/auth/apps.groups.settings\n      tags:\n      - groups\nservers:\n- url: https://www.googleapis.com/groups/v1/groups\ntags:\n- name: groups\n",
			"canonicalURL": "/github.com/stackql/stackql-provider-registry@7482bc9b2425a6491d640bf921a1dc9cf508f339/-/blob/providers/src/googleapis.com/v0.1.2/services/groupssettings-v1.yaml",
			"externalURLs": [
				{
					"url": "https://github.com/stackql/stackql-provider-registry/blob/7482bc9b2425a6491d640bf921a1dc9cf508f339/providers/src/googleapis.com/v0.1.2/services/groupssettings-v1.yaml",
					"serviceKind": "GITHUB"
				}
			]
		}
	},
	"Error": "notImplemented: path \"/{groupUniqueId}\": get: security: security \"Oauth2\" (index 0): oauth2 security not implemented",
	"NotImplemented": [
		"oauth2 security"
	]
}