{
	"File": {
		"__typename": "FileMatch",
		"repository": {
			"name": "github.com/restful-ma/thresholds"
		},
		"file": {
			"name": "ebay.com-buy-browse-v1_beta.24.0-swagger.yaml",
			"size": 0,
			"path": "benchmark-repository/openapi/ebay.com-buy-browse-v1_beta.24.0-swagger.yaml",
			"byteSize": 182840,
			"content": "openapi: 3.0.0\ninfo:\n  contact:\n    name: eBay Inc,\n    x-twitter: ebay\n  description: \"The Browse API has the following resources: item_summary: Lets shoppers\n    search for specific items by keyword, GTIN, category, charity, product, or\n    item aspects and refine the results by using filters, such as aspects,\n    compatibility, and fields values. \u0026nbsp;(Experimental) search_by_image: Lets\n    shoppers search for specific items by image. You can refine the results by\n    using URI parameters and filters. item: Lets you retrieve the details of a\n    specific item or all the items in an item group, which is an item with\n    variations such as color and size and check if a product is compatible with\n    the specified item, such as if a specific car is compatible with a specific\n    part. Provides a bridge between the eBay legacy APIs, such as Finding, and\n    the RESTful APIs, which use different formats for the item IDs.\n    \u0026nbsp;(Experimental) shopping_cart: Provides the ability for eBay members to\n    see the contents of their eBay cart, and add, remove, and change the\n    quantity of items in their eBay cart.\u0026nbsp;\u0026nbsp; Note: This resource is not\n    available in the eBay API Explorer. The item_summary, search_by_image, and\n    item resource calls require an Application access token. The shopping_cart\n    resource calls require a User access token.\"\n  license:\n    name: eBay API License Agreement\n    url: https://go.developer.ebay.com/api-license-agreement\n  title: Browse\n  version: v1_beta.24.0\n  x-apisguru-categories:\n    - ecommerce\n  x-logo:\n    backgroundColor: \"#FFFFFF\"\n    url: https://twitter.com/ebay/profile_image?size=original\n  x-origin:\n    - format: swagger\n      url: https://developer.ebay.com/api-docs/master/buy/browse/openapi/2/buy_browse_v1_beta_oas2.json\n      version: \"2.0\"\n  x-providerName: ebay.com\n  x-serviceName: buy-browse\npaths:\n  /item/get_item_by_legacy_id:\n    get:\n      description: \"This method is a bridge between the eBay legacy APIs, such as Shopping,\n        and Finding and the eBay Buy APIs. There are differences between how\n        legacy APIs and RESTful APIs return the identifier of an\n        \u0026quot;item\u0026quot; and what the item ID represents. This method lets you\n        use the legacy item IDs retrieve the details of a specific item, such as\n        description, price, and other information the buyer needs to make a\n        purchasing decision. It also returns the RESTful item ID, which you can\n        use with all the Buy API methods. For more information about how to use\n        legacy IDs with the Buy APIs, see Legacy API compatibility in the Buying\n        Integration guide. This method returns the item details and requires you\n        to pass in either the item ID of a non-variation item or the item IDs of\n        both the parent and child of an item group. An item group is an item\n        that has various aspect differences, such as color, size, storage\n        capacity, etc. When an item group is created, one of the item\n        variations, such as the red shirt size L, is chosen as the\n        \u0026quot;parent\u0026quot;. All the other items in the group are the children,\n        such as the blue shirt size L, red shirt size M, etc. The fieldgroups\n        URI parameter lets you control what is returned in the response. Setting\n        fieldgroups to PRODUCT, adds additional fields to the default response\n        that return information about the product of the item. For more\n        information, see fieldgroups. URLs for this method Production URL:\n        https://api.ebay.com/buy/browse/v1/item/get_item_by_legacy_id/ Sandbox\n        URL:\n        https://api.sandbox.ebay.com/buy/browse/v1/item/get_item_by_legacy_id/\n        Request headers You will want to use the X-EBAY-C-ENDUSERCTX request\n        header with this method. This header enables eBay Network Partners to\n        pass in their identification in order to be paid for selling eBay items\n        and it is strongly recommended you use contextualLocation to improve the\n        estimated delivery window information. For details see, Request headers\n        in the Buying Integration Guide. Restrictions For a list of supported\n        sites and other restrictions, see API Restrictions.\"\n      operationId: getItemByLegacyId\n      parameters:\n        - description: \"This field lets you control what is returned in the response. If\n            you do not set this field, the method returns all the details of the\n            item. Note: In this method, the only value supported is PRODUCT.\n            Valid Values: PRODUCT - This adds the additionalImages,\n            additionalProductIdentities, aspectGroups, description, gtins,\n            image, and title fields to the response, which describe the item's\n            product. See Product for more information about these fields. Code\n            so that your app gracefully handles any future changes to this\n            list.\"\n          in: query\n          name: fieldgroups\n          required: false\n          schema:\n            type: string\n        - description: \"Specifies either: The legacy item ID of an item that is not part of\n            a group. The legacy item ID of a group, which is the ID of the\n            \u0026quot;parent\u0026quot; of the group of items. Note: If you pass in a\n            group ID, you must also use the legacy_variation_id field and pass\n            in the legacy ID of the specific item variation (child ID). Legacy\n            IDs are returned by APIs, such as the Finding API. The following is\n            an example of using the value of the ItemID field for a specific\n            item from Finding to get the RESTful itemId value.\n            \u0026nbsp;\u0026nbsp;\u0026nbsp;\n            browse/v1/item/get_item_by_legacy_id?legacy_item_id=110039490209\n            Maximum: 1\"\n          in: query\n          name: legacy_item_id\n          required: true\n          schema:\n            type: string\n        - description: \"Specifies the legacy item ID of a specific item in an item group,\n            such as the red shirt size L. Legacy IDs are returned by APIs, such\n            as the Finding API. Maximum: 1 Requirement: You must always pass in\n            the legacy_item_id with the legacy_variation_id\"\n          in: query\n          name: legacy_variation_id\n          required: false\n          schema:\n            type: string\n        - description: \"Specifics the legacy SKU of the item. SKU are item IDs created by\n            the seller. Legacy SKUs are returned by eBay the Shopping API. The\n            following is an example of using the value of the ItemID and SKU\n            fields to get the RESTful itemId value. \u0026nbsp;\u0026nbsp;\u0026nbsp;\n            browse/v1/item/get_item_by_legacy_id?legacy_item_id=110039490209\u0026am\\\n            p;legacy_variation_sku=V-00031-WHM Maximum: 1 Requirement: You must\n            always pass in the legacy_item_id with the legacy_variation_sku\"\n          in: query\n          name: legacy_variation_sku\n          required: false\n          schema:\n            type: string\n      responses:\n        \"200\":\n          description: OK\n          x-response-codes:\n            errors:\n              \"11502\":\n                category: APPLICATION\n                description: There was a problem extracting product information for this\n                  Item. Please try again.\n                domain: API_BROWSE\n          content:\n            \"*/*\":\n              schema:\n                $ref: \"#/components/schemas/Item\"\n        \"400\":\n          description: Bad Request\n          x-response-codes:\n            errors:\n              \"11003\":\n                category: REQUEST\n                description: The specified legacy item Id was not found.\n                domain: API_BROWSE\n              \"11004\":\n                category: REQUEST\n                description: The item is not available for purchase. This can be for many\n                  reasons, such as when the listing is being updated by the\n                  seller. Wait a few minutes and try the call again.\n                domain: API_BROWSE\n              \"11006\":\n                category: REQUEST\n                description: The legacy Id is invalid. Use {itemGroupHref} to get the item\n                  group details.\n                domain: API_BROWSE\n              \"11009\":\n                category: REQUEST\n                description: The legacy variation sku is invalid.\n                domain: API_BROWSE\n              \"11010\":\n                category: REQUEST\n                description: You cannot submit legacy_variation_sku and legacy_variation_id\n                  in the same request. For help, see the documentation.\n                domain: API_BROWSE\n              \"11011\":\n                category: REQUEST\n                description: \"The marketplace value {marketplaceId} is not supported. The\n                  supported values are: {allowedMarketplaces}\"\n                domain: API_BROWSE\n        \"404\":\n          description: Not Found\n        \"409\":\n          description: Conflict\n        \"500\":\n          description: Internal Server Error\n          x-response-codes:\n            errors:\n              \"11000\":\n                category: APPLICATION\n                description: There was a problem with an eBay internal system or process.\n                  Contact eBay developer support for assistance.\n                domain: API_BROWSE\n      security:\n        - Client_Credentials:\n            - https://api.ebay.com/oauth/api_scope\n      tags:\n        - item\n  /item/get_items_by_item_group:\n    get:\n      description: \"This method retrieves the details of the individual items in an item\n        group. An item group is an item that has various aspect differences,\n        such as color, size, storage capacity, etc. You pass in the item group\n        ID as a URI parameter. You use this method to show the item details of\n        items with multiple aspects, such as color, size, storage capacity, etc.\n        This method returns two main containers; items and commonDescriptions.\n        The items container has an array of containers with the details of each\n        item in the group. The commonDescriptions container has an array of\n        containers for a description and the item IDs of all the items that have\n        this exact description. Because items within an item group often have\n        the same description, this decreases the size of the response. URLs for\n        this method Production URL:\n        https://api.ebay.com/buy/browse/v1/item/get_items_by_item_group/ Sandbox\n        URL:\n        https://api.sandbox.ebay.com/buy/browse/v1/item/get_items_by_item_group/\n        Request headers You will want to use the X-EBAY-C-ENDUSERCTX request\n        header with this method. This header enables eBay Network Partners to\n        pass in their identification in order to be paid for selling eBay items\n        and it is strongly recommended you use contextualLocation to improve the\n        estimated delivery window information. For details see, Request headers\n        in the Buying Integration Guide. Restrictions For a list of supported\n        sites and other restrictions, see API Restrictions.\"\n      operationId: getItemsByItemGroup\n      parameters:\n        - description: \"Identifier of the item group to return. An item group is an item\n            that has various aspect differences, such as color, size, storage\n            capacity, etc. This ID is returned in the itemGroupHref field of the\n            search and getItem methods. For Example:\n            https://api.ebay.com/buy/browse/v1/item/get_items_by_item_group?ite\\\n            m_group_id=351825690866\"\n          in: query\n          name: item_group_id\n          required: true\n          schema:\n            type: string\n      responses:\n        \"200\":\n          description: OK\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/Items\"\n        \"400\":\n          description: Bad Request\n          x-response-codes:\n            errors:\n              \"11002\":\n                category: REQUEST\n                description: The specified item group was not found.\n                domain: API_BROWSE\n              \"11005\":\n                category: REQUEST\n                description: Item Group Id is invalid. Use {itemHref} to get the item\n                  details.\n                domain: API_BROWSE\n              \"11008\":\n                category: REQUEST\n                description: The item group is not available. This can be for many reasons,\n                  such as when the listing is being updated by the seller. Wait\n                  a few minutes and try the call again.\n                domain: API_BROWSE\n              \"11011\":\n                category: REQUEST\n                description: \"The marketplace value {marketplaceId} is not supported. The\n                  supported values are: {allowedMarketplaces}\"\n                domain: API_BROWSE\n        \"404\":\n          description: Not Found\n        \"409\":\n          description: Conflict\n        \"500\":\n          description: Internal Server Error\n          x-response-codes:\n            errors:\n              \"11000\":\n                category: APPLICATION\n                description: There was a problem with an eBay internal system or process.\n                  Contact eBay developer support for assistance.\n                domain: API_BROWSE\n      security:\n        - Client_Credentials:\n            - https://api.ebay.com/oauth/api_scope\n      tags:\n        - item\n  \"/item/{item_id}\":\n    get:\n      description: \"This method retrieves the details of a specific item, such as\n        description, price, category, all item aspects, condition, return\n        policies, seller feedback and score, shipping options, shipping costs,\n        estimated delivery, and other information the buyer needs to make a\n        purchasing decision. Note: This method will return FIXED_PRICE (Buy It\n        Now) items and AUCTION items where no bids have been placed. After a bid\n        has been placed, that item becomes an active auction item and is no\n        longer returned. The Buy APIs are designed to let you create an eBay\n        shopping experience in your app or website. This means you will need to\n        know when something, such as the availability, quantity, etc., has\n        changed in any eBay item you are offering. You can do this easily by\n        setting the fieldgroups URI parameter. This parameter lets you control\n        what is returned in the response. Setting fieldgroups to COMPACT reduces\n        the response to only the five fields that you need in order to check if\n        any item detail has changed. Setting fieldgroups to PRODUCT, adds\n        additional fields to the default response that return information about\n        the product of the item. You can use either COMPACT or PRODUCT but not\n        both. For more information, see fieldgroups. URLs for this method\n        Production URL: https://api.ebay.com/buy/browse/v1/item/ Sandbox URL:\n        https://api.sandbox.ebay.com/buy/browse/v1/item/ Request headers For\n        this method, the X-EBAY-C-ENDUSERCTX request header is used for the\n        following: For shipping options and delivery accuracy, you use the\n        contextualLocation parameter with the X-EBAY-C-ENDUSERCTX-context\n        header. This is needed for returning the shipping options and to improve\n        the estimated delivery window accuracy. For details see, Header for\n        shipping information accuracy. For eBay Network Partners, you use this\n        header to pass in your identification in order to be paid for selling\n        eBay items. For details see, Header for affiliate information.\n        Restrictions For a list of supported sites and other restrictions, see\n        API Restrictions.\"\n      operationId: getItem\n      parameters:\n        - description: \"This parameter lets you control what is returned in the response.\n            If you do not set this field, the method returns all the details of\n            the item. Valid Values: PRODUCT - This adds the additionalImages,\n            additionalProductIdentities, aspectGroups, description, gtins,\n            image, and title product fields to the response, which describe the\n            product associated with the item. See Product for more information\n            about these fields. COMPACT - This returns only the following\n            fields, which let you quickly check if the availability or price of\n            the item has changed, if the item has been revised by the seller, or\n            if an item's top-rated plus status has changed for items you have\n            stored. itemId - The identifier of the item. sellerItemRevision - An\n            identifier generated/incremented when a seller revises the item.\n            There are two types of item revisions; seller changes, such as\n            changing the title, and eBay system changes, such as changing the\n            quantity when an item is purchased. This ID is changed only when the\n            seller makes a change to the item. This means you cannot use this\n            value to determine if the quantity has changed.\n            topRatedBuyingExperience - A boolean value indicating if this item\n            is a top-rated plus item. A change in the item's top rated plus\n            standing is not tracked by the revision ID. See\n            topRatedBuyingExperience for more information. price - This is\n            tracked by the revision ID but is returned here to enable you to\n            quickly verify the price of the item. estimatedAvailabilities -\n            Returns the item availability information, which is based on the\n            item's quantity. Changes in quantity are not tracked by the revision\n            ID. For Example To check if a stored item's information is current,\n            do following. Pass in the item ID and set fieldgroups to COMPACT.\n            item/v1|46566502948|0?fieldgroups=COMPACT Do one of the following:\n            If the sellerItemRevision field is returned and you haven't stored a\n            revision number for this item, record the number and pass in the\n            item ID in the getItem method to get the latest information. If the\n            revision number is different from the value you have stored, update\n            the value and pass in the item ID in the getItem method to get the\n            latest information. If the sellerItemRevision field is not returned\n            or has not changed, where needed, update the item information with\n            the information returned in the response. Maximum value: 1 If more\n            than one values is specified, the first value will be used.\"\n          in: query\n          name: fieldgroups\n          required: false\n          schema:\n            type: string\n        - description: \"The eBay RESTful identifier of an item. This ID is returned by the\n            Browse and Feed API methods. RESTful Item ID Format: v1|#|# For\n            example: v1|272394640372|0 or v1|162846450672|461882996982 For more\n            information about item ID for RESTful APIs, see the Legacy API\n            compatibility section of the Buy APIs Overview.\"\n          in: path\n          name: item_id\n          required: true\n          schema:\n            type: string\n      responses:\n        \"200\":\n          description: Success\n          x-response-codes:\n            errors:\n              \"11502\":\n                category: APPLICATION\n                description: There was a problem extracting product information for this\n                  Item. Please try again.\n                domain: API_BROWSE\n          content:\n            \"*/*\":\n              schema:\n                $ref: \"#/components/schemas/Item\"\n        \"400\":\n          description: Bad Request\n          x-response-codes:\n            errors:\n              \"11001\":\n                category: REQUEST\n                description: The specified item Id was not found.\n                domain: API_BROWSE\n              \"11004\":\n                category: REQUEST\n                description: The item is not available for purchase. This can be for many\n                  reasons, such as when the listing is being updated by the\n                  seller. Wait a few minutes and try the call again.\n                domain: API_BROWSE\n              \"11011\":\n                category: REQUEST\n                description: \"The marketplace value {marketplaceId} is not supported. The\n                  supported values are: {allowedMarketplaces}\"\n                domain: API_BROWSE\n              \"11501\":\n                category: REQUEST\n                description: \"The 'fieldgroups' value {fieldgroups} is invalid. The\n                  supported fieldgroups are: {supportedFieldgroups}\"\n                domain: API_BROWSE\n        \"404\":\n          description: Not Found\n        \"409\":\n          description: Conflict\n        \"500\":\n          description: Internal Server Error\n          x-response-codes:\n            errors:\n              \"11000\":\n                category: APPLICATION\n                description: There was a problem with an eBay internal system or process.\n                  Contact eBay developer support for assistance.\n                domain: API_BROWSE\n      security:\n        - Client_Credentials:\n            - https://api.ebay.com/oauth/api_scope\n      tags:\n        - item\n  \"/item/{item_id}/check_compatibility\":\n    post:\n      description: \"This method checks if a product is compatible with the specified item.\n        You can use this method to check the compatibility of cars, trucks, and\n        motorcycles with a specific part listed on eBay. For example, to check\n        the compatibility of a part, you pass in the item ID of the part as a\n        URI parameter and specify all the attributes used to define a specific\n        car in the compatibilityProperties container. If the call is successful,\n        the response will be COMPATIBLE, NOT_COMPATIBLE, or UNDETERMINED. See\n        compatibilityStatus for details. Note: The only products supported are\n        cars, trucks, and motorcycles. To find the attributes and values for a\n        specific marketplace, you can use the compatibility methods in the\n        Taxonomy API. You can use this data to create menus to help buyers\n        specify the product, such as their car. For more details and a list of\n        the required attributes for the US marketplace that describe motor\n        vehicles, see Check compatibility in the Buy Integration Guide. For an\n        example, see the Samples section. URLs for this method Production URL:\n        https://api.ebay.com/buy/browse/v1/item/ Note: This method is supported\n        only on Production. Restrictions For a list of supported sites and other\n        restrictions, see API Restrictions.\"\n      operationId: checkCompatibility\n      parameters:\n        - description: \"The eBay RESTful identifier of an item (such as a part you want to\n            check). This ID is returned by the Browse and Feed API methods.\n            RESTful Item ID Format: v1|#|# For example: v1|272394640372|0 or\n            v1|162846450672|461882996982 For more information about item ID for\n            RESTful APIs, see the Legacy API compatibility section of the Buy\n            APIs Overview.\"\n          in: path\n          name: item_id\n          required: true\n          schema:\n            type: string\n        - description: \"The ID of the eBay marketplace you want to use. Note: This value is\n            case sensitive. For example: \u0026nbsp;\u0026nbsp;X-EBAY-C-MARKETPLACE-ID =\n            EBAY_US For a list of supported sites see, API Restrictions.\"\n          in: header\n          name: X-EBAY-C-MARKETPLACE-ID\n          required: true\n          schema:\n            type: string\n      requestBody:\n        content:\n          application/json:\n            schema:\n              $ref: \"#/components/schemas/CompatibilityPayload\"\n      responses:\n        \"200\":\n          description: OK\n          x-response-codes:\n            errors:\n              \"11504\":\n                category: REQUEST\n                description: \"The following compatibilityProperties (attributes name/value\n                  pairs) are missing: {attributes}\"\n                domain: API_BROWSE\n          content:\n            \"*/*\":\n              schema:\n                $ref: \"#/components/schemas/CompatibilityResponse\"\n        \"400\":\n          description: Bad Request\n          x-response-codes:\n            errors:\n              \"11001\":\n                category: REQUEST\n                description: The specified item Id was not found.\n                domain: API_BROWSE\n              \"11011\":\n                category: REQUEST\n                description: \"The marketplace value {marketplaceId} is not supported. The\n                  supported values are: {allowedMarketplaces}\"\n                domain: API_BROWSE\n              \"11503\":\n                category: REQUEST\n                description: The request is either empty or incomplete. For help, see the\n                  documentation for this call.\n                domain: API_BROWSE\n              \"11505\":\n                category: REQUEST\n                description: The item is not valid for compatibility validation.\n                domain: API_BROWSE\n              \"11506\":\n                category: REQUEST\n                description: The 'name' {compatibilityNames} appears more than once in the\n                  request.\n                domain: API_BROWSE\n              \"11507\":\n                category: REQUEST\n                description: The following name(s) in the request are not supported\n                  {attributes}.\n                domain: API_BROWSE\n        \"404\":\n          description: Not Found\n        \"409\":\n          description: Conflict\n        \"500\":\n          description: Internal Server Error\n          x-response-codes:\n            errors:\n              \"11000\":\n                category: APPLICATION\n                description: There was a problem with an eBay internal system or process.\n                  Contact eBay developer support for assistance.\n                domain: API_BROWSE\n      security:\n        - Client_Credentials:\n            - https://api.ebay.com/oauth/api_scope\n      tags:\n        - item\n  /item_summary/search:\n    get:\n      description: \"This method searches for eBay items by various query parameters and\n        retrieves summaries of the items. You can search by keyword, category,\n        eBay product ID (ePID), or GTIN, charity ID, or a combination of these.\n        Note: Only FIXED_PRICE (Buy It Now) items are returned. However, the\n        method does return items where both FIXED_PRICE and AUCTION are\n        available as a buying option. But after a bid has been placed, that item\n        becomes an active auction item and is no longer returned. This method\n        also supports the following: Filtering by the value of one or multiple\n        fields, such as listing format, item condition, price range, location,\n        and more. For the fields supported by this method, see the filter\n        parameter. Retrieving the refinements (metadata) of an item , such as\n        item aspects (color, brand), condition, category, etc. using the\n        fieldgroups parameter. Filtering by item aspects and other refinements\n        using the aspect_filter parameter. Filtering for items that are\n        compatible with a specific product, using the compatibility_filter\n        parameter. Creating aspects histograms, which enables shoppers to drill\n        down in each refinement narrowing the search results. For details and\n        examples of these capabilities, see Browse API in the Buying Integration\n        Guide. Pagination and sort controls There are pagination controls (limit\n        and offset fields) and sort query parameters that control/sort the data\n        that is returned. By default, the results are sorted by \u0026quot;Best\n        Match\u0026quot;. For more information about Best Match, see the eBay help\n        page Best Match. URLs for this method Production URL:\n        https://api.ebay.com/buy/browse/v1/item_summary/ Sandbox URL:\n        https://api.sandbox.ebay.com/buy/browse/v1/item_summary/ Request headers\n        You will want to use the X-EBAY-C-ENDUSERCTX request header with this\n        method. This header enables eBay Network Partners to pass in their\n        identification in order to be paid for selling eBay items and it is\n        strongly recommended you use contextualLocation to improve the estimated\n        delivery window information. For details see, Request headers in the\n        Buying Integration Guide. Restrictions This method can return a maximum\n        of 10,000 items. For a list of supported sites and other restrictions,\n        see API Restrictions.\"\n      operationId: search\n      parameters:\n        - description: \"This field lets you filter by item aspects. The aspect name/value\n            pairs and category, which is required, is used to limit the results\n            to specific aspects of the item. For example, in a clothing category\n            one aspect pair would be Color/Red. For example, the method below\n            uses the category ID for Women's Clothing. This will return only\n            items for a woman's red shirt.\n            /buy/browse/v1/item_summary/search?q=shirt\u0026amp;category_ids=15724\u0026a\\\n            mp;aspect_filter=categoryId:15724,Color:{Red} To get a list of the\n            aspects pairs and the category, which is returned in the\n            dominantCategoryId field, set fieldgroups to ASPECT_REFINEMENTS.\n            /buy/browse/v1/item_summary/search?q=shirt\u0026amp;fieldgroups=ASPECT_R\\\n            EFINEMENTS Required: The category ID is required twice; once as a\n            URI parameter and as part of the aspect_filter. For implementation\n            help, refer to eBay API documentation at\n            https://developer.ebay.com/devzone/rest/api-ref/browse/types/Aspect\\\n            Filter.html\"\n          in: query\n          name: aspect_filter\n          required: false\n          schema:\n            type: string\n        - description: \"The category ID is used to limit the results. This field can have\n            one category ID or a comma separated list of IDs. For example:\n            /buy/browse/v1/item_summary/search?category_ids=29792 Note:\n            Currently, you can pass in only one category ID. You can also use\n            any combination of the category_Ids, epid, and q fields. This gives\n            you additional control over the result set. For example, let's say\n            you are looking of a toy phone. If you search for \u0026quot;phone\u0026quot;,\n            the result set will be mobile phones because this is the \u0026quot;Best\n            Match\u0026quot; for this search. But if you also include the toy\n            category ID, the results will be what you wanted. For example:\n            /buy/browse/v1/item_summary/search?q=phone\u0026amp;category_ids=220 The\n            list of eBay category IDs is not published and category IDs are not\n            the same across all the eBay marketplaces. You can use the following\n            techniques to find a category by site: Use the Category Changes\n            page. Use the Taxonomy API. For details see Get Categories for Buy\n            APIs. Submit the following method to get the dominantCategoryId for\n            an item. /buy/browse/v1/item_summary/search?q=\n            keyword\u0026amp;fieldgroups=ASPECT_REFINEMENTS Note: If a top-level (L1)\n            category is specified, you must also include the q query parameter.\n            Required: The method must have category_ids, epid, gtin, or q (or\n            any combination of these)\"\n          in: query\n          name: category_ids\n          required: false\n          schema:\n            type: string\n        - description: \"The charity ID is used to limit the results to only items\n            associated with the specified charity. This field can have one\n            charity ID or a comma separated list of IDs. The method will return\n            all the items associated with the specified charities. For example:\n            /buy/browse/v1/item_summary/search?charity_ids=13-1788491,300108469\n            The charity ID is the charity's registration ID, also known as the\n            Employer Identification Number (EIN). In GB, it is the Charity\n            Registration Number (CRN), commonly called \u0026quot;Charity\n            Number\u0026quot;. To find the charities eBay supports, you can search\n            for a charity at Charity Search or go to Charity Shop. To find the\n            charity ID of a specific charity, click on a charity and use the EIN\n            number. For example, the charity ID for American Red Cross, is\n            530196605. You can also use any combination of the category_Ids and\n            q fields with a charity_Ids to filter the result set. This gives you\n            additional control over the result set. Restriction: This is\n            supported only on the US and GB marketplaces. Maximum: 20 IDs\n            Required: One ID\"\n          in: query\n          name: charity_ids\n          required: false\n          schema:\n            type: string\n        - description: \"This field specifies the attributes used to define a specific\n            product. The service searches for items matching the keyword or\n            matching the keyword and a product attribute value in the title of\n            the item. For example, if the keyword is brakes and\n            compatibility-filter=Year:2018;Make:Honda, the items returned are\n            items with brakes, 2018, or Honda in the title. The service uses the\n            product attributes to determine if the item is compatible. The\n            service returns the attributes that are compatible and the\n            CompatibilityMatchEnum value that indicates how well the item\n            matches the attributes. For the best compatibility results, submit\n            all the attributes used to define the product. Best Practice: Submit\n            all the product attributes for the specific product. For more\n            details, see Check compatibility in the Buy Integration Guide. Note:\n            The only products supported are cars, trucks, and motorcycles. For\n            an example, see the Samples section. Note: Testing in Sandbox is\n            only supported using mock data. See Testing search in the Sandbox\n            for details. Required: q (keyword) one fitment supported category ID\n            (such as 33559 Brakes) a least one product attribute name/value pair\n            For implementation help, refer to eBay API documentation at\n            https://developer.ebay.com/devzone/rest/api-ref/browse/types/Compat\\\n            ibilityFilter.html\"\n          in: query\n          name: compatibility_filter\n          required: false\n          schema:\n            type: string\n        - description: \"The ePID is the eBay product identifier of a product from the eBay\n            product catalog. This field limits the results to only items in the\n            specified ePID. The Marketing API getMerchandisedProducts method and\n            the Browse API getItem, getItemByLegacyId, and getItemsByItemGroup\n            calls return the ePID of the product. You can also use the\n            product_summary/search method in the Catalog API to search for the\n            ePID of the product. For example:\n            /buy/browse/v1/item_summary/search?epid=15032 Maximum: 1 Required:\n            The method must have category_ids, epid, gtin, or q (or any\n            combination of these)\"\n          in: query\n          name: epid\n          required: false\n          schema:\n            type: string\n        - description: \"This field is a comma separated list of values that lets you\n            control what is returned in the response. The default is\n            MATCHING_ITEMS, which returns the items that match the keyword or\n            category specified. The other values return data that can be used to\n            create histograms or provide additional information. Valid Values:\n            ASPECT_REFINEMENTS - This returns the aspectDistributions container,\n            which has the dominantCategoryId, matchCount, and refinementHref for\n            the various aspects of the items found. For example, if you searched\n            for 'Mustang', some of the aspect would be Model Year, Exterior\n            Color, Vehicle Mileage, etc. Note: ASPECT_REFINEMENTS are category\n            specific. BUYING_OPTION_REFINEMENTS - This returns the\n            buyingOptionDistributions container, which has the matchCount and\n            refinementHref for AUCTION and FIXED_PRICE (Buy It Now) items. Note:\n            Classified items are not supported and only \u0026quot;Buy It Now\u0026quot;\n            (non-auction) items are returned. CATEGORY_REFINEMENTS - This\n            returns the categoryDistributions container, which has the\n            categories that the item is in. CONDITION_REFINEMENTS - This returns\n            the conditionDistributions container, such as NEW, USED, etc. Within\n            these groups are multiple states of the condition. For example, New\n            can be New without tag, New in box, New without box, etc. EXTENDED -\n            This returns the shortDescription field, which provides condition\n            and item aspect information and the itemLocation.city field.\n            MATCHING_ITEMS - This is meant to be used with one or more of the\n            refinement values above. You use this to return the specified\n            refinements and all the matching items. FULL - This returns all the\n            refinement containers and all the matching items. Code so that your\n            app gracefully handles any future changes to this list. Default:\n            MATCHING_ITEMS\"\n          in: query\n          name: fieldgroups\n          required: false\n          schema:\n            type: string\n        - description: \"This field supports multiple field filters that can be used to\n            limit/customize the result set. For example:\n            /buy/browse/v1/item_summary/search?q=shirt\u0026amp;filter=price:[10..50]\n            You can also combine filters.\n            /buy/browse/v1/item_summary/search?q=shirt\u0026amp;filter=price:[10..50\\\n            ],sellers:{rpseller|bigSal} The following are the supported filters.\n            For details and examples for all the filters, see Buy API Field\n            Filters. buyingOptions charityOnly conditionIds conditions\n            deliveryCountry deliveryOptions deliveryPostalCode\n            excludeCategoryIds excludeSellers itemEndDate itemLocationCountry\n            itemStartDate paymentMethods pickupCountry pickupPostalCode\n            pickupRadius pickupRadiusUnit price priceCurrency maxDeliveryCost\n            (free shipping) returnsAccepted sellerAccountTypes sellers For\n            implementation help, refer to eBay API documentation at\n            https://developer.ebay.com/devzone/rest/api-ref/browse/types/Filter\\\n            Field.html\"\n          in: query\n          name: filter\n          required: false\n          schema:\n            type: string\n        - description: \"This field lets you search by the Global Trade Item Number of the\n            item as defined by https://www.gtin.info. You can search only by UPC\n            (Universal Product Code). If you have other formats of GTIN, you\n            need to search by keyword. For example:\n            /buy/browse/v1/item_summary/search?gtin=099482432621 Maximum: 1\n            Required: The method must have category_ids, epid, gtin, or q (or\n            any combination of these)\"\n          in: query\n          name: gtin\n          required: false\n          schema:\n            type: string\n        - description: \"The number of items, from the result set, returned in a single\n            page. Default: 50 Maximum number of items per page (limit): 200\n            Maximum number of items in a result set: 10,000\"\n          in: query\n          name: limit\n          required: false\n          schema:\n            type: string\n        - description: \"Specifies the number of items to skip in the result set. This is\n            used with the limit field to control the pagination of the output.\n            If offset is 0 and limit is 10, the method will retrieve items 1-10\n            from the list of items returned, if offset is 10 and limit is 10,\n            the method will retrieve items 11 thru 20 from the list of items\n            returned. Valid Values: 0-10,000 (inclusive) Default: 0 Maximum\n            number of items returned: 10,000\"\n          in: query\n          name: offset\n          required: false\n          schema:\n            type: string\n        - description: \"A string consisting of one or more keywords that are used to search\n            for items on eBay. The keywords are handled as follows: If the\n            keywords are separated by a comma, it is treated as an AND. In the\n            following example, the query returns items that have iphone AND\n            ipad. /buy/browse/v1_beta/item_summary/search?q=iphone,ipad If the\n            keywords are separated by a space, it is treated as an OR. In the\n            following examples, the query returns items that have iphone OR\n            ipad. /buy/browse/v1_beta/item_summary/search?q=iphone\u0026nbsp;ipad\n            /buy/browse/v1_beta/item_summary/search?q=iphone,\u0026nbsp;ipad\n            Restriction: The * wildcard character is not allowed in this field.\n            Required: The method must have category_ids, epid, gtin, or q (or\n            any combination of these)\"\n          in: query\n          name: q\n          required: false\n          schema:\n            type: string\n        - description: \"Specifies the order and the field name to use to sort the items. To\n            sort in descending order use - before the field name. Currently, you\n            can only sort by price (in ascending or descending order), or by\n            distance (only applicable if the \u0026quot;pickup\u0026quot; filters are\n            used, and only ascending order is supported). If no sort parameter\n            is submitted, the result set is sorted by \u0026quot;Best Match\u0026quot;.\n            The following are examples of using the sort query parameter. Sort\n            Result sort=price Sorts by price in ascending order (lowest price\n            first) sort=-price Sorts by price in descending order (highest price\n            first) sort=distance Sorts by distance in ascending order (shortest\n            distance first) Default: ascending For implementation help, refer to\n            eBay API documentation at\n            https://developer.ebay.com/devzone/rest/api-ref/browse/types/SortFi\\\n            eld.html\"\n          in: query\n          name: sort\n          required: false\n          schema:\n            type: string\n      responses:\n        \"200\":\n          description: OK\n          x-response-codes:\n            errors:\n              \"12002\":\n                category: REQUEST\n                description: The {filterName} value is invalid. For the valid values, refer\n                  to the API call documentation.\n                domain: API_BROWSE\n              \"12003\":\n                category: REQUEST\n                description: A seller 'username' provided in the request filters is invalid.\n                domain: API_BROWSE\n              \"12008\":\n                category: REQUEST\n                description: The 'sort' value is invalid. For the valid values, refer to\n                  the API call documentation.\n                domain: API_BROWSE\n              \"12009\":\n                category: REQUEST\n                description: The 'category_ids' query parameter is invalid.\n                domain: API_BROWSE\n              \"12010\":\n                category: REQUEST\n                description: There are four filters required for local pickup.\n                  'pickupPostalCode','pickupCountry','pickupRadiusUnit','pickupRadius'.\n                  One or more is missing or invalid.\n                domain: API_BROWSE\n              \"12011\":\n                category: REQUEST\n                description: \"'deliveryCountry' is a mandatory filter to provide a delivery\n                  location. 'deliveryPostalCode' is optional.\"\n                domain: API_BROWSE\n              \"12012\":\n                category: REQUEST\n                description: A valid 'price' filter and a valid 'priceCurrency' filter is\n                  necessary to filter based on price.\n                domain: API_BROWSE\n              \"12014\":\n                category: BUSINESS\n                description: \"The 'sellerAccountTypes' filter is not supported for the\n                  marketplace {marketplaceId}. Valid marketplaces are:\n                  {validMarketplaces}\"\n                domain: API_BROWSE\n              \"12015\":\n                category: REQUEST\n                description: The postal code filter value is invalid for the specified\n                  country and this filter was ignored.\n                domain: API_BROWSE\n              \"12016\":\n                category: REQUEST\n                description: The 'fieldgroups' value {fieldgroups} is invalid. For the\n                  valid values, refer to the API call reference documentation\n                domain: API_BROWSE\n              \"12017\":\n                category: REQUEST\n                description: The 'aspect_filter' query parameter must include a categoryId.\n                  For information, see the API call reference documentation.\n                domain: API_BROWSE\n              \"12018\":\n                category: REQUEST\n                description: The {aspectFilter} aspect_filter value is invalid. For\n                  information, see the API call reference documentation.\n                domain: API_BROWSE\n              \"12021\":\n                category: REQUEST\n                description: The 'epid' value {epid} is invalid. For information, see the\n                  API call reference documentation.\n                domain: API_BROWSE\n              \"12022\":\n                category: REQUEST\n                description: The 'gtin' value {gtin} is invalid. For information, see the\n                  API call reference documentation.\n                domain: API_BROWSE\n              \"12024\":\n                category: REQUEST\n                description: The 'charity_ids' value {charity_id} is invalid. For more\n                  information see the API call reference documentation.\n                domain: API_BROWSE\n              \"12502\":\n                category: REQUEST\n                description: The {compatibilityFilter} compatibility_filter is invalid. For\n                  information, see the API call reference documentation.\n                domain: API_BROWSE\n          content:\n            \"*/*\":\n              schema:\n                $ref: \"#/components/schemas/SearchPagedCollection\"\n        \"400\":\n          description: Bad Request\n          x-response-codes:\n            errors:\n              \"12001\":\n                category: REQUEST\n                description: The call must have a valid 'q', 'category_ids', 'epid' or\n                  'gtin' query parameter.\n                domain: API_BROWSE\n              \"12004\":\n                category: REQUEST\n                description: The 'offset' value cannot be negative.\n                domain: API_BROWSE\n              \"12005\":\n                category: REQUEST\n                description: The 'offset' value must be an integer.\n                domain: API_BROWSE\n              \"12006\":\n                category: REQUEST\n                description: The 'limit' value should be between 1 and 200 (inclusive).\n                domain: API_BROWSE\n              \"12007\":\n                category: REQUEST\n                description: The 'limit' value must be an integer value.\n                domain: API_BROWSE\n              \"12023\":\n                category: REQUEST\n                description: This keyword search results in a response that is too large to\n                  return. Either change the keyword or add additional query\n                  parameters and/or filters.\n                domain: API_BROWSE\n              \"12025\":\n                category: REQUEST\n                description: The 'charity_ids' field has exceeded the maximum limit of 20.\n                domain: API_BROWSE\n              \"12026\":\n                category: REQUEST\n                description: \"The 'charity_ids' field is not supported for the marketplace\n                  {marketplaceId}. Valid marketplaces are: {validMarketplaces}.\"\n                domain: API_BROWSE\n              \"12503\":\n                category: REQUEST\n                description: There is no compatibility information found either because\n                  there is no compatibility results or the data provided in the\n                  compatibility_filter is invalid or insufficient.\n                domain: API_BROWSE\n              \"12504\":\n                category: REQUEST\n                description: You must provide a category ID that supports fitment.\n                domain: API_BROWSE\n              \"12505\":\n                category: REQUEST\n                description: \"The following compatibility attributes in the request are not\n                  supported: {attributes}.\"\n                domain: API_BROWSE\n              \"12506\":\n                category: REQUEST\n                description: The category ID submitted does not support fitment.\n                domain: API_BROWSE\n        \"409\":\n          description: Conflict\n          x-response-codes:\n            errors:\n              \"12013\":\n                category: BUSINESS\n                description: Top level category browsing is not allowed. Please provide\n                  keywords or more filters for the applied top level category.\n                domain: API_BROWSE\n              \"12019\":\n                category: BUSINESS\n                description: \"Currently, the {marketplaceId} marketplace is not supported.\n                  The supported Marketplaces are: {allowedMarketplaces} .\"\n                domain: API_BROWSE\n              \"12020\":\n                category: BUSINESS\n                description: The 'fieldgroups' value {fieldgroups} is invalid when multiple\n                  'category_ids' are specified. Either change the call to have\n                  only one value in 'category_ids' or remove the 'fieldgroups'.\n                domain: API_BROWSE\n        \"500\":\n          description: Internal Server Error\n          x-response-codes:\n            errors:\n              \"12000\":\n                category: APPLICATION\n                description: There was a problem with an eBay internal system or process.\n                  Contact eBay developer support for assistance.\n                domain: API_BROWSE\n      security:\n        - Client_Credentials:\n            - https://api.ebay.com/oauth/api_scope\n      tags:\n        - item_summary\n  /item_summary/search_by_image:\n    post:\n      description: \"This is an Experimental method. This method searches for eBay items\n        based on a image and retrieves summaries of the items. You pass in a\n        Base64 image in the request payload and can refine the search by\n        category, or eBay product ID (ePID), or a combination of these using URI\n        parameters. To get the Base64 image string, you can use sites such as\n        https://codebeautify.org/image-to-base64-converter. This method also\n        supports the following: Filtering by the value of one or multiple\n        fields, such as listing format, item condition, price range, location,\n        and more. For the fields supported by this method, see the filter\n        parameter. Filtering by item aspects using the aspect_filter parameter.\n        For details and examples of these capabilities, see Browse API in the\n        Buying Integration Guide. Pagination and sort controls There are\n        pagination controls (limit and offset fields) and sort query parameters\n        that control/sort the data that is returned. By default, the results are\n        sorted by \u0026quot;Best Match\u0026quot;. For more information about Best Match,\n        see the eBay help page Best Match. URLs for this method Production URL:\n        https://api.ebay.com/buy/browse/v1/item_summary/search_by_image/ Sandbox\n        URL: Due to the data available, this method is not supported in the eBay\n        Sandbox. To test your integration, use the Production URL. Request\n        headers You will want to use the X-EBAY-C-ENDUSERCTX request header with\n        this method. This header enables eBay Network Partners to pass in their\n        identification in order to be paid for selling eBay items and it is\n        strongly recommended you use contextualLocation to improve the estimated\n        delivery window information. For details see, Request headers in the\n        Buying Integration Guide. URL Encoding for Parameters Query parameter\n        values need to be URL encoded. For details, see URL encoding query\n        parameter values. For readability, code examples in this document have\n        not been URL encoded. Restrictions This method can return a maximum of\n        10,000 items. For a list of supported sites and other restrictions, see\n        API Restrictions.\"\n      operationId: searchByImage\n      parameters:\n        - description: \"This field lets you filter by item aspects. The aspect name/value\n            pairs and category, which is required, is used to limit the results\n            to specific aspects of the item. For example, in a clothing category\n            one aspect pair would be Color/Red. For example, the method below\n            uses the category ID for Women's Clothing. This will return only\n            items for a woman's red shirt.\n            category_ids=15724\u0026amp;aspect_filter=categoryId:15724,Color:{Red}\n            Required: The category ID is required twice; once as a URI parameter\n            and as part of the aspect_filter. For implementation help, refer to\n            eBay API documentation at\n            https://developer.ebay.com/devzone/rest/api-ref/browse/types/Aspect\\\n            Filter.html\"\n          in: query\n          name: aspect_filter\n          required: false\n          schema:\n            type: string\n        - description: \"The category ID is used to limit the results. This field can have\n            one category ID or a comma separated list of IDs. Note: Currently,\n            you can pass in only one category ID. You can also use any\n            combination of the category_Ids and epid fields. This gives you\n            additional control over the result set. The list of eBay category\n            IDs is not published and category IDs are not the same across all\n            the eBay marketplaces. You can use the following techniques to find\n            a category by site: Use the Category Changes page. Use the Taxonomy\n            API. For details see Get Categories for Buy APIs. Submit the\n            following method to get the dominantCategoryId for an item.\n            /buy/browse/v1/item_summary/search?q=\n            keyword\u0026amp;fieldgroups=ASPECT_REFINEMENTS Required: The method must\n            have category_ids or epid (or any combination of these)\"\n          in: query\n          name: category_ids\n          required: false\n          schema:\n            type: string\n        - description: \"The ePID is the eBay product identifier of a product from the eBay\n            product catalog. This field limits the results to only items in the\n            specified ePID. The Marketing API getMerchandisedProducts method and\n            the Browse API getItem, getItemByLegacyId, and getItemsByItemGroup\n            calls return the ePID of the product. You can also use the\n            product_summary/search method in the Catalog API to search for the\n            ePID of the product. Maximum: 1\"\n          in: query\n          name: epid\n          required: false\n          schema:\n            type: string\n        - description: \"This field supports multiple field filters that can be used to\n            limit/customize the result set. For example: filter=price:[10..50]\n            You can also combine filters.\n            filter=price:[10..50],sellers:{rpseller|bigSal} The following are\n            the supported filters. For details and examples for all the filters,\n            see Buy API Field Filters. buyingOptions conditionIds conditions\n            deliveryCountry deliveryOptions deliveryPostalCode\n            excludeCategoryIds excludeSellers itemEndDate itemLocationCountry\n            itemStartDate paymentMethods pickupCountry pickupPostalCode\n            pickupRadius pickupRadiusUnit price priceCurrency maxDeliveryCost\n            (free shipping) returnsAccepted sellerAccountTypes sellers For\n            implementation help, refer to eBay API documentation at\n            https://developer.ebay.com/devzone/rest/api-ref/browse/types/Filter\\\n            Field.html\"\n          in: query\n          name: filter\n          required: false\n          schema:\n            type: string\n        - description: \"The number of items, from the result set, returned in a single\n            page. Default: 50 Maximum number of items per page (limit): 200\n            Maximum number of items in a result set: 10,000\"\n          in: query\n          name: limit\n          required: false\n          schema:\n            type: string\n        - description: \"The number of items to skip in the result set. This is used with\n            the limit field to control the pagination of the output. If offset\n            is 0 and limit is 10, the method will retrieve items 1-10 from the\n            list of items returned, if offset is 10 and limit is 10, the method\n            will retrieve items 11 thru 20 from the list of items returned.\n            Valid Values: 0-10,000 (inclusive) Default: 0 Maximum number of\n            items returned: 10,000\"\n          in: query\n          name: offset\n          required: false\n          schema:\n            type: string\n        - description: \"Specifies the order and the field name to use to sort the items. To\n            sort in descending order use - before the field name. Currently, you\n            can only sort by price (in ascending or descending order), or by\n            distance (only applicable if the \u0026quot;pickup\u0026quot; filters are\n            used, and only ascending order is supported). If no sort parameter\n            is submitted, the result set is sorted by \u0026quot;Best Match\u0026quot;.\n            The following are examples of using the sort query parameter. Sort\n            Result sort=price Sorts by price in ascending order (lowest price\n            first) sort=-price Sorts by price in descending order (highest price\n            first) sort=distance Sorts by distance in ascending order (shortest\n            distance first) Default: ascending For implementation help, refer to\n            eBay API documentation at\n            https://developer.ebay.com/devzone/rest/api-ref/browse/types/SortFi\\\n            eld.html\"\n          in: query\n          name: sort\n          required: false\n          schema:\n            type: string\n      requestBody:\n        content:\n          application/json:\n            schema:\n              $ref: \"#/components/schemas/SearchByImageRequest\"\n        description: The container for the image information fields.\n      responses:\n        \"200\":\n          description: OK\n          x-response-codes:\n            errors:\n              \"12002\":\n                category: REQUEST\n                description: The {filterName} value is invalid. For the valid values, refer\n                  to the API call documentation.\n                domain: API_BROWSE\n              \"12003\":\n                category: REQUEST\n                description: A seller 'username' provided in the request filters is invalid.\n                domain: API_BROWSE\n              \"12008\":\n                category: REQUEST\n                description: The 'sort' value is invalid. For the valid values, refer to\n                  the API call documentation.\n                domain: API_BROWSE\n              \"12009\":\n                category: REQUEST\n                description: The 'category_ids' query parameter is invalid.\n                domain: API_BROWSE\n              \"12010\":\n                category: REQUEST\n                description: There are four filters required for local pickup.\n                  'pickupPostalCode','pickupCountry','pickupRadiusUnit','pickupRadius'.\n                  One or more is missing or invalid.\n                domain: API_BROWSE\n              \"12011\":\n                category: REQUEST\n                description: \"'deliveryCountry' is a mandatory filter to provide a delivery\n                  location. 'deliveryPostalCode' is optional.\"\n                domain: API_BROWSE\n              \"12012\":\n                category: REQUEST\n                description: A valid 'price' filter and a valid 'priceCurrency' filter is\n                  necessary to filter based on price.\n                domain: API_BROWSE\n              \"12014\":\n                category: BUSINESS\n                description: \"The 'sellerAccountTypes' filter is not supported for the\n                  marketplace {marketplaceId}. Valid marketplaces are:\n                  {validMarketplaces}\"\n                domain: API_BROWSE\n              \"12015\":\n                category: REQUEST\n                description: The postal code filter value is invalid for the specified\n                  country and this filter was ignored.\n                domain: API_BROWSE\n              \"12017\":\n                category: REQUEST\n                description: The 'aspect_filter' query parameter must include a categoryId.\n                  For information, see the API call reference documentation.\n                domain: API_BROWSE\n              \"12018\":\n                category: REQUEST\n                description: The {aspectFilter} aspect_filter value is invalid. For\n                  information, see the API call reference documentation.\n                domain: API_BROWSE\n              \"12021\":\n                category: REQUEST\n                description: The 'epid' value {epid} is invalid. For information, see the\n                  API call reference documentation.\n                domain: API_BROWSE\n          content:\n            \"*/*\":\n              schema:\n                $ref: \"#/components/schemas/SearchPagedCollection\"\n        \"400\":\n          description: Bad Request\n          x-response-codes:\n            errors:\n              \"12004\":\n                category: REQUEST\n                description: The 'offset' value cannot be negative.\n                domain: API_BROWSE\n              \"12005\":\n                category: REQUEST\n                description: The 'offset' value must be an integer.\n                domain: API_BROWSE\n              \"12006\":\n                category: REQUEST\n                description: The 'limit' value should be between 1 and 200 (inclusive).\n                domain: API_BROWSE\n              \"12007\":\n                category: REQUEST\n                description: The 'limit' value must be an integer value.\n                domain: API_BROWSE\n              \"12500\":\n                category: REQUEST\n                description: This image search results in a response that is too large to\n                  return. Either change the image or add additional query\n                  parameters and/or filters.\n                domain: API_BROWSE\n              \"12501\":\n                category: REQUEST\n                description: The image data is empty, is not Base64 encoded, or is invalid.\n                domain: API_BROWSE\n        \"409\":\n          description: Conflict\n          x-response-codes:\n            errors:\n              \"12013\":\n                category: BUSINESS\n                description: Top level category browsing is not allowed. Please provide\n                  keywords or more filters for the applied top level category.\n                domain: API_BROWSE\n              \"12019\":\n                category: BUSINESS\n                description: \"Currently, the {marketplaceId} marketplace is not supported.\n                  The supported Marketplaces are: {allowedMarketplaces} .\"\n                domain: API_BROWSE\n        \"500\":\n          description: Internal Server Error\n          x-response-codes:\n            errors:\n              \"12000\":\n                category: APPLICATION\n                description: There was a problem with an eBay internal system or process.\n                  Contact eBay developer support for assistance.\n                domain: API_BROWSE\n      security:\n        - Client_Credentials:\n            - https://api.ebay.com/oauth/api_scope\n      tags:\n        - search_by_image\n  /shopping_cart/:\n    get:\n      description: \"This is an experimental method. This method retrieves all the items in\n        the eBay member's cart; items added to the cart while on ebay.com as\n        well as items added to the cart using the Browse API. There are no URI\n        parameters or request payload. The response returns the summary details\n        of all the items in the eBay member's cart; items added to the cart\n        while on ebay.com as well as items added to the cart using the Browse\n        API. If the cart is empty, the response is HTTP 204. The quantity and\n        state of an item changes often. If the item becomes\n        \u0026quot;unavailable\u0026quot; such as, when the listing has ended or the item\n        is out of stock, the item will be returned in the unavailableCartItems\n        container. URLs for this method Production URL:\n        https://api.ebay.com/buy/browse/v1/shopping_cart/ Sandbox URL:\n        https://api.sandbox.ebay.com/buy/browse/v1/shopping_cart/ Note: This\n        method is not available in the eBay API Explorer. Restrictions This\n        method can be used only for eBay members. For a list of supported sites\n        and other restrictions, see API Restrictions.\"\n      operationId: getShoppingCart\n      responses:\n        \"200\":\n          description: OK\n          x-response-codes:\n            errors:\n              \"10004\":\n                category: BUSINESS\n                description: The item {itemId} is not available for purchase. This can be\n                  for several reason such as, the listing has ended or the item\n                  is out of stock.\n                domain: API_BROWSE\n              \"10005\":\n                category: BUSINESS\n                description: The item {itemId} is revised.\n                domain: API_BROWSE\n              \"10006\":\n                category: BUSINESS\n                description: The item {itemId} in your cart is not available in the\n                  quantity specified. The quantity of this item has been changed\n                  to the quantity that is currently available. Please review\n                  this change before proceeding to checkout.\n                domain: API_BROWSE\n              \"10020\":\n                category: BUSINESS\n                description: The buyer is blocked from purchasing the item {itemId}.\n                domain: API_BROWSE\n              \"10024\":\n                category: BUSINESS\n                description: The buyer is blocked from purchasing the item {itemId} because\n                  the seller does not ship to the buyer's location.\n                domain: API_BROWSE\n              \"10025\":\n                category: REQUEST\n                description: \"The header 'X-EBAY-C-MARKETPLACE-ID' is required. The valid\n                  Marketplaces are: {supportedValues}.\"\n                domain: API_BROWSE\n          content:\n            \"*/*\":\n              schema:\n                $ref: \"#/components/schemas/RemoteShopcartResponse\"\n        \"204\":\n          description: No Content\n        \"400\":\n          description: Bad Request\n          x-response-codes:\n            errors:\n              \"10001\":\n                category: REQUEST\n                description: \"The X-EBAY-C-MARKETPLACE-ID value is not supported. The\n                  supported values are: {supportedValues}.\"\n                domain: API_BROWSE\n              \"10002\":\n                category: REQUEST\n                description: Insufficient permissions to fulfill the request.\n                domain: API_BROWSE\n        \"403\":\n          description: Forbidden\n        \"404\":\n          description: Not Found\n        \"500\":\n          description: Internal Server Error\n          x-response-codes:\n            errors:\n              \"10000\":\n                category: APPLICATION\n                description: There was a problem with an eBay internal system or process.\n                  Contact eBay developer support for assistance.\n                domain: API_BROWSE\n      security:\n        - Authorization_Code:\n            - https://api.ebay.com/oauth/api_scope/buy.shopping.cart\n      tags:\n        - shopping_cart\n  /shopping_cart/add_item:\n    post:\n      description: \"This is an Experimental method. This method creates an eBay cart for\n        the eBay member, if one does not exist, and adds items to that cart.\n        Because a cart never expires, any item added to the cart will remain in\n        the cart until it is removed. To use this method, you must submit a\n        RESTful item ID and the quantity of the item. If the quantity value is\n        greater than the number of available, the quantity value is changed to\n        the number available and a warning is returned. For example, if there\n        are 15 baseballs available and you set the quantity value to 50, the\n        service automatically changes the value of quantity to 15. The response\n        returns all the items in the eBay member's cart; items added to the cart\n        while on ebay.com as well as items added to the cart using the Browse\n        API. The quantity and state of an item changes often. If the item\n        becomes \u0026quot;unavailable\u0026quot; such as, when the listing has ended or\n        the item is out of stock, whether it has just been added to the cart or\n        has been in the cart for some time, the item will be returned in the\n        unavailableCartItems container. Note: There are differences between how\n        legacy APIs, such as Finding, and RESTful APIs, such as Browse, return\n        the identifier of an \u0026quot;item\u0026quot; and what the item ID represents.\n        If you have an item ID from one of the legacy APIs, you can use the\n        legacy item ID with the getItemByLegacyId method to retrieve the RESTful\n        ID for that item. For more information about how to use legacy IDs with\n        the Buy APIs, see Legacy API compatibility in the Buying Integration\n        guide. URLs for this method Production URL:\n        https://api.ebay.com/buy/browse/v1/shopping_cart/ Sandbox URL:\n        https://api.sandbox.ebay.com/buy/browse/v1/shopping_cart/ Note: This\n        method is not available in the eBay API Explorer. Restrictions This\n        method can be used only for eBay members. You can add only items with a\n        FIXED_PRICE that accept PayPal as a payment. For a list of supported\n        sites and other restrictions, see API Restrictions.\"\n      operationId: addItem\n      requestBody:\n        content:\n          application/json:\n            schema:\n              $ref: \"#/components/schemas/AddCartItemInput\"\n      responses:\n        \"200\":\n          description: OK\n          x-response-codes:\n            errors:\n              \"10004\":\n                category: BUSINESS\n                description: The item {itemId} is not available for purchase. This can be\n                  for several reason such as, the listing has ended or the item\n                  is out of stock.\n                domain: API_BROWSE\n              \"10005\":\n                category: BUSINESS\n                description: The item {itemId} is revised.\n                domain: API_BROWSE\n              \"10006\":\n                category: BUSINESS\n                description: The item {itemId} in your cart is not available in the\n                  quantity specified. The quantity of this item has been changed\n                  to the quantity that is currently available. Please review\n                  this change before proceeding to checkout.\n                domain: API_BROWSE\n              \"10020\":\n                category: BUSINESS\n                description: The buyer is blocked from purchasing the item {itemId}.\n                domain: API_BROWSE\n              \"10024\":\n                category: BUSINESS\n                description: The buyer is blocked from purchasing the item {itemId} because\n                  the seller does not ship to the buyer's location.\n                domain: API_BROWSE\n          content:\n            \"*/*\":\n              schema:\n                $ref: \"#/components/schemas/RemoteShopcartResponse\"\n        \"204\":\n          description: No Content\n        \"400\":\n          description: Bad Request\n          x-response-codes:\n            errors:\n              \"10001\":\n                category: REQUEST\n                description: \"The X-EBAY-C-MARKETPLACE-ID value is not supported. The\n                  supported values are: {supportedValues}.\"\n                domain: API_BROWSE\n              \"10002\":\n                category: REQUEST\n                description: Insufficient permissions to fulfill the request.\n                domain: API_BROWSE\n              \"10007\":\n                category: REQUEST\n                description: \"The field: {field} is required. Add the field and resubmit\n                  the call.\"\n                domain: API_BROWSE\n              \"10008\":\n                category: REQUEST\n                description: The item ID {itemId} is invalid.\n                domain: API_BROWSE\n              \"10009\":\n                category: REQUEST\n                description: The quantity value is invalid. The quantity must be greater\n                  than 0.\n                domain: API_BROWSE\n              \"10010\":\n                category: REQUEST\n                description: The item does not exist.\n                domain: API_BROWSE\n              \"10025\":\n                category: REQUEST\n                description: \"The header 'X-EBAY-C-MARKETPLACE-ID' is required. The valid\n                  Marketplaces are: {supportedValues}.\"\n                domain: API_BROWSE\n        \"403\":\n          description: Insufficient permissions to fulfill the request\n        \"409\":\n          description: Conflict\n          x-response-codes:\n            errors:\n              \"10011\":\n                category: BUSINESS\n                description: The item {itemId} is already in the shopping cart. To change\n                  the quantity of the item, use the updateQuantity call.\n                domain: API_BROWSE\n              \"10016\":\n                category: BUSINESS\n                description: You have exceeded the maximum number of items in a cart, which\n                  is {MaxCartIems}. To add more items, either remove or purchase\n                  some of the items in the cart.\n                domain: API_BROWSE\n              \"10017\":\n                category: BUSINESS\n                description: The item does not meet the cart criteria and cannot be added\n                  to the cart.\n                domain: API_BROWSE\n              \"10018\":\n                category: BUSINESS\n                description: There is a limit on the quantity of this item that can be\n                  purchased. The quantity specified exceeds this limit.\n                domain: API_BROWSE\n              \"10019\":\n                category: BUSINESS\n                description: The buyer is blocked from purchasing the item you are trying\n                  to add to the cart.\n                domain: API_BROWSE\n              \"10021\":\n                category: BUSINESS\n                description: The item you are trying to add is not available in the\n                  quantity specified. Please adjust the quantity and try again.\n                domain: API_BROWSE\n              \"10022\":\n                category: BUSINESS\n                description: The item you are trying to add is not available for purchase.\n                  This can be for several reason such as, the listing has ended\n                  or the item is out of stock.\n                domain: API_BROWSE\n              \"10023\":\n                category: BUSINESS\n                description: The buyer is blocked from purchasing the item because the\n                  seller does not ship to the buyer's location.\n                domain: API_BROWSE\n        \"500\":\n          description: Internal Server Error\n          x-response-codes:\n            errors:\n              \"10000\":\n                category: APPLICATION\n                description: There was a problem with an eBay internal system or process.\n                  Contact eBay developer support for assistance.\n                domain: API_BROWSE\n      security:\n        - Authorization_Code:\n            - https://api.ebay.com/oauth/api_scope/buy.shopping.cart\n      tags:\n        - shopping_cart\n  /shopping_cart/remove_item:\n    post:\n      description: \"This is an experimental method. This method removes a specific item\n        from the eBay member's cart. You specify the ID of the item in the cart\n        (cartItemId) that you want to remove. The response returns all the items\n        in the eBay member's cart; items added to the cart while on ebay.com as\n        well as items added to the cart using the Browse API. If you remove the\n        last item in the cart, the response is HTTP 204. The quantity and state\n        of an item changes often. If the item becomes \u0026quot;unavailable\u0026quot;\n        such as, when the listing has ended or the item is out of stock, the\n        item will be returned in the unavailableCartItems container. Note: The\n        cartItemId is not the same as the item ID. The cartItemId is the\n        identifier of a specific item in the cart and is generated when the item\n        was added to the cart. URLs for this method Production URL:\n        https://api.ebay.com/buy/browse/v1/shopping_cart/ Sandbox URL:\n        https://api.sandbox.ebay.com/buy/browse/v1/shopping_cart/ Note: This\n        method is not available in the eBay API Explorer. Restrictions This\n        method can be used only for eBay members. For a list of supported sites\n        and other restrictions, see API Restrictions.\"\n      operationId: removeItem\n      requestBody:\n        content:\n          application/json:\n            schema:\n              $ref: \"#/components/schemas/RemoveCartItemInput\"\n      responses:\n        \"200\":\n          description: OK\n          x-response-codes:\n            errors:\n              \"10004\":\n                category: BUSINESS\n                description: The item {itemId} is not available for purchase. This can be\n                  for several reason such as, the listing has ended or the item\n                  is out of stock.\n                domain: API_BROWSE\n              \"10005\":\n                category: BUSINESS\n                description: The item {itemId} is revised.\n                domain: API_BROWSE\n              \"10006\":\n                category: BUSINESS\n                description: The item {itemId} in your cart is not available in the\n                  quantity specified. The quantity of this item has been changed\n                  to the quantity that is currently available. Please review\n                  this change before proceeding to checkout..\n                domain: API_BROWSE\n              \"10020\":\n                category: BUSINESS\n                description: The buyer is blocked from purchasing the item {itemId}.\n                domain: API_BROWSE\n              \"10024\":\n                category: BUSINESS\n                description: The buyer is blocked from purchasing the item {itemId} because\n                  the seller does not ship to the buyer's location.\n                domain: API_BROWSE\n          content:\n            \"*/*\":\n              schema:\n                $ref: \"#/components/schemas/RemoteShopcartResponse\"\n        \"204\":\n          description: No Content\n        \"400\":\n          description: Bad Request\n          x-response-codes:\n            errors:\n              \"10001\":\n                category: REQUEST\n                description: \"The X-EBAY-C-MARKETPLACE-ID value is not supported. The\n                  supported values are: {supportedValues}.\"\n                domain: API_BROWSE\n              \"10002\":\n                category: REQUEST\n                description: Insufficient permissions to fulfill the request.\n                domain: API_BROWSE\n              \"10007\":\n                category: REQUEST\n                description: \"The field: {field} is required. Add the field and resubmit\n                  the call.\"\n                domain: API_BROWSE\n              \"10012\":\n                category: REQUEST\n                description: The value of 'cartItemId' {cartItemId} is invalid.\n                domain: API_BROWSE\n              \"10025\":\n                category: REQUEST\n                description: \"The header 'X-EBAY-C-MARKETPLACE-ID' is required. The valid\n                  Marketplaces are: {supportedValues}.\"\n                domain: API_BROWSE\n        \"403\":\n          description: Insufficient permissions to fulfill the request\n        \"409\":\n          description: Conflict\n          x-response-codes:\n            errors:\n              \"10013\":\n                category: BUSINESS\n                description: The item is not in your cart.\n                domain: API_BROWSE\n        \"500\":\n          description: Internal Server Error\n          x-response-codes:\n            errors:\n              \"10000\":\n                category: APPLICATION\n                description: There was a problem with an eBay internal system or process.\n                  Contact eBay developer support for assistance.\n                domain: API_BROWSE\n      security:\n        - Authorization_Code:\n            - https://api.ebay.com/oauth/api_scope/buy.shopping.cart\n      tags:\n        - shopping_cart\n  /shopping_cart/update_quantity:\n    post:\n      description: \"This is an experimental method. This method updates the quantity value\n        of a specific item in the eBay member's cart. You specify the ID of the\n        item in the cart (cartItemId) and the new value for the quantity. If the\n        quantity value is greater than the number of available, the quantity\n        value is changed to the number available and a warning is returned. For\n        example, if there are 15 baseballs available and you set the quantity\n        value to 50, the service automatically changes the value of quantity to\n        15. The response returns all the items in the eBay member's cart; items\n        added to the cart while on ebay.com as well as items added to the cart\n        using the Browse API. The quantity and state of an item changes often.\n        If the item becomes \u0026quot;unavailable\u0026quot; such as, the listing has\n        ended or the item is out of stock, the item will be returned in the\n        unavailableCartItems container. Note: The cartItemId is not the same as\n        the item ID. The cartItemId is the identifier of a specific item in the\n        cart and is generated when the item was added to the cart. URLs for this\n        method Production URL: https://api.ebay.com/buy/browse/v1/shopping_cart/\n        Sandbox URL: https://api.sandbox.ebay.com/buy/browse/v1/shopping_cart/\n        Note: This method is not available in the eBay API Explorer.\n        Restrictions This method can be used only for eBay members. For a list\n        of supported sites and other restrictions, see API Restrictions.\"\n      operationId: updateQuantity\n      requestBody:\n        content:\n          application/json:\n            schema:\n              $ref: \"#/components/schemas/UpdateCartItemInput\"\n      responses:\n        \"200\":\n          description: OK\n          x-response-codes:\n            errors:\n              \"10004\":\n                category: BUSINESS\n                description: The item {itemId} is not available for purchase. This can be\n                  for several reason such as, the listing has ended or the item\n                  is out of stock.\n                domain: API_BROWSE\n              \"10005\":\n                category: BUSINESS\n                description: The item {itemId} is revised.\n                domain: API_BROWSE\n              \"10006\":\n                category: BUSINESS\n                description: The item {itemId} in your cart is not available in the\n                  quantity specified. The quantity of this item has been changed\n                  to the quantity that is currently available. Please review\n                  this change before proceeding to checkout..\n                domain: API_BROWSE\n              \"10020\":\n                category: BUSINESS\n                description: The buyer is blocked from purchasing the item {itemId}.\n                domain: API_BROWSE\n              \"10024\":\n                category: BUSINESS\n                description: The buyer is blocked from purchasing the item {itemId} because\n                  the seller does not ship to the buyer's location.\n                domain: API_BROWSE\n          content:\n            \"*/*\":\n              schema:\n                $ref: \"#/components/schemas/RemoteShopcartResponse\"\n        \"400\":\n          description: Bad Request\n          x-response-codes:\n            errors:\n              \"10001\":\n                category: REQUEST\n                description: \"The X-EBAY-C-MARKETPLACE-ID value is not supported. The\n                  supported values are: {supportedValues}.\"\n                domain: API_BROWSE\n              \"10002\":\n                category: REQUEST\n                description: Insufficient permissions to fulfill the request.\n                domain: API_BROWSE\n              \"10007\":\n                category: REQUEST\n                description: \"The field: {field} is required. Add the field and resubmit\n                  the call.\"\n                domain: API_BROWSE\n              \"10009\":\n                category: REQUEST\n                description: The quantity value is invalid. The quantity must be greater\n                  than 0.\n                domain: API_BROWSE\n              \"10012\":\n                category: REQUEST\n                description: The value of 'cartItemId' {cartItemId} is invalid.\n                domain: API_BROWSE\n              \"10025\":\n                category: REQUEST\n                description: \"The header 'X-EBAY-C-MARKETPLACE-ID' is required. The valid\n                  Marketplaces are: {supportedValues}.\"\n                domain: API_BROWSE\n        \"403\":\n          description: Insufficient permissions to fulfill the request\n        \"409\":\n          description: Conflict\n          x-response-codes:\n            errors:\n              \"10013\":\n                category: BUSINESS\n                description: The item is not in your cart.\n                domain: API_BROWSE\n        \"500\":\n          description: Internal Server Error\n          x-response-codes:\n            errors:\n              \"10000\":\n                category: APPLICATION\n                description: There was a problem with an eBay internal system or process.\n                  Contact eBay developer support for assistance.\n                domain: API_BROWSE\n      security:\n        - Authorization_Code:\n            - https://api.ebay.com/oauth/api_scope/buy.shopping.cart\n      tags:\n        - shopping_cart\nservers:\n  - url: https://api.ebay.com/buy/browse/v1\ncomponents:\n  securitySchemes:\n    Authorization_Code:\n      description: The security definitions for this API. Please check individual\n        operations for applicable scopes.\n      type: oauth2\n      flows:\n        authorizationCode:\n          authorizationUrl: https://auth.ebay.com/oauth2/authorize\n          tokenUrl: https://api.ebay.com/identity/v1/oauth2/token\n          scopes:\n            https://api.ebay.com/oauth/api_scope/buy.shopping.cart: \" This scope would allow signed in user to access shopping carts\"\n    Client_Credentials:\n      description: The security definitions for this API. Please check individual\n        operations for applicable scopes.\n      type: oauth2\n      flows:\n        clientCredentials:\n          tokenUrl: https://api.ebay.com/identity/v1/oauth2/token\n          scopes:\n            https://api.ebay.com/oauth/api_scope: View public data from eBay\n  schemas:\n    AddCartItemInput:\n      description: The type that defines the fields for the \u003cb\u003eaddItems\u003c/b\u003e request.\n      properties:\n        itemId:\n          description: \"The eBay RESTful identifier of the item you want added to the cart.\n            RESTful Item ID Format: v1|#|# For example: v1|272394640372|0\n            v1|162846450672|461882996982 For more information about item ID for\n            RESTful APIs, see the Legacy API compatibility section of the Buy\n            APIs Overview. Maximum number of items in a cart: 100\"\n          type: string\n        quantity:\n          description: \"The number of this item the buyer wants to purchase. If this value\n            is greater than the number available, the service will change this\n            value to the number available. If this happens, a warning is\n            returned. Maximum: number available\"\n          type: integer\n      type: object\n    AdditionalProductIdentity:\n      description: The type that defines the array of product identifiers associated with\n        the item. This container is returned if the seller has associated the\n        eBay Product Identifier (ePID) with the item and in the request \u003cb\u003e\n        fieldgroups\u003c/b\u003e is set to \u003ccode\u003ePRODUCT\u003c/code\u003e.\n      properties:\n        productIdentity:\n          description: An array of the product identifier/value pairs for the product\n            associated with the item. This is returned if the seller has\n            associated the eBay Product Identifier (ePID) with the item and the\n            request has fieldgroups set to PRODUCT. The following table shows\n            what is returned, based on the item information provided by the\n            seller, when the fieldgroups set to PRODUCT. ePID Provided\n            Product\u0026nbsp;ID(s) Provided Response No No The\n            AdditionalProductIdentity container is not returned. No Yes The\n            AdditionalProductIdentity container is not returned but the product\n            identifiers specified by the seller are returned in the\n            localizedAspects container. Yes No The AdditionalProductIdentity\n            container is returned listing the product identifiers of the\n            product. Yes Yes The AdditionalProductIdentity container is returned\n            listing all the product identifiers of the product and the product\n            identifiers specified by the seller are returned in the\n            localizedAspects container.\n          items:\n            $ref: \"#/components/schemas/ProductIdentity\"\n          type: array\n      type: object\n    Address:\n      description: The type that defines the fields for an address.\n      properties:\n        addressLine1:\n          description: The first line of the street address.\n          type: string\n        addressLine2:\n          description: The second line of the street address. This field is not always\n            used, but can be used for 'Suite Number' or 'Apt Number'.\n          type: string\n        city:\n          description: The city of the address.\n          type: string\n        country:\n          description: The two-letter ISO 3166 standard of the country of the address. For\n            implementation help, refer to \u003ca\n            href='https://developer.ebay.com/devzone/rest/api-ref/browse/types/CountryCodeEnum.html'\u003eeBay\n            API documentation\u003c/a\u003e\n          type: string\n        county:\n          description: The county of the address.\n          type: string\n        postalCode:\n          description: The postal code of the address.\n          type: string\n        stateOrProvince:\n          description: The state or province of the address.\n          type: string\n      type: object\n    Amount:\n      description: The type that defines the fields for a monetary value.\n      properties:\n        currency:\n          description: The three-letter ISO 4217 code representing the currency of the\n            amount in the value field. For implementation help, refer to \u003ca\n            href='https://developer.ebay.com/devzone/rest/api-ref/browse/types/CurrencyCodeEnum.html'\u003eeBay\n            API documentation\u003c/a\u003e\n          type: string\n        value:\n          description: The dollar value of the currency specified in the currency field.\n            The value of currency defaults to the standard currency used by the\n            country of the eBay site offering the item.\n          type: string\n      type: object\n    Aspect:\n      description: \"The type that defines the fields for the name/value pairs for the\n        aspects of the product. For example: BRAND/Apple\"\n      properties:\n        localizedName:\n          description: The text representing the name of the aspect for the name/value\n            pair, such as Brand.\n          type: string\n        localizedValues:\n          description: The text representing the value of the aspect for the name/value\n            pair, such as Apple.\n          items:\n            type: string\n          type: array\n      type: object\n    AspectDistribution:\n      description: The type that define the fields for the aspect information. Aspects are\n        the variations of an item, such as color, size, etc.\n      properties:\n        aspectValueDistributions:\n          description: An array of containers for the various values of the aspect and the\n            match count and a HATEOAS reference ( refinementHref) for this\n            aspect.\n          items:\n            $ref: \"#/components/schemas/AspectValueDistribution\"\n          type: array\n        localizedAspectName:\n          description: The name of an aspect, such as Brand, Color, etc.\n          type: string\n      type: object\n    AspectGroup:\n      properties:\n        aspects:\n          description: \"An array of the name/value pairs for the aspects of the product.\n            For example: BRAND/Apple\"\n          items:\n            $ref: \"#/components/schemas/Aspect\"\n          type: array\n        localizedGroupName:\n          description: The name of a group of aspects. In the following example, Product\n            Identifiers and Process are product aspect group names. Under the\n            group name are the product aspect name/value pairs. Product\n            Identifiers \u0026nbsp;\u0026nbsp;\u0026nbsp;Brand/Apple \u0026nbsp;\u0026nbsp;\u0026nbsp;Product\n            Family/iMac Processor \u0026nbsp;\u0026nbsp;\u0026nbsp;Processor Type/Intel\n            \u0026nbsp;\u0026nbsp;\u0026nbsp;Processor Speed/3.10\n          type: string\n      type: object\n    AspectValueDistribution:\n      description: The container that defines the fields for the conditions refinements.\n        This container is returned when \u003cb\u003e fieldgroups\u003c/b\u003e is set to\n        \u003ccode\u003eASPECT_REFINEMENTS\u003c/code\u003e or \u003ccode\u003eFULL\u003c/code\u003e in the request.\n      properties:\n        localizedAspectValue:\n          description: The value of an aspect. For example, Red is a value for the aspect\n            Color.\n          type: string\n        matchCount:\n          description: The number of items with this aspect.\n          type: integer\n        refinementHref:\n          description: A HATEOAS reference for this aspect.\n          type: string\n      type: object\n    AttributeNameValue:\n      description: The type the defines attribute name/value pair fields that specify a\n        product. The type of data depends on the context. For example, if you\n        were using this to specify a specific vehicle, the attribute names would\n        be Make, Model, Year, etc.\n      properties:\n        name:\n          description: The name of the product attribute, such as Make, Model, Year, etc.\n          type: string\n        value:\n          description: The value for the name attribute, such as BMW, R1200GS, 2011, etc.\n          type: string\n      type: object\n    BuyingOptionDistribution:\n      description: The container that defines the fields for the buying options\n        refinements. This container is returned when \u003cb\u003e fieldgroups\u003c/b\u003e is set\n        to \u003ccode\u003eBUYING_OPTION_REFINEMENTS\u003c/code\u003e or \u003ccode\u003eFULL\u003c/code\u003e in the\n        request.\n      properties:\n        buyingOption:\n          description: The container that returns the buying option type. This will be\n            AUCTION or FIXED_PRICE or both. For details, see buyingOptions.\n          type: string\n        matchCount:\n          description: The number of items having this buying option.\n          type: integer\n        refinementHref:\n          description: The HATEOAS reference for this buying option.\n          type: string\n      type: object\n    CartItem:\n      description: The type that defines the fields for the individual items in a cart.\n      properties:\n        cartItemId:\n          description: The identifier for the item being added to the cart. This is\n            generated when the item is added to the cart.\n          type: string\n        cartItemSubtotal:\n          $ref: \"#/components/schemas/Amount\"\n        image:\n          $ref: \"#/components/schemas/Image\"\n        itemId:\n          description: \"The RESTful identifier of the item. This identifier is generated\n            when the item was listed. RESTful Item ID Format: v1|#|# For\n            example: v1|272394640372|0 v1|162846450672|461882996982\"\n          type: string\n        itemWebUrl:\n          description: The URL of the eBay view item page for the item.\n          type: string\n        price:\n          $ref: \"#/components/schemas/Price\"\n        quantity:\n          description: The number of this item the buyer wants to purchase.\n          type: integer\n        title:\n          description: The title of the item. This can be written by the seller or come\n            from the eBay product catalog.\n          type: string\n      type: object\n    Category:\n      description: This type is used by the \u003cb\u003e categories\u003c/b\u003e  container in the response\n        of the \u003cb\u003e search\u003c/b\u003e  method, and contains the primary item category ID\n        of the item, as well as the secondary item category if the item was\n        listed in two categories.\n      properties:\n        categoryId:\n          description: The unique identifier of the primary item category of the item, as\n            well as the secondary item category if item was listed in two\n            categories.\n          type: string\n      type: object\n    CategoryDistribution:\n      description: The container that defines the fields for the category refinements. This\n        container is returned when \u003cb\u003e fieldgroups\u003c/b\u003e is set to\n        \u003ccode\u003eCATEGORY_REFINEMENTS\u003c/code\u003e or \u003ccode\u003eFULL\u003c/code\u003e in the request.\n      properties:\n        categoryId:\n          description: The identifier of the category.\n          type: string\n        categoryName:\n          description: The name of the category, such as Baby \u0026amp; Toddler Clothing.\n          type: string\n        matchCount:\n          description: The number of items in this category.\n          type: integer\n        refinementHref:\n          description: The HATEOAS reference of this category.\n          type: string\n      type: object\n    CommonDescriptions:\n      description: The type that defines the fields for the item IDs that all use a common\n        description.  Often the item variations within an item group all have\n        the same description. Instead of repeating this description in the item\n        details of each item, a description that is shared by at least one other\n        item is returned in this container. If the description is unique, it is\n        returned in the \u003cb\u003e items.description\u003c/b\u003e field.\n      properties:\n        description:\n          description: The item description that is used by more than one of the item\n            variations.\n          type: string\n        itemIds:\n          description: A list of item IDs that have this description.\n          items:\n            type: string\n          type: array\n      type: object\n    CompatibilityPayload:\n      properties:\n        compatibilityProperties:\n          description: \"An array of attribute name/value pairs used to define a specific\n            product. For example: If you wanted to specify a specific car, one\n            of the name/value pairs would be \u0026quot;name\u0026quot; :\n            \u0026quot;Year\u0026quot;, \u0026quot;value\u0026quot; : \u0026quot;2019\u0026quot; For a list of\n            the attributes required for cars and trucks and motorcycles see\n            Check compatibility in the Buy Integration Guide.\"\n          items:\n            $ref: \"#/components/schemas/AttributeNameValue\"\n          type: array\n      type: object\n    CompatibilityProperty:\n      description: This container returns the product attribute name/value pairs that are\n        compatible with the keyword. These attributes are submitted in\n        the  \u003cb\u003ecompatibility_filter\u003c/b\u003e request field.\n      properties:\n        localizedName:\n          description: The name of the product attribute that as been translated to the\n            language of the site.\n          type: string\n        name:\n          description: The name of the product attribute, such as Make, Model, Year, etc.\n          type: string\n        value:\n          description: The value for the name attribute, such as BMW, R1200GS, 2011, etc.\n          type: string\n      type: object\n    CompatibilityResponse:\n      description: \"The type that defines the response fields for \u003cb\u003e\n        checkCompatibility\u003c/b\u003e.  \"\n      properties:\n        compatibilityStatus:\n          description: \"An enumeration value that tells you if the item is compatible with\n            the product. The values are: COMPATIBLE - Indicates the item is\n            compatible with the product specified in the request. NOT_COMPATIBLE\n            - Indicates the item is not compatible with the product specified in\n            the request. Be sure to check all the value fields to ensure they\n            are correct as errors in the value can also cause this response.\n            UNDETERMINED - Indicates one or more attributes for the specified\n            product are missing so compatibility cannot be determined. The\n            response returns the attributes that are missing. Code so that your\n            app gracefully handles any future changes to this list. For\n            implementation help, refer to \u003ca\n            href='https://developer.ebay.com/devzone/rest/api-ref/browse/types/\\\n            CompatibilityStatus.html'\u003eeBay API documentation\u003c/a\u003e\"\n          type: string\n        warnings:\n          description: The container with all the warnings for the request.\n          items:\n            $ref: \"#/components/schemas/Error\"\n          type: array\n      type: object\n    ConditionDistribution:\n      description: The container that defines the fields for the conditions refinements.\n        This container is returned when \u003cb\u003e fieldgroups\u003c/b\u003e is set to\n        \u003ccode\u003eCONDITION_REFINEMENTS\u003c/code\u003e or \u003ccode\u003eFULL\u003c/code\u003e in the request.\n      properties:\n        condition:\n          description: The text describing the condition of the item, such as New or Used.\n            For a list of condition names, see Item Condition IDs and Names.\n            Code so that your app gracefully handles any future changes to this\n            list.\n          type: string\n        conditionId:\n          description: The identifier of the condition. For example, 1000 is the identifier\n            for NEW.\n          type: string\n        matchCount:\n          description: The number of items having the condition.\n          type: integer\n        refinementHref:\n          description: The HATEOAS reference of this condition.\n          type: string\n      type: object\n    ConvertedAmount:\n      description: This type defines the monetary value of an amount. It can provide the\n        amount in both the currency used on the eBay site where an item is being\n        offered and the conversion of that value into another currency, if\n        applicable.\n      properties:\n        convertedFromCurrency:\n          description: The three-letter ISO 4217 code representing the currency of the\n            amount in the convertedFromValue field. This value is required or\n            returned only if currency conversion/localization is required, and\n            represents the pre-conversion currency. For implementation help,\n            refer to \u003ca\n            href='https://developer.ebay.com/devzone/rest/api-ref/browse/types/CurrencyCodeEnum.html'\u003eeBay\n            API documentation\u003c/a\u003e\n          type: string\n        convertedFromValue:\n          description: The monetary amount before any conversion is performed, in the\n            currency specified by the convertedFromCurrency field. This value is\n            required or returned only if currency conversion/localization is\n            required. The value field contains the converted amount of this\n            value, in the currency specified by the currency field.\n          type: string\n        currency:\n          description: \"The three-letter ISO 4217 code representing the currency of the\n            amount in the value field. If currency conversion/localization is\n            required, this is the post-conversion currency of the amount in the\n            value field. Default: The currency of the authenticated user's\n            country. For implementation help, refer to \u003ca\n            href='https://developer.ebay.com/devzone/rest/api-ref/browse/types/\\\n            CurrencyCodeEnum.html'\u003eeBay API documentation\u003c/a\u003e\"\n          type: string\n        value:\n          description: The monetary amount, in the currency specified by the currency\n            field. If currency conversion/localization is required, this value\n            is the converted amount, and the convertedFromValue field contains\n            the amount in the original currency.\n          type: string\n      type: object\n    Error:\n      description: The type that defines the fields that can be returned in an error.\n      properties:\n        category:\n          description: \"This string value indicates the error category. There are three\n            categories of errors: request errors, application errors, and system\n            errors.\"\n          type: string\n        domain:\n          description: The name of the primary system where the error occurred. This is\n            relevant for application errors.\n          type: string\n        errorId:\n          description: A unique code that identifies the particular error or warning that\n            occurred. Your application can use error codes as identifiers in\n            your customized error-handling algorithms.\n          type: integer\n        inputRefIds:\n          description: An array of reference IDs that identify the specific request\n            elements most closely associated to the error or warning, if any.\n          items:\n            type: string\n          type: array\n        longMessage:\n          description: A detailed description of the condition that caused the error or\n            warning, and information on what to do to correct the problem.\n          type: string\n        message:\n          description: A description of the condition that caused the error or warning.\n          type: string\n        outputRefIds:\n          description: An array of reference IDs that identify the specific response\n            elements most closely associated to the error or warning, if any.\n          items:\n            type: string\n          type: array\n        parameters:\n          description: An array of warning and error messages that return one or more\n            variables contextual information about the error or warning. This is\n            often the field or value that triggered the error or warning.\n          items:\n            $ref: \"#/components/schemas/ErrorParameter\"\n          type: array\n        subdomain:\n          description: The name of the subdomain in which the error or warning occurred.\n          type: string\n      type: object\n    ErrorParameter:\n      description: An array of name/value pairs that provide details regarding the error.\n      properties:\n        name:\n          description: This is the name of input field that caused an issue with the call\n            request.\n          type: string\n        value:\n          description: This is the actual value that was passed in for the element\n            specified in the name field.\n          type: string\n      type: object\n    EstimatedAvailability:\n      description: The type that defines the fields for the estimated item availability\n        information.\n      properties:\n        availabilityThreshold:\n          description: This field is return only when the seller sets their 'display item\n            quantity' preference to Display \u0026quot;More than 10 available\u0026quot;\n            in your listing (if applicable). The value of this field will be\n            \u0026quot;10\u0026quot;, which is the threshold value. Code so that your app\n            gracefully handles any future changes to this value.\n          type: integer\n        availabilityThresholdType:\n          description: \"This field is return only when the seller sets their Display Item\n            Quantity preference to Display \u0026quot;More than 10 available\u0026quot; in\n            your listing (if applicable). The value of this field will be\n            MORE_THAN. This indicates that the seller has more than the\n            'quantity display preference', which is 10, in stock for this item.\n            The following are the display item quantity preferences the seller\n            can set. Display \u0026quot;More than 10 available\u0026quot; in your listing\n            (if applicable) If the seller enables this preference, this field is\n            returned as long as there are more than 10 of this item in\n            inventory. If the quantity is equal to 10 or drops below 10, this\n            field is not returned and the estimated quantity of the item is\n            returned in the estimatedAvailableQuantity field. Display the exact\n            quantity in your items If the seller enables this preference, the\n            availabilityThresholdType and availabilityThreshold fields are not\n            returned and the estimated quantity of the item is returned in the\n            estimatedAvailableQuantity field. Note: Because the quantity of an\n            item can change several times within a second, it is impossible to\n            return the exact quantity. Code so that your app gracefully handles\n            any future changes to these preferences. For implementation help,\n            refer to \u003ca\n            href='https://developer.ebay.com/devzone/rest/api-ref/browse/types/\\\n            AvailabilityThresholdEnum.html'\u003eeBay API documentation\u003c/a\u003e\"\n          type: string\n        deliveryOptions:\n          description: \"An array of available delivery options. Valid Values: SHIP_TO_HOME,\n            SELLER_ARRANGED_LOCAL_PICKUP, IN_STORE_PICKUP, PICKUP_DROP_OFF, or\n            DIGITAL_DELIVERY Code so that your app gracefully handles any future\n            changes to this list.\"\n          items:\n            description: \" For implementation help, refer to \u003ca\n              href='https://developer.ebay.com/devzone/rest/api-ref/browse/type\\\n              s/DeliveryOptionsEnum.html'\u003eeBay API documentation\u003c/a\u003e\"\n            type: string\n          type: array\n        estimatedAvailabilityStatus:\n          description: \"An enumeration value representing the inventory status of this\n            item. Valid Values: IN_STOCK, LIMITED_STOCK, or OUT_OF_STOCK Code so\n            that your app gracefully handles any future changes to this list.\n            For implementation help, refer to \u003ca\n            href='https://developer.ebay.com/devzone/rest/api-ref/browse/types/\\\n            AvailabilityStatusEnum.html'\u003eeBay API documentation\u003c/a\u003e\"\n          type: string\n        estimatedAvailableQuantity:\n          description: The estimated number of this item that are available for purchase.\n            Because the quantity of an item can change several times within a\n            second, it is impossible to return the exact quantity. So instead of\n            returning quantity, the estimated availability of the item is\n            returned.\n          type: integer\n        estimatedSoldQuantity:\n          description: The estimated number of this item that have been sold.\n          type: integer\n      type: object\n    Image:\n      description: Type the defines the details of an image, such as size and image URL.\n        Currently,  only \u003cb\u003e imageUrl\u003c/b\u003e is  populated. The \u003cb\u003e height\u003c/b\u003e and\n        \u003cb\u003e width\u003c/b\u003e were added for future use.\n      properties:\n        height:\n          description: Reserved for future use.\n          type: integer\n        imageUrl:\n          description: The URL of the image.\n          type: string\n        width:\n          description: Reserved for future use.\n          type: integer\n      type: object\n    Item:\n      description: Type that defines the fields for the item details for a specific item.\n      properties:\n        additionalImages:\n          description: An array of containers with the URLs for the images that are in\n            addition to the primary image. The primary image is returned in the\n            image.imageUrl field.\n          items:\n            $ref: \"#/components/schemas/Image\"\n          type: array\n        adultOnly:\n          description: This indicates if the item is for adults only. For more information\n            about adult-only items on eBay, see Adult items policy for sellers\n            and Adult-Only items on eBay for buyers.\n          type: boolean\n        ageGroup:\n          description: (Primary Item Aspect) The age group for which the product is\n            recommended. For example, newborn, infant, toddler, kids, adult,\n            etc. All the item aspects, including this aspect, are returned in\n            the localizedAspects container.\n          type: string\n        bidCount:\n          description: This integer value indicates the total number of bids that have been\n            placed against an auction item. This field is returned only for\n            auction items.\n          type: integer\n        brand:\n          description: (Primary Item Aspect) The name brand of the item, such as Nike,\n            Apple, etc. All the item aspects, including this aspect, are\n            returned in the localizedAspects container.\n          type: string\n        buyingOptions:\n          description: \"A comma separated list of all the purchase options available for\n            the item. Values Returned: FIXED_PRICE - Indicates the buyer can\n            purchase the item for a set price using the Buy It Now button.\n            AUCTION - Indicates the buyer can place a bid for the item. After\n            the first bid is placed, this becomes a live auction item and is the\n            only buying option for this item. Code so that your app gracefully\n            handles any future changes to this list.\"\n          items:\n            type: string\n          type: array\n        categoryId:\n          description: The ID of the leaf category for this item. A left category is the\n            lowest level in the category tree. This category has no children.\n          type: string\n        categoryPath:\n          description: \"Text that shows the category hierarchy of the item. For example:\n            Computers/Tablets \u0026amp; Networking, Laptops \u0026amp; Netbooks, PC\n            Laptops \u0026amp; Netbooks\"\n          type: string\n        color:\n          description: (Primary Item Aspect) Text describing the color of the item. All the\n            item aspects, including this aspect, are returned in the\n            localizedAspects container.\n          type: string\n        condition:\n          description: The text describing the condition of the item, such as New or Used.\n            For a list of condition names, see Item Condition IDs and Names.\n            Code so that your app gracefully handles any future changes to this\n            list.\n          type: string\n        conditionId:\n          description: The identifier of the condition of the item. For example, 1000 is\n            the identifier for NEW. For a list of condition names and IDs, see\n            Item Condition IDs and Names. Code so that your app gracefully\n            handles any future changes to this list.\n          type: string\n        currentBidPrice:\n          $ref: \"#/components/schemas/ConvertedAmount\"\n        description:\n          description: The full description of the item that was created by the seller.\n            This can be plain text or rich content.\n          type: string\n        eligibleForInlineCheckout:\n          description: This field indicates if the item can be purchased using the Buy\n            Order API. If the value is true, this indicates that the item can be\n            purchased using the Order API. If the value is false, this indicates\n            that the item can be purchased using eBay's managed payments and\n            cannot be purchased using the Order API.\n          type: boolean\n        enabledForGuestCheckout:\n          description: Indicates if the item can be purchased using Guest Checkout in the\n            Order API. You can use this flag to exclude items from your\n            inventory that are not eligible for Guest Checkout, such as gift\n            cards.\n          type: boolean\n        energyEfficiencyClass:\n          description: Indicates the European energy efficiency rating (EEK) of the item.\n            This field is returned only if the seller specified the energy\n            efficiency rating. The rating is a set of energy efficiency classes\n            from A to G, where 'A' is the most energy efficient and 'G' is the\n            least efficient. This rating helps buyers choose between various\n            models. When the manufacturer's specifications for this item are\n            available, the link to this information is returned in the\n            productFicheWebUrl field.\n          type: string\n        epid:\n          description: An EPID is the eBay product identifier of a product from the eBay\n            product catalog. This indicates the product in which the item\n            belongs.\n          type: string\n        estimatedAvailabilities:\n          description: The estimated number of this item that are available for purchase.\n            Because the quantity of an item can change several times within a\n            second, it is impossible to return the exact quantity. So instead of\n            returning quantity, the estimated availability of the item is\n            returned.\n          items:\n            $ref: \"#/components/schemas/EstimatedAvailability\"\n          type: array\n        gender:\n          description: \"(Primary Item Aspect) The gender for the item. This is used for\n            items that could vary by gender, such as clothing. For example:\n            male, female, or unisex. All the item aspects, including this\n            aspect, are returned in the localizedAspects container.\"\n          type: string\n        gtin:\n          description: The unique Global Trade Item number of the item as defined by\n            http://www.gtin.info. This can be a UPC (Universal Product Code),\n            EAN (European Article Number), or an ISBN (International Standard\n            Book Number) value.\n          type: string\n        image:\n          $ref: \"#/components/schemas/Image\"\n        inferredEpid:\n          description: \"The ePID (eBay Product ID of a product from the eBay product\n            catalog) for the item, which has been programmatically determined by\n            eBay using the item's title, aspects, and other data. If the seller\n            provided an ePID for the item, the seller's value is returned in the\n            epid field. Note: This field is returned only for authorized\n            Partners.\"\n          type: string\n        itemAffiliateWebUrl:\n          description: The URL of the View Item page of the item, which includes the\n            affiliate tracking ID. This field is returned only when the eBay\n            partner enables affiliate tracking for the item by including the\n            X-EBAY-C-ENDUSERCTX request header in the method.\n          type: string\n        itemEndDate:\n          description: The date and time up to which the items can be purchased. This value\n            is returned in UTC format (yyyy-MM-ddThh:mm:ss.sssZ), which you can\n            convert into the local time of the buyer.\n          type: string\n        itemId:\n          description: The unique RESTful identifier of the item.\n          type: string\n        itemLocation:\n          $ref: \"#/components/schemas/Address\"\n        itemWebUrl:\n          description: The URL of the View Item page of the item. This enables you to\n            include a \u0026quot;Report Item on eBay\u0026quot; link that takes the buyer\n            to the View Item page on eBay. From there they can report any issues\n            regarding this item to eBay.\n          type: string\n        localizedAspects:\n          description: An array of containers for the complete list of the name/value pairs\n            that describe the variation of the item.\n          items:\n            $ref: \"#/components/schemas/TypedNameValue\"\n          type: array\n        marketingPrice:\n          $ref: \"#/components/schemas/MarketingPrice_0\"\n        material:\n          description: (Primary Item Aspect) Text describing what the item is made of. For\n            example, silk. All the item aspects, including this aspect, are\n            returned in the localizedAspects container.\n          type: string\n        minimumPriceToBid:\n          $ref: \"#/components/schemas/ConvertedAmount\"\n        mpn:\n          description: The manufacturer's part number, which is a unique number that\n            identifies a specific product. To identify the product, this is\n            always used along with brand.\n          type: string\n        pattern:\n          description: (Primary Item Aspect) Text describing the pattern used on the item.\n            For example, paisley. All the item aspects, including this aspect,\n            are returned in the localizedAspects container.\n          type: string\n        price:\n          $ref: \"#/components/schemas/ConvertedAmount\"\n        priceDisplayCondition:\n          description: \"An enumeration value that indicates when in the buying flow the\n            item's price can appear for minimum advertised price (MAP) items,\n            which is the lowest price a retailer can advertise/show for this\n            item. These enumeration values indicate when the MAP can appear in\n            the buying flow; any time, after the item has been added to the\n            cart, or on the checkout page. Valid Values:\n            ONLY_SHOW_WHEN_ADDED_IN_CART or ALWAYS_SHOW Code so that your app\n            gracefully handles any future changes to this list. For\n            implementation help, refer to \u003ca\n            href='https://developer.ebay.com/devzone/rest/api-ref/browse/types/\\\n            PriceDisplayConditionEnum.html'\u003eeBay API documentation\u003c/a\u003e\"\n          type: string\n        primaryItemGroup:\n          $ref: \"#/components/schemas/ItemGroupSummary\"\n        primaryProductReviewRating:\n          $ref: \"#/components/schemas/ReviewRating\"\n        product:\n          $ref: \"#/components/schemas/Product\"\n        productFicheWebUrl:\n          description: The URL of a page containing the manufacturer's specification of\n            this item, which helps buyers make a purchasing decision. This\n            information is available only for items that include the European\n            energy efficiency rating (EEK) but is not available for all items\n            with an EEK rating. This field is returned only if this information\n            is available. The EEK rating of the item is returned in the\n            energyEfficiencyClass field.\n          type: string\n        quantityLimitPerBuyer:\n          description: The maximum number for a specific item that one buyer can purchase.\n          type: integer\n        reservePriceMet:\n          description: \"This indicates if the reserve price of the item has been met. A\n            reserve price is set by the seller and is the minimum amount the\n            seller is willing to sell the item for. If the highest bid is not\n            equal to or higher than the reserve price when the auction ends, the\n            listing ends and the item is not sold. Note: This is returned only\n            for auctions that have a reserve price.\"\n          type: boolean\n        returnTerms:\n          $ref: \"#/components/schemas/ItemReturnTerms\"\n        seller:\n          $ref: \"#/components/schemas/SellerDetail\"\n        sellerItemRevision:\n          description: An identifier generated/incremented when a seller revises the item.\n            There are two types of item revisions; seller changes, such as\n            changing the title, and eBay system changes, such as changing the\n            quantity when an item is purchased. This ID is changed only when the\n            seller makes a change to the item. This means you cannot use this\n            value to determine if the quantity has changed.\n          type: string\n        shipToLocations:\n          $ref: \"#/components/schemas/ShipToLocations\"\n        shippingOptions:\n          description: An array of shipping options containers that have the details about\n            cost, carrier, etc. of one shipping option.\n          items:\n            $ref: \"#/components/schemas/ShippingOption\"\n          type: array\n        shortDescription:\n          description: This text string is derived from the item condition and the item\n            aspects (such as size, color, capacity, model, brand, etc.).\n          type: string\n        size:\n          description: (Primary Item Aspect) The size of the item. For example, '7' for a\n            size 7 shoe. All the item aspects, including this aspect, are\n            returned in the localizedAspects container.\n          type: string\n        sizeSystem:\n          description: \"(Primary Item Aspect) The sizing system of the country. All the\n            item aspects, including this aspect, are returned in the\n            localizedAspects container. Valid Values: AU (Australia), BR\n            (Brazil), CN (China), DE (Germany), EU (European Union), FR\n            (France), IT (Italy), JP (Japan), MX (Mexico), US (USA), UK (United\n            Kingdom) Code so that your app gracefully handles any future changes\n            to this list.\"\n          type: string\n        sizeType:\n          description: (Primary Item Aspect) Text describing a size group in which the item\n            would be included, such as regular, petite, plus, big-and-tall or\n            maternity. All the item aspects, including this aspect, are returned\n            in the localizedAspects container.\n          type: string\n        subtitle:\n          description: A subtitle is optional and allows the seller to provide more\n            information about the product, possibly including keywords that may\n            assist with search results.\n          type: string\n        taxes:\n          description: The container for the tax information for the item.\n          items:\n            $ref: \"#/components/schemas/Taxes\"\n          type: array\n        title:\n          description: \"The seller-created title of the item. Maximum Length: 80 characters\"\n          type: string\n        topRatedBuyingExperience:\n          description: Indicates if the item a top-rated plus item. There are three\n            benefits of a top-rated plus item; a minimum 30-day money-back\n            return policy, shipping the items in 1 business day with tracking\n            provided, and the added comfort of knowing this item is from\n            experienced sellers with the highest buyer ratings. See the Top\n            Rated Plus Items and Becoming a Top Rated Seller and qualifying for\n            Top Rated Plus help topics for more information.\n          type: boolean\n        uniqueBidderCount:\n          description: This integer value indicates the number of different eBay users who\n            have placed one or more bids on an auction item. This field is only\n            applicable to auction items.\n          type: integer\n        unitPrice:\n          $ref: \"#/components/schemas/ConvertedAmount\"\n        unitPricingMeasure:\n          description: \"The designation, such as size, weight, volume, count, etc., that\n            was used to specify the quantity of the item. This helps buyers\n            compare prices. For example, the following tells the buyer that the\n            item is 7.99 per 100 grams. \u0026quot;unitPricingMeasure\u0026quot;:\n            \u0026quot;100g\u0026quot;, \u0026quot;unitPrice\u0026quot;: {\n            \u0026nbsp;\u0026nbsp;\u0026quot;value\u0026quot;: \u0026quot;7.99\u0026quot;,\n            \u0026nbsp;\u0026nbsp;\u0026quot;currency\u0026quot;: \u0026quot;GBP\u0026quot;\"\n          type: string\n        warnings:\n          description: An array of warning messages. These type of errors do not prevent\n            the method from executing but should be checked.\n          items:\n            $ref: \"#/components/schemas/Error\"\n          type: array\n      type: object\n    ItemGroupSummary:\n      description: 'The type that defines the fields for the details of each item in an\n        item group. An item group is  an item that has various aspect\n        differences, such as color, size, storage capacity, etc. When an item\n        group is created, one of the item variations, such as the red shirt size\n        L, is chosen as the \"parent\". All the other items in the group are the\n        children, such as the blue shirt size L, red shirt size M, etc. \u003cbr\n        /\u003e\u003cbr /\u003e\u003cspan class=\"tablenote\"\u003e\u003cb\u003e Note: \u003c/b\u003e This container is\n        returned only if the \u003cb\u003e item_id\u003c/b\u003e in the request is an item group\n        (parent ID of an item with variations).\u003c/span\u003e'\n      properties:\n        itemGroupAdditionalImages:\n          description: An array of containers with the URLs for images that are in addition\n            to the primary image of the item group. The primary image is\n            returned in the itemGroupImage field.\n          items:\n            $ref: \"#/components/schemas/Image\"\n          type: array\n        itemGroupHref:\n          description: The HATEOAS reference of the parent page of the item group. An item\n            group is an item that has various aspect differences, such as color,\n            size, storage capacity, etc.\n          type: string\n        itemGroupId:\n          description: The unique identifier for the item group. An item group is an item\n            that has various aspect differences, such as color, size, storage\n            capacity, etc.\n          type: string\n        itemGroupImage:\n          $ref: \"#/components/schemas/Image\"\n        itemGroupTitle:\n          description: The title of the item that appears on the item group page. An item\n            group is an item that has various aspect differences, such as color,\n            size, storage capacity, etc.\n          type: string\n        itemGroupType:\n          description: An enumeration value that indicates the type of the item group. An\n            item group is an item that has various aspect differences, such as\n            color, size, storage capacity, etc. For implementation help, refer\n            to \u003ca\n            href='https://developer.ebay.com/devzone/rest/api-ref/browse/types/ItemGroupTypeEnum.html'\u003eeBay\n            API documentation\u003c/a\u003e\n          type: string\n      type: object\n    ItemLocationImpl:\n      description: The type that defines the fields for the location of an item, such as\n        information typically used for an address, including postal code,\n        county, state/province, street address, city, and country (2-digit ISO\n        code).\n      properties:\n        addressLine1:\n          description: The first line of the street address.\n          type: string\n        addressLine2:\n          description: The second line of the street address. This field may contain such\n            values as an apartment or suite number.\n          type: string\n        city:\n          description: \"The city in which the item is located. Restriction: This field is\n            populated in the search method response only when fieldgroups =\n            EXTENDED.\"\n          type: string\n        country:\n          description: The two-letter ISO 3166 standard code that indicates the country in\n            which the item is located. For implementation help, refer to \u003ca\n            href='https://developer.ebay.com/devzone/rest/api-ref/browse/types/CountryCodeEnum.html'\u003eeBay\n            API documentation\u003c/a\u003e\n          type: string\n        county:\n          description: The county in which the item is located.\n          type: string\n        postalCode:\n          description: The postal code (or zip code in US) where the item is located.\n          type: string\n        stateOrProvince:\n          description: The state or province in which the item is located.\n          type: string\n      type: object\n    ItemReturnTerms:\n      description: The type that defines the fields for the seller's return policy.\n      properties:\n        extendedHolidayReturnsOffered:\n          description: Indicates if the seller has enabled the Extended Holiday Returns\n            feature on the item. Extended Holiday Returns are only applicable\n            during the US holiday season, and gives buyers extra time to return\n            an item. This 'extra time' will typically extend beyond what is set\n            through the returnPeriod value.\n          type: boolean\n        refundMethod:\n          description: \"An enumeration value that indicates how a buyer is refunded when an\n            item is returned. Valid Values: MONEY_BACK or MERCHANDISE_CREDIT\n            Code so that your app gracefully handles any future changes to this\n            list. For implementation help, refer to \u003ca\n            href='https://developer.ebay.com/devzone/rest/api-ref/browse/types/\\\n            RefundMethodEnum.html'\u003eeBay API documentation\u003c/a\u003e\"\n          type: string\n        restockingFeePercentage:\n          description: This string field indicates the restocking fee percentage that the\n            seller has set on the item. Sellers have the option of setting no\n            restocking fee for an item, or they can set the percentage to 10,\n            15, or 20 percent. So, if the cost of the item was $100, and the\n            restocking percentage was 20 percent, the buyer would be charged $20\n            to return that item, so instead of receiving a $100 refund, they\n            would receive $80 due to the restocking fee.\n          type: string\n        returnInstructions:\n          description: Text written by the seller describing what the buyer needs to do in\n            order to return the item.\n          type: string\n        returnMethod:\n          description: \"An enumeration value that indicates the alternative methods for a\n            full refund when an item is returned. This field is returned if the\n            seller offers the buyer an item replacement or exchange instead of a\n            monetary refund. Valid Values: REPLACEMENT - Indicates that the\n            buyer has the option of receiving money back for the returned item,\n            or they can choose to have the seller replace the item with an\n            identical item. EXCHANGE - Indicates that the buyer has the option\n            of receiving money back for the returned item, or they can exchange\n            the item for another similar item. Code so that your app gracefully\n            handles any future changes to this list. For implementation help,\n            refer to \u003ca\n            href='https://developer.ebay.com/devzone/rest/api-ref/browse/types/\\\n            ReturnMethodEnum.html'\u003eeBay API documentation\u003c/a\u003e\"\n          type: string\n        returnPeriod:\n          $ref: \"#/components/schemas/TimeDuration\"\n        returnShippingCostPayer:\n          description: \"This enumeration value indicates whether the buyer or seller is\n            responsible for return shipping costs when an item is returned.\n            Valid Values: SELLER - Indicates the seller will pay for the\n            shipping costs to return the item. BUYER - Indicates the buyer will\n            pay for the shipping costs to return the item. Code so that your app\n            gracefully handles any future changes to this list. For\n            implementation help, refer to \u003ca\n            href='https://developer.ebay.com/devzone/rest/api-ref/browse/types/\\\n            ReturnShippingCostPayerEnum.html'\u003eeBay API documentation\u003c/a\u003e\"\n          type: string\n        returnsAccepted:\n          description: Indicates whether the seller accepts returns for the item.\n          type: boolean\n      type: object\n    ItemSummary:\n      description: The type that defines the fields for the details of a specific item.\n      properties:\n        additionalImages:\n          description: An array of containers with the URLs for the images that are in\n            addition to the primary image. The primary image is returned in the\n            image.imageUrl field.\n          items:\n            $ref: \"#/components/schemas/Image\"\n          type: array\n        adultOnly:\n          description: This indicates if the item is for adults only. For more information\n            about adult-only items on eBay, see Adult items policy for sellers\n            and Adult-Only items on eBay for buyers.\n          type: boolean\n        bidCount:\n          description: This integer value indicates the total number of bids that have been\n            placed for an auction item. This field is only returned for auction\n            items.\n          type: integer\n        buyingOptions:\n          description: \"A comma separated list of all the purchase options available for\n            the item. Values Returned: FIXED_PRICE - Indicates the buyer can\n            purchase the item for a set price using the Buy It Now button.\n            AUCTION - Indicates the buyer can place a bid for the item. After\n            the first bid is placed, this becomes a live auction item and is the\n            only buying option for this item. BEST_OFFER - Items where the buyer\n            can send the seller a price they're willing to pay for the item. The\n            seller can accept, reject, or send a counter offer. For details\n            about Best Offer, see Best Offer. Code so that your app gracefully\n            handles any future changes to this list.\"\n          items:\n            type: string\n          type: array\n        categories:\n          description: This container returns the primary category ID of the item (as well\n            as the secondary category if the item was listed in two categories).\n          items:\n            $ref: \"#/components/schemas/Category\"\n          type: array\n        compatibilityMatch:\n          description: \"This indicates how well the item matches the compatibility_filter\n            product attributes. Valid Values: EXACT or POSSIBLE Code so that\n            your app gracefully handles any future changes to this list. For\n            implementation help, refer to \u003ca\n            href='https://developer.ebay.com/devzone/rest/api-ref/browse/types/\\\n            CompatibilityMatchEnum.html'\u003eeBay API documentation\u003c/a\u003e\"\n          type: string\n        compatibilityProperties:\n          description: This container returns only the product attributes that are\n            compatible with the item. These attributes were specified in the\n            compatibility_filter in the request. This means that if you passed\n            in 5 attributes and only 4 are compatible, only those 4 are\n            returned. If none of the attributes are compatible, this container\n            is not returned.\n          items:\n            $ref: \"#/components/schemas/CompatibilityProperty\"\n          type: array\n        condition:\n          description: The text describing the condition of the item, such as New or Used.\n            For a list of condition names, see Item Condition IDs and Names.\n            Code so that your app gracefully handles any future changes to this\n            list.\n          type: string\n        conditionId:\n          description: The identifier of the condition of the item. For example, 1000 is\n            the identifier for NEW. For a list of condition names and IDs, see\n            Item Condition IDs and Names. Code so that your app gracefully\n            handles any future changes to this list.\n          type: string\n        currentBidPrice:\n          $ref: \"#/components/schemas/ConvertedAmount\"\n        distanceFromPickupLocation:\n          $ref: \"#/components/schemas/TargetLocation\"\n        energyEfficiencyClass:\n          description: This indicates the European energy efficiency rating (EEK) of the\n            item. Energy efficiency ratings apply to products listed by\n            commercial vendors in electronics categories only. Currently, this\n            field is only applicable for the Germany site, and is only returned\n            if the seller specified the energy efficiency rating through item\n            specifics at listing time. Rating values include A+++, A++, A+, A,\n            B, C, D, E, F, and G.\n          type: string\n        epid:\n          description: An ePID is the eBay product identifier of a product from the eBay\n            product catalog. This indicates the product in which the item\n            belongs.\n          type: string\n        image:\n          $ref: \"#/components/schemas/Image\"\n        itemAffiliateWebUrl:\n          description: The URL to the View Item page of the item, which includes the\n            affiliate tracking ID. This field is only returned if the seller\n            enables affiliate tracking for the item by including the\n            X-EBAY-C-ENDUSERCTX request header in the method.\n          type: string\n        itemGroupHref:\n          description: \"The HATEOAS reference of the parent page of the item group. An item\n            group is an item that has various aspect differences, such as color,\n            size, storage capacity, etc. Note: This field is returned only for\n            item groups.\"\n          type: string\n        itemGroupType:\n          description: \"The indicates the item group type. An item group is an item that\n            has various aspect differences, such as color, size, storage\n            capacity, etc. Currently only the SELLER_DEFINED_VARIATIONS is\n            supported and indicates this is an item group created by the seller.\n            Note: This field is returned only for item groups. Code so that your\n            app gracefully handles any future changes to this list.\"\n          type: string\n        itemHref:\n          description: The URI for the Browse API getItem method, which can be used to\n            retrieve more details about items in the search results.\n          type: string\n        itemId:\n          description: The unique RESTful identifier of the item.\n          type: string\n        itemLocation:\n          $ref: \"#/components/schemas/ItemLocationImpl\"\n        itemWebUrl:\n          description: The URL to the View Item page of the item. This enables you to\n            include a \u0026quot;Report Item on eBay\u0026quot; hyperlink that takes the\n            buyer to the View Item page on eBay. From there they can report any\n            issues regarding this item to eBay.\n          type: string\n        marketingPrice:\n          $ref: \"#/components/schemas/MarketingPrice\"\n        pickupOptions:\n          description: This container returns the local pickup options available to the\n            buyer. This container is only returned if the user is searching for\n            local pickup items and set the local pickup filters in the method\n            request.\n          items:\n            $ref: \"#/components/schemas/PickupOptionSummary\"\n          type: array\n        price:\n          $ref: \"#/components/schemas/ConvertedAmount\"\n        priceDisplayCondition:\n          description: Indicates when in the buying flow the item's price can appear for\n            minimum advertised price (MAP) items, which is the lowest price a\n            retailer can advertise/show for this item. For implementation help,\n            refer to \u003ca\n            href='https://developer.ebay.com/devzone/rest/api-ref/browse/types/PriceDisplayConditionEnum.html'\u003eeBay\n            API documentation\u003c/a\u003e\n          type: string\n        seller:\n          $ref: \"#/components/schemas/Seller\"\n        shippingOptions:\n          description: This container returns the shipping options available to ship the\n            item.\n          items:\n            $ref: \"#/components/schemas/ShippingOptionSummary\"\n          type: array\n        shortDescription:\n          description: \"This text string is derived from the item condition and the item\n            aspects (such as size, color, capacity, model, brand, etc.).\n            Sometimes the title doesn't give enough information but the\n            description is too big. Surfacing the shortDescription can often\n            provide buyers with the additional information that could help them\n            make a buying decision. For example: \u0026quot; title\u0026quot;:\n            \u0026quot;Petrel U42W FPV Drone RC Quadcopter w/HD Camera Live Video One\n            Key Off / Landing\u0026quot;, \u0026quot;shortDescription\u0026quot;: \u0026quot;1 U42W\n            Quadcopter. Syma X5SW-V3 Wifi FPV RC Drone Quadcopter 2.4Ghz 6-Axis\n            Gyro with Headless Mode. Syma X20 Pocket Drone 2.4Ghz Mini RC\n            Quadcopter Headless Mode Altitude Hold. One Key Take Off / Landing\n            function: allow beginner to easy to fly the drone without any\n            skill.\u0026quot;, Restriction: This field is returned by the search\n            method only when fieldgroups = EXTENDED.\"\n          type: string\n        thumbnailImages:\n          description: An array of thumbnail images for the item.\n          items:\n            $ref: \"#/components/schemas/Image\"\n          type: array\n        title:\n          description: \"The seller-created title of the item. Maximum Length: 80 characters\"\n          type: string\n        unitPrice:\n          $ref: \"#/components/schemas/ConvertedAmount\"\n        unitPricingMeasure:\n          description: \"The designation, such as size, weight, volume, count, etc., that\n            was used to specify the quantity of the item. This helps buyers\n            compare prices. For example, the following tells the buyer that the\n            item is 7.99 per 100 grams. \u0026quot;unitPricingMeasure\u0026quot;:\n            \u0026quot;100g\u0026quot;, \u0026quot;unitPrice\u0026quot;: {\n            \u0026nbsp;\u0026nbsp;\u0026quot;value\u0026quot;: \u0026quot;7.99\u0026quot;,\n            \u0026nbsp;\u0026nbsp;\u0026quot;currency\u0026quot;: \u0026quot;GBP\u0026quot;\"\n          type: string\n      type: object\n    Items:\n      description: The type that defines the fields for the item details.\n      properties:\n        commonDescriptions:\n          description: An array of containers for a description and the item IDs of all the\n            items that have this exact description. Often the item variations\n            within an item group all have the same description. Instead of\n            repeating this description in the item details of each item, an\n            description that is shared by at one other item is returned in this\n            container. If the description is unique, it is returned in the\n            items.description field.\n          items:\n            $ref: \"#/components/schemas/CommonDescriptions\"\n          type: array\n        items:\n          description: An array of containers for all the item variations details,\n            excluding the description.\n          items:\n            $ref: \"#/components/schemas/Item\"\n          type: array\n      type: object\n    LegalAddress:\n      description: Type that defines the fields for the seller's address.\n      properties:\n        addressLine1:\n          description: The first line of the street address.\n          type: string\n        addressLine2:\n          description: The second line of the street address. This field is not always\n            used, but can be used for 'Suite Number' or 'Apt Number'.\n          type: string\n        city:\n          description: The city of the address.\n          type: string\n        country:\n          description: The two-letter ISO 3166 standard of the country of the address. For\n            implementation help, refer to \u003ca\n            href='https://developer.ebay.com/devzone/rest/api-ref/browse/types/CountryCodeEnum.html'\u003eeBay\n            API documentation\u003c/a\u003e\n          type: string\n        countryName:\n          description: The name of the country of the address.\n          type: string\n        county:\n          description: The name of the county of the address.\n          type: string\n        postalCode:\n          description: The postal code of the address.\n          type: string\n        stateOrProvince:\n          description: The state or province of the address.\n          type: string\n      type: object\n    MarketingPrice:\n      description: The type that defines the fields that describe a seller discount.\n      properties:\n        discountAmount:\n          $ref: \"#/components/schemas/ConvertedAmount\"\n        discountPercentage:\n          description: This field expresses the percentage of the seller discount based on\n            the value in the originalPrice container.\n          type: string\n        originalPrice:\n          $ref: \"#/components/schemas/ConvertedAmount\"\n        priceTreatment:\n          description: \"Indicates the pricing treatment (discount) that was applied to the\n            price of the item. Note: The pricing treatment affects the way and\n            where the discounted price can be displayed. For implementation\n            help, refer to \u003ca\n            href='https://developer.ebay.com/devzone/rest/api-ref/browse/types/\\\n            PriceTreatmentEnum.html'\u003eeBay API documentation\u003c/a\u003e\"\n          type: string\n      type: object\n    MarketingPrice_0:\n      description: The type that defines the fields that describe a seller discount.\n      properties:\n        discountAmount:\n          $ref: \"#/components/schemas/ConvertedAmount\"\n        discountPercentage:\n          description: This field expresses the percentage of the seller discount based on\n            the value in the originalPrice container.\n          type: string\n        originalPrice:\n          $ref: \"#/components/schemas/ConvertedAmount\"\n      type: object\n    PickupOptionSummary:\n      description: The type that defines the fields for the local pickup options that are\n        available for the item. It is used by the\n        \u003cb\u003e  pickupOptions\u003c/b\u003e  container.\n      properties:\n        pickupLocationType:\n          description: This container returns the local pickup options available to the\n            buyer. Possible values are ARRANGED_LOCATION and STORE.\n          type: string\n      type: object\n    Price:\n      description: The type that defines the fields for the monetary value and currency of\n        the price of the item.\n      properties:\n        convertedFromCurrency:\n          description: The three-letter ISO 4217 code representing the currency of the\n            amount in the convertedFromValue field. This value is the\n            pre-conversion currency. For implementation help, refer to \u003ca\n            href='https://developer.ebay.com/devzone/rest/api-ref/browse/types/CurrencyCodeEnum.html'\u003eeBay\n            API documentation\u003c/a\u003e\n          type: string\n        convertedFromValue:\n          description: The monetary amount before any conversion is performed, in the\n            currency specified by the convertedFromCurrency field. This value is\n            the pre-conversion amount. The value field contains the converted\n            amount of this value, in the currency specified by the currency\n            field.\n          type: string\n        currency:\n          description: \"The three-letter ISO 4217 code representing the currency of the\n            amount in the value field. If currency conversion/localization was\n            performed, this is the post-conversion currency of the amount in the\n            value field. Default: The currency of the user's country. For\n            implementation help, refer to \u003ca\n            href='https://developer.ebay.com/devzone/rest/api-ref/browse/types/\\\n            CurrencyCodeEnum.html'\u003eeBay API documentation\u003c/a\u003e\"\n          type: string\n        value:\n          description: \"The amount of the currency specified in the currency field. The\n            value of currency defaults to the standard currency used by the\n            country of the eBay site offering the item. If currency\n            conversion/localization was performed, this is the post-conversion\n            amount. Default: The currency of the user's country.\"\n          type: string\n      type: object\n    Product:\n      description: The type that defines the fields for the product information of the item.\n      properties:\n        additionalImages:\n          description: An array of containers with the URLs for the product images that are\n            in addition to the primary image.\n          items:\n            $ref: \"#/components/schemas/Image\"\n          type: array\n        additionalProductIdentities:\n          description: An array of product identifiers associated with the item. This\n            container is returned if the seller has associated the eBay Product\n            Identifier (ePID) with the item and in the request fieldgroups is\n            set to PRODUCT.\n          items:\n            $ref: \"#/components/schemas/AdditionalProductIdentity\"\n          type: array\n        aspectGroups:\n          description: An array of containers for the product aspects. Each group contains\n            the aspect group name and the aspect name/value pairs.\n          items:\n            $ref: \"#/components/schemas/AspectGroup\"\n          type: array\n        brand:\n          description: The brand associated with product. To identify the product, this is\n            always used along with MPN (manufacturer part number).\n          type: string\n        description:\n          description: The rich description of an eBay product, which might contain HTML.\n          type: string\n        gtins:\n          description: An array of all the possible GTINs values associated with the\n            product. A GTIN is a unique Global Trade Item number of the item as\n            defined by http://www.gtin.info. This can be a UPC (Universal\n            Product Code), EAN (European Article Number), or an ISBN\n            (International Standard Book Number) value.\n          items:\n            type: string\n          type: array\n        image:\n          $ref: \"#/components/schemas/Image\"\n        mpns:\n          description: An array of all possible MPN values associated with the product. A\n            MPNs is manufacturer part number of the product. To identify the\n            product, this is always used along with brand.\n          items:\n            type: string\n          type: array\n        title:\n          description: The title of the product.\n          type: string\n      type: object\n    ProductIdentity:\n      description: The type that defines the fields for the product identifier type/value\n        pairs of product associated with an item.\n      properties:\n        identifierType:\n          description: The type of product identifier, such as UPC and EAN.\n          type: string\n        identifierValue:\n          description: The product identifier value.\n          type: string\n      type: object\n    RatingHistogram:\n      description: The type that defines the fields for product ratings. Only products that\n        are in the eBay product catalog can be reviewed and rated.\n      properties:\n        count:\n          description: The total number of user ratings that the product has received.\n          type: integer\n        rating:\n          description: This is the average rating for the product. As part of a product\n            review, users rate the product. Products are rated from one star\n            (terrible) to five stars (excellent), with each star having a\n            corresponding point value - one star gets 1 point, two stars get 2\n            points, and so on. If a product had one four-star rating and one\n            five-star rating, its average rating would be 4.5, and this is the\n            value that would appear in this field.\n          type: string\n      type: object\n    Refinement:\n      description: This type defines the fields for the various refinements of an item. You\n        can use the information in this container to create histograms, which\n        help shoppers choose exactly what they want.\n      properties:\n        aspectDistributions:\n          description: An array of containers for the all the aspect refinements.\n          items:\n            $ref: \"#/components/schemas/AspectDistribution\"\n          type: array\n        buyingOptionDistributions:\n          description: An array of containers for the all the buying option refinements.\n          items:\n            $ref: \"#/components/schemas/BuyingOptionDistribution\"\n          type: array\n        categoryDistributions:\n          description: An array of containers for the all the category refinements.\n          items:\n            $ref: \"#/components/schemas/CategoryDistribution\"\n          type: array\n        conditionDistributions:\n          description: An array of containers for the all the condition refinements.\n          items:\n            $ref: \"#/components/schemas/ConditionDistribution\"\n          type: array\n        dominantCategoryId:\n          description: The identifier of the category that most of the items are part of.\n          type: string\n      type: object\n    Region:\n      description: The type that defines information for a region.\n      properties:\n        regionName:\n          description: A free-form text string that indicates the name of the region. This\n            value can be the name of a world region (such as the \u0026quot;Middle\n            East\u0026quot; or \u0026quot;Southeast Asia\u0026quot;), a country, or a domestic\n            region within a country (such as \u0026quot;Alaska/Hawaii\u0026quot; or\n            \u0026quot;US Protectorates\u0026quot;) depending on the value of regionType.\n            This value should be WORLDWIDE if the regionType value is WORLDWIDE.\n          type: string\n        regionType:\n          description: \"An enumeration value that indicates the type of global region.\n            Valid Values: COUNTRY_REGION - Indicates the region is a country, or\n            a domestic region within a country. STATE_OR_PROVINCE - Indicates\n            the region is a state or province, such as Alaska or Hawaii, or the\n            US Protectorates. COUNTRY - Indicates the region is a single\n            country. WORLD_REGION - Indicates the region is a world region, such\n            as the Middle East or Southeast Asia. WORLDWIDE - Indicates the\n            region is the entire world. Code so that your app gracefully handles\n            any future changes to this list. For implementation help, refer to\n            \u003ca\n            href='https://developer.ebay.com/devzone/rest/api-ref/browse/types/\\\n            RegionTypeEnum.html'\u003eeBay API documentation\u003c/a\u003e\"\n          type: string\n      type: object\n    RemoteShopcartResponse:\n      description: The type that defines the fields and containers for the member's eBay\n        cart information.\n      properties:\n        cartItems:\n          description: An array of the items in the member's eBay cart.\n          items:\n            $ref: \"#/components/schemas/CartItem\"\n          type: array\n        cartSubtotal:\n          $ref: \"#/components/schemas/Amount\"\n        cartWebUrl:\n          description: The URL of the member's eBay cart.\n          type: string\n        unavailableCartItems:\n          description: An array of items in the cart that are unavailable. This can be for\n            a variety of reasons such as, when the listing has ended or the item\n            is out of stock. Because a cart never expires, these items will\n            remain in the cart until they are removed.\n          items:\n            $ref: \"#/components/schemas/CartItem\"\n          type: array\n        warnings:\n          description: An array of warning messages. These type of errors do not prevent\n            the call from executing but should be checked.\n          items:\n            $ref: \"#/components/schemas/Error\"\n          type: array\n      type: object\n    RemoveCartItemInput:\n      description: The type that defines the fields for the \u003cb\u003eremoveItem\u003c/b\u003e request.\n      properties:\n        cartItemId:\n          description: The identifier of the item in the cart to be removed. This ID is\n            generated when the item was added to the cart.\n          type: string\n      type: object\n    ReviewRating:\n      description: The type that defines the fields for the rating of a product review.\n      properties:\n        averageRating:\n          description: The average rating given to a product based on customer reviews.\n          type: string\n        ratingHistograms:\n          description: An array of containers for the product rating histograms that shows\n            the review counts and the product rating.\n          items:\n            $ref: \"#/components/schemas/RatingHistogram\"\n          type: array\n        reviewCount:\n          description: The total number of reviews for the item.\n          type: integer\n      type: object\n    SearchByImageRequest:\n      description: The type that defines the fields for the image information.\n      properties:\n        image:\n          description: The Base64 string of the image.\n          type: string\n      type: object\n    SearchPagedCollection:\n      description: \"The type that defines the fields for a paginated result set. The\n        response consists of 0 or more sequenced \u003cem\u003e result sets\u003c/em\u003e where\n        each result sets has 0 or more items. \"\n      properties:\n        href:\n          description: The URI of the current page of results. The following example of the\n            search method returns items 1 thru 5 from the list of items found.\n            https://api.ebay.com/buy/v1/item_summary/search?q=shirt\u0026amp;limit=5\u0026amp;offset=0.\n          type: string\n        itemSummaries:\n          description: An array of items in one page. The items are sorted according to the\n            sorting method specified in the request.\n          items:\n            $ref: \"#/components/schemas/ItemSummary\"\n          type: array\n        limit:\n          description: The value of the limit parameter submitted in the request, which is\n            the maximum number of items to return on a page, from the result\n            set. A result set is the complete set of items returned by the\n            method.\n          type: integer\n        next:\n          description: The URI for the next page of results. This value is returned if\n            there is an additional page of results to return from the result\n            set. The following example of the search method returns items 5 thru\n            10 from the list of items found.\n            https://api.ebay.com/buy/v1/item_summary/search?query=t-shirts\u0026amp;limit=5\u0026amp;offset=10\n          type: string\n        offset:\n          description: This value indicates the offset used for current page of items being\n            returned. Assume the initial request used an offset of 0 and a limit\n            of 3. Then in the first page of results, this value would be 0, and\n            items 1-3 are returned. For the second page, this value is 3 and so\n            on.\n          type: integer\n        prev:\n          description: The URI for the previous page of results. This is returned if there\n            is a previous page of results from the result set. The following\n            example of the search method returns items 1 thru 5 from the list of\n            items found, which would be the first set of items returned.\n            https://api.ebay.com/buy/v1/item_summary/search?query=t-shirts\u0026amp;limit=5\u0026amp;offset=0\n          type: string\n        refinement:\n          $ref: \"#/components/schemas/Refinement\"\n        total:\n          description: The total number of items that match the input criteria.\n          type: integer\n        warnings:\n          description: The container with all the warnings for the request.\n          items:\n            $ref: \"#/components/schemas/Error\"\n          type: array\n      type: object\n    Seller:\n      description: The type that defines the fields for basic information about the seller\n        of the item returned by the \u003cb\u003e item_summary\u003c/b\u003e resource.\n      properties:\n        feedbackPercentage:\n          description: The percentage of the total positive feedback.\n          type: string\n        feedbackScore:\n          description: The feedback score of the seller. This value is based on the ratings\n            from eBay members that bought items from this seller.\n          type: integer\n        sellerAccountType:\n          description: \"Indicates if the seller is a business or an individual. This is\n            determined when the seller registers with eBay. If they register for\n            a business account, this value will be BUSINESS. If they register\n            for a private account, this value will be INDIVIDUAL. This\n            designation is required by the tax laws in some countries. This\n            field is returned only on the following sites. EBAY_AT, EBAY_BE,\n            EBAY_CH, EBAY_DE, EBAY_ES, EBAY_FR, EBAY_GB, EBAY_IE, EBAY_IT,\n            EBAY_PL Valid Values: BUSINESS or INDIVIDUAL Code so that your app\n            gracefully handles any future changes to this list.\"\n          type: string\n        username:\n          description: The user name created by the seller for use on eBay.\n          type: string\n      type: object\n    SellerDetail:\n      description: The type that defines the fields for basic and detailed information\n        about the seller of the item returned by the \u003cb\u003e item\u003c/b\u003e resource.\n      properties:\n        feedbackPercentage:\n          description: The percentage of the total positive feedback.\n          type: string\n        feedbackScore:\n          description: The feedback score of the seller. This value is based on the ratings\n            from eBay members that bought items from this seller.\n          type: integer\n        sellerAccountType:\n          description: \"Indicates if the seller is a business or an individual. This is\n            determined when the seller registers with eBay. If they register for\n            a business account, this value will be BUSINESS. If they register\n            for a private account, this value will be INDIVIDUAL. This\n            designation is required by the tax laws in the following countries:\n            This field is returned only on the following sites. EBAY_AT,\n            EBAY_BE, EBAY_CH, EBAY_DE, EBAY_ES, EBAY_FR, EBAY_GB, EBAY_IE,\n            EBAY_IT, EBAY_PL Valid Values: BUSINESS or INDIVIDUAL Code so that\n            your app gracefully handles any future changes to this list.\"\n          type: string\n        sellerLegalInfo:\n          $ref: \"#/components/schemas/SellerLegalInfo\"\n        username:\n          description: The user name created by the seller for use on eBay.\n          type: string\n      type: object\n    SellerLegalInfo:\n      description: The type that defines the fields for the contact information for a\n        seller.\n      properties:\n        email:\n          description: The seller's business email address.\n          type: string\n        fax:\n          description: The seller' business fax number.\n          type: string\n        imprint:\n          description: This is a free-form string created by the seller. This is\n            information often found on business cards, such as address. This is\n            information used by some countries.\n          type: string\n        legalContactFirstName:\n          description: The seller's first name.\n          type: string\n        legalContactLastName:\n          description: The seller's last name.\n          type: string\n        name:\n          description: The name of the seller's business.\n          type: string\n        phone:\n          description: The seller's business phone number.\n          type: string\n        registrationNumber:\n          description: The seller's registration number. This is information used by some\n            countries.\n          type: string\n        sellerProvidedLegalAddress:\n          $ref: \"#/components/schemas/LegalAddress\"\n        termsOfService:\n          description: This is a free-form string created by the seller. This is the\n            seller's terms or condition, which is in addition to the seller's\n            return policies.\n          type: string\n        vatDetails:\n          description: An array of the seller's VAT (value added tax) IDs and the issuing\n            country. VAT is a tax added by some European countries.\n          items:\n            $ref: \"#/components/schemas/VatDetail\"\n          type: array\n      type: object\n    ShipToLocation:\n      description: The type that defines the fields for the country and postal code of\n        where an item is to be shipped.\n      properties:\n        country:\n          description: The two-letter ISO 3166 standard of the country for where the item\n            is to be shipped. For implementation help, refer to \u003ca\n            href='https://developer.ebay.com/devzone/rest/api-ref/browse/types/CountryCodeEnum.html'\u003eeBay\n            API documentation\u003c/a\u003e\n          type: string\n        postalCode:\n          description: The zip code (postal code) for where the item is to be shipped.\n          type: string\n      type: object\n    ShipToLocations:\n      description: The type that defines the fields that include and exclude geographic\n        regions affecting where the item can be shipped. The seller defines\n        these regions when listing the item.\n      properties:\n        regionExcluded:\n          description: A array of containers for regions that are specifically excluded\n            from a region set. You can use this to exclude a specific regionName\n            from a regionType that you specifically include.\n          items:\n            $ref: \"#/components/schemas/Region\"\n          type: array\n        regionIncluded:\n          description: A array of containers for regions that are specifically included in\n            a region set. You can use this to exclude a specific regionName from\n            a regionType that you specifically include.\n          items:\n            $ref: \"#/components/schemas/Region\"\n          type: array\n      type: object\n    ShippingOption:\n      description: The type that defines the fields for the details of a shipping provider.\n      properties:\n        additionalShippingCostPerUnit:\n          $ref: \"#/components/schemas/ConvertedAmount\"\n        cutOffDateUsedForEstimate:\n          description: The deadline date that the item must be purchased by in order to be\n            received by the buyer within the delivery window (\n            maxEstimatedDeliveryDate and minEstimatedDeliveryDate fields). This\n            field is returned only for items that are eligible for 'Same Day\n            Handling'. For these items, the value of this field is what is\n            displayed in the Delivery line on the View Item page. This value is\n            returned in UTC format (yyyy-MM-ddThh:mm:ss.sssZ), which you can\n            convert into the local time of the buyer.\n          type: string\n        fulfilledThrough:\n          description: If the item is being shipped by eBay's Global Shipping Program, this\n            field returns GLOBAL_SHIPPING. Otherwise this field is null. For\n            implementation help, refer to \u003ca\n            href='https://developer.ebay.com/devzone/rest/api-ref/browse/types/FulfilledThroughEnum.html'\u003eeBay\n            API documentation\u003c/a\u003e\n          type: string\n        importCharges:\n          $ref: \"#/components/schemas/ConvertedAmount\"\n        maxEstimatedDeliveryDate:\n          description: \"The end date of the delivery window (latest projected delivery\n            date). This value is returned in UTC format\n            (yyyy-MM-ddThh:mm:ss.sssZ), which you can convert into the local\n            time of the buyer. Note: For the best accuracy, always include the\n            location of where the item is be shipped in the contextualLocation\n            values of the X-EBAY-C-ENDUSERCTX request header.\"\n          type: string\n        minEstimatedDeliveryDate:\n          description: \"The start date of the delivery window (earliest projected delivery\n            date). This value is returned in UTC format\n            (yyyy-MM-ddThh:mm:ss.sssZ), which you can convert into the local\n            time of the buyer. Note: For the best accuracy, always include the\n            location of where the item is be shipped in the contextualLocation\n            values of the X-EBAY-C-ENDUSERCTX request header.\"\n          type: string\n        quantityUsedForEstimate:\n          description: The number of items used when calculating the estimation information.\n          type: integer\n        shipToLocationUsedForEstimate:\n          $ref: \"#/components/schemas/ShipToLocation\"\n        shippingCarrierCode:\n          description: A name of the shipping provider, such as FedEx, or USPS.\n          type: string\n        shippingCost:\n          $ref: \"#/components/schemas/ConvertedAmount\"\n        shippingCostType:\n          description: \"Indicates the class of the shipping cost. Valid Values: FIXED or\n            CALCULATED Code so that your app gracefully handles any future\n            changes to this list.\"\n          type: string\n        shippingServiceCode:\n          description: The type of shipping service. For example, USPS First Class.\n          type: string\n        trademarkSymbol:\n          description: Any trademark symbol, such as \u0026trade; or \u0026reg;, that needs to be\n            shown in superscript next to the shipping service name.\n          type: string\n        type:\n          description: The type of a shipping option, such as EXPEDITED, ONE_DAY, STANDARD,\n            ECONOMY, PICKUP, etc.\n          type: string\n      type: object\n    ShippingOptionSummary:\n      description: The type that defines the fields for the shipping information.\n      properties:\n        maxEstimatedDeliveryDate:\n          description: \"The end date of the delivery window (latest projected delivery\n            date). This value is returned in UTC format\n            (yyyy-MM-ddThh:mm:ss.sssZ), which you can convert into the local\n            time of the buyer. Note: For the best accuracy, always include the\n            contextualLocation values in the X-EBAY-C-ENDUSERCTX request\n            header.\"\n          type: string\n        minEstimatedDeliveryDate:\n          description: \"The start date of the delivery window (earliest projected delivery\n            date). This value is returned in UTC format\n            (yyyy-MM-ddThh:mm:ss.sssZ), which you can convert into the local\n            time of the buyer. Note: For the best accuracy, always include the\n            contextualLocation values in the X-EBAY-C-ENDUSERCTX request\n            header.\"\n          type: string\n        shippingCost:\n          $ref: \"#/components/schemas/ConvertedAmount\"\n        shippingCostType:\n          description: Indicates the type of shipping used to ship the item. Possible\n            values are FIXED (flat-rate shipping) and CALCULATED (shipping cost\n            calculated based on item and buyer location).\n          type: string\n      type: object\n    TargetLocation:\n      description: \"The type that defines the fields for the distance between the item\n        location and the buyer's location. \"\n      properties:\n        unitOfMeasure:\n          description: This value shows the unit of measurement used to measure the\n            distance between the location of the item and the buyer's location.\n            This value is typically mi or km.\n          type: string\n        value:\n          description: This value indicates the distance (measured in the measurement unit\n            in the unitOfMeasure field) between the item location and the\n            buyer's location.\n          type: string\n      type: object\n    TaxJurisdiction:\n      description: The type that defines the fields for the tax jurisdiction details.\n      properties:\n        region:\n          $ref: \"#/components/schemas/Region\"\n        taxJurisdictionId:\n          description: The identifier of the tax jurisdiction.\n          type: string\n      type: object\n    Taxes:\n      description: The type that defines the tax fields.\n      properties:\n        ebayCollectAndRemitTax:\n          description: This field is returned only when the value is true, which indicates\n            that eBay will collect tax (sales tax, Goods and Services tax, or\n            VAT) for at least one line item in the order, and remit the tax to\n            the taxing authority of the buyer's residence.\n          type: boolean\n        includedInPrice:\n          description: Indicates if tax was applied for the cost of the item.\n          type: boolean\n        shippingAndHandlingTaxed:\n          description: Indicates if tax is applied for the shipping cost.\n          type: boolean\n        taxJurisdiction:\n          $ref: \"#/components/schemas/TaxJurisdiction\"\n        taxPercentage:\n          description: The percentage of tax.\n          type: string\n        taxType:\n          description: \"The container that returns the tax type. Valid Values:\n            STATE_SALES_TAX - Indicates this is a state sales tax. VAT -\n            Indicates this is a value add tax (VAT) tax. PROVINCE_SALES_TAX -\n            Indicates this is a province sales tax. REGION - Indicates this is a\n            region tax. Code so that your app gracefully handles any future\n            changes to this list. For implementation help, refer to \u003ca\n            href='https://developer.ebay.com/devzone/rest/api-ref/browse/types/\\\n            TaxType.html'\u003eeBay API documentation\u003c/a\u003e\"\n          type: string\n      type: object\n    TimeDuration:\n      description: The type that defines the fields for a period of time in the\n        time-measurement units supplied.\n      properties:\n        unit:\n          description: \"An enumeration value that indicates the units (such as hours) of\n            the time span. The enumeration value in this field defines the\n            period of time being used to measure the duration. Valid Values:\n            YEAR, MONTH, DAY, HOUR, CALENDAR_DAY, BUSINESS_DAY, MINUTE, SECOND,\n            or MILLISECOND Code so that your app gracefully handles any future\n            changes to this list. For implementation help, refer to \u003ca\n            href='https://developer.ebay.com/devzone/rest/api-ref/browse/types/\\\n            TimeDurationUnitEnum.html'\u003eeBay API documentation\u003c/a\u003e\"\n          type: string\n        value:\n          description: Retrieves the duration of the time span (no units).The value in this\n            field indicates the number of years, months, days, hours, or minutes\n            in the defined period.\n          type: integer\n      type: object\n    TypedNameValue:\n      description: The type that defines the fields for the name/value pairs for item\n        aspects.\n      properties:\n        name:\n          description: The text representing the name of the aspect for the name/value\n            pair, such as Color.\n          type: string\n        type:\n          description: \"Indicates if the value being returned is a string or an array of\n            values. Valid Values: STRING - Indicates the value returned is a\n            string. STRING_ARRAY - Indicates the value returned is an array of\n            strings. Code so that your app gracefully handles any future changes\n            to this list. For implementation help, refer to \u003ca\n            href='https://developer.ebay.com/devzone/rest/api-ref/browse/types/\\\n            ValueTypeEnum.html'\u003eeBay API documentation\u003c/a\u003e\"\n          type: string\n        value:\n          description: The value of the aspect for the name/value pair, such as Red.\n          type: string\n      type: object\n    UpdateCartItemInput:\n      description: The type that defines the fields for the \u003cb\u003eupdateQuantity\u003c/b\u003e request.\n      properties:\n        cartItemId:\n          description: The identifier of the item in the cart to be updated. This ID is\n            generated when the item was added to the cart.\n          type: string\n        quantity:\n          description: The new quantity for the item that is being updated.\n          type: integer\n      type: object\n    VatDetail:\n      description: The type the defines the fields for the VAT (value add tax) information.\n      properties:\n        issuingCountry:\n          description: The two-letter ISO 3166 standard of the country issuing the seller's\n            VAT (value added tax) ID. VAT is a tax added by some European\n            countries. For implementation help, refer to \u003ca\n            href='https://developer.ebay.com/devzone/rest/api-ref/browse/types/CountryCodeEnum.html'\u003eeBay\n            API documentation\u003c/a\u003e\n          type: string\n        vatId:\n          description: The seller's VAT (value added tax) ID. VAT is a tax added by some\n            European countries.\n          type: string\n      type: object\n",
			"canonicalURL": "/github.com/restful-ma/thresholds@5b0b2a3322d3b2b7c0e0f2c0c0ad0e524e67bf82/-/blob/benchmark-repository/openapi/ebay.com-buy-browse-v1_beta.24.0-swagger.yaml",
			"externalURLs": [
				{
					"url": "https://github.com/restful-ma/thresholds/blob/5b0b2a3322d3b2b7c0e0f2c0c0ad0e524e67bf82/benchmark-repository/openapi/ebay.com-buy-browse-v1_beta.24.0-swagger.yaml",
					"serviceKind": "GITHUB"
				}
			]
		}
	},
	"Error": "notImplemented: path \"/item_summary/search_by_image\": post: responses: 200: contents: unsupported content types: [*/*]",
	"NotImplemented": [
		"oauth2 security",
		"unsupported content types"
	]
}