{
	"File": {
		"__typename": "FileMatch",
		"repository": {
			"name": "github.com/restful-ma/thresholds"
		},
		"file": {
			"name": "azure.com-security-iotSecuritySolutionAnalytics-2019-08-01-swagger.yaml",
			"size": 0,
			"path": "benchmark-repository/openapi/azure.com-security-iotSecuritySolutionAnalytics-2019-08-01-swagger.yaml",
			"byteSize": 50189,
			"content": "openapi: 3.0.0\ninfo:\n  description: API spec for Microsoft.Security (Azure Security Center) resource provider\n  title: Security Center\n  version: 2019-08-01\n  x-apisguru-categories:\n    - cloud\n  x-logo:\n    url: https://assets.onestore.ms/cdnfiles/onestorerolling-1606-01000/shell/v3/images/logo/microsoft.png\n  x-origin:\n    - format: swagger\n      url: https://raw.githubusercontent.com/Azure/azure-rest-api-specs/master/specification/security/resource-manager/Microsoft.Security/stable/2019-08-01/iotSecuritySolutionAnalytics.json\n      version: \"2.0\"\n  x-preferred: true\n  x-providerName: azure.com\n  x-serviceName: security-iotSecuritySolutionAnalytics\n  x-tags:\n    - Azure\n    - Microsoft\nsecurity:\n  - azure_auth:\n      - user_impersonation\npaths:\n  \"/subscriptions/{subscriptionId}/resourceGroups/{resourceGroupName}/providers/Microsoft.Security/iotSecuritySolutions/{solutionName}/analyticsModels\":\n    get:\n      description: Use this method to get IoT security Analytics metrics in an array.\n      operationId: IotSecuritySolutionAnalytics_List\n      parameters:\n        - description: API version for the operation\n          in: query\n          name: api-version\n          required: true\n          schema:\n            type: string\n          examples:\n            Get Security Solution Analytics:\n              value: 2019-08-01\n        - description: Azure subscription ID\n          in: path\n          name: subscriptionId\n          required: true\n          schema:\n            type: string\n            pattern: ^[0-9A-Fa-f]{8}-([0-9A-Fa-f]{4}-){3}[0-9A-Fa-f]{12}$\n          examples:\n            Get Security Solution Analytics:\n              value: 20ff7fc3-e762-44dd-bd96-b71116dcdc23\n        - description: The name of the resource group within the user's subscription. The\n            name is case insensitive.\n          in: path\n          name: resourceGroupName\n          required: true\n          x-ms-parameter-location: method\n          schema:\n            type: string\n            minLength: 1\n            maxLength: 90\n            pattern: ^[-\\w\\._\\(\\)]+$\n          examples:\n            Get Security Solution Analytics:\n              value: MyGroup\n        - $ref: \"#/components/parameters/SolutionName\"\n      responses:\n        \"200\":\n          description: OK\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/IoTSecuritySolutionAnalyticsModelList\"\n              examples:\n                Get Security Solution Analytics:\n                  $ref: \"#/components/examples/Get_Security_Solution_Analytics\"\n        default:\n          description: Error response describing why the operation failed.\n          content:\n            application/json:\n              schema:\n                description: Error response structure.\n                properties:\n                  error:\n                    description: Error details.\n                    properties:\n                      code:\n                        description: An identifier for the error. Codes are invariant and\n                          are intended to be consumed programmatically.\n                        readOnly: true\n                        type: string\n                      message:\n                        description: A message describing the error, intended to be\n                          suitable for display in a user interface.\n                        readOnly: true\n                        type: string\n                    type: object\n                    x-ms-external: true\n                type: object\n                x-ms-external: true\n      tags:\n        - IoT Security Solution Analytics\n  \"/subscriptions/{subscriptionId}/resourceGroups/{resourceGroupName}/providers/Microsoft.Security/iotSecuritySolutions/{solutionName}/analyticsModels/default\":\n    get:\n      description: Use this method to get IoT Security Analytics metrics.\n      operationId: IotSecuritySolutionAnalytics_Get\n      parameters:\n        - description: API version for the operation\n          in: query\n          name: api-version\n          required: true\n          schema:\n            type: string\n          examples:\n            Get Security Solution Analytics:\n              value: 2019-08-01\n        - description: Azure subscription ID\n          in: path\n          name: subscriptionId\n          required: true\n          schema:\n            type: string\n            pattern: ^[0-9A-Fa-f]{8}-([0-9A-Fa-f]{4}-){3}[0-9A-Fa-f]{12}$\n          examples:\n            Get Security Solution Analytics:\n              value: 20ff7fc3-e762-44dd-bd96-b71116dcdc23\n        - description: The name of the resource group within the user's subscription. The\n            name is case insensitive.\n          in: path\n          name: resourceGroupName\n          required: true\n          x-ms-parameter-location: method\n          schema:\n            type: string\n            minLength: 1\n            maxLength: 90\n            pattern: ^[-\\w\\._\\(\\)]+$\n          examples:\n            Get Security Solution Analytics:\n              value: MyGroup\n        - $ref: \"#/components/parameters/SolutionName\"\n      responses:\n        \"200\":\n          description: OK\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/IoTSecuritySolutionAnalyticsModel\"\n              examples:\n                Get Security Solution Analytics:\n                  $ref: \"#/components/examples/Get_Security_Solution_Analytics\"\n        default:\n          description: Error response describing why the operation failed.\n          content:\n            application/json:\n              schema:\n                description: Error response structure.\n                properties:\n                  error:\n                    description: Error details.\n                    properties:\n                      code:\n                        description: An identifier for the error. Codes are invariant and\n                          are intended to be consumed programmatically.\n                        readOnly: true\n                        type: string\n                      message:\n                        description: A message describing the error, intended to be\n                          suitable for display in a user interface.\n                        readOnly: true\n                        type: string\n                    type: object\n                    x-ms-external: true\n                type: object\n                x-ms-external: true\n      tags:\n        - IoT Security Solution Analytics\n  \"/subscriptions/{subscriptionId}/resourceGroups/{resourceGroupName}/providers/Microsoft.Security/iotSecuritySolutions/{solutionName}/analyticsModels/default/aggregatedAlerts\":\n    get:\n      description: Use this method to get the aggregated alert list of yours IoT Security\n        solution.\n      operationId: IotSecuritySolutionsAnalyticsAggregatedAlert_List\n      parameters:\n        - description: API version for the operation\n          in: query\n          name: api-version\n          required: true\n          schema:\n            type: string\n          examples:\n            Get the aggregated alert list of yours IoT Security solution:\n              value: 2019-08-01\n        - description: Azure subscription ID\n          in: path\n          name: subscriptionId\n          required: true\n          schema:\n            type: string\n            pattern: ^[0-9A-Fa-f]{8}-([0-9A-Fa-f]{4}-){3}[0-9A-Fa-f]{12}$\n          examples:\n            Get the aggregated alert list of yours IoT Security solution:\n              value: 20ff7fc3-e762-44dd-bd96-b71116dcdc23\n        - description: The name of the resource group within the user's subscription. The\n            name is case insensitive.\n          in: path\n          name: resourceGroupName\n          required: true\n          x-ms-parameter-location: method\n          schema:\n            type: string\n            minLength: 1\n            maxLength: 90\n            pattern: ^[-\\w\\._\\(\\)]+$\n          examples:\n            Get the aggregated alert list of yours IoT Security solution:\n              value: MyGroup\n        - $ref: \"#/components/parameters/SolutionName\"\n        - description: Number of results to retrieve.\n          in: query\n          name: $top\n          required: false\n          schema:\n            type: integer\n      responses:\n        \"200\":\n          description: OK\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/IoTSecurityAggregatedAlertList\"\n              examples:\n                Get the aggregated alert list of yours IoT Security solution:\n                  $ref: \"#/components/examples/Get_the_aggregated_alert_list_of_you\\\n                    rs_IoT_Security_solution\"\n        default:\n          description: Error response describing why the operation failed.\n          content:\n            application/json:\n              schema:\n                description: Error response structure.\n                properties:\n                  error:\n                    description: Error details.\n                    properties:\n                      code:\n                        description: An identifier for the error. Codes are invariant and\n                          are intended to be consumed programmatically.\n                        readOnly: true\n                        type: string\n                      message:\n                        description: A message describing the error, intended to be\n                          suitable for display in a user interface.\n                        readOnly: true\n                        type: string\n                    type: object\n                    x-ms-external: true\n                type: object\n                x-ms-external: true\n      tags:\n        - Aggregated Alert\n      x-ms-pageable:\n        nextLinkName: nextLink\n  \"/subscriptions/{subscriptionId}/resourceGroups/{resourceGroupName}/providers/Microsoft.Security/iotSecuritySolutions/{solutionName}/analyticsModels/default/aggregatedAlerts/{aggregatedAlertName}\":\n    get:\n      description: Use this method to get a single the aggregated alert of yours IoT\n        Security solution. This aggregation is performed by alert name.\n      operationId: IotSecuritySolutionsAnalyticsAggregatedAlert_Get\n      parameters:\n        - description: API version for the operation\n          in: query\n          name: api-version\n          required: true\n          schema:\n            type: string\n          examples:\n            Get the aggregated security analytics alert of yours IoT Security solution. This aggregation is performed by alert name:\n              value: 2019-08-01\n        - description: Azure subscription ID\n          in: path\n          name: subscriptionId\n          required: true\n          schema:\n            type: string\n            pattern: ^[0-9A-Fa-f]{8}-([0-9A-Fa-f]{4}-){3}[0-9A-Fa-f]{12}$\n          examples:\n            Get the aggregated security analytics alert of yours IoT Security solution. This aggregation is performed by alert name:\n              value: 20ff7fc3-e762-44dd-bd96-b71116dcdc23\n        - description: The name of the resource group within the user's subscription. The\n            name is case insensitive.\n          in: path\n          name: resourceGroupName\n          required: true\n          x-ms-parameter-location: method\n          schema:\n            type: string\n            minLength: 1\n            maxLength: 90\n            pattern: ^[-\\w\\._\\(\\)]+$\n          examples:\n            Get the aggregated security analytics alert of yours IoT Security solution. This aggregation is performed by alert name:\n              value: MyGroup\n        - $ref: \"#/components/parameters/SolutionName\"\n        - $ref: \"#/components/parameters/AggregatedAlertName\"\n      responses:\n        \"200\":\n          description: OK\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/IoTSecurityAggregatedAlert\"\n              examples:\n                Get the aggregated security analytics alert of yours IoT Security solution. This aggregation is performed by alert name:\n                  $ref: \"#/components/examples/Get_the_aggregated_security_analytic\\\n                    s_alert_of_yours_IoT_Security_solution._This_aggregation_is\\\n                    _performed_by_alert_name\"\n        default:\n          description: Error response describing why the operation failed.\n          content:\n            application/json:\n              schema:\n                description: Error response structure.\n                properties:\n                  error:\n                    description: Error details.\n                    properties:\n                      code:\n                        description: An identifier for the error. Codes are invariant and\n                          are intended to be consumed programmatically.\n                        readOnly: true\n                        type: string\n                      message:\n                        description: A message describing the error, intended to be\n                          suitable for display in a user interface.\n                        readOnly: true\n                        type: string\n                    type: object\n                    x-ms-external: true\n                type: object\n                x-ms-external: true\n      tags:\n        - Aggregated Alert\n  \"/subscriptions/{subscriptionId}/resourceGroups/{resourceGroupName}/providers/Microsoft.Security/iotSecuritySolutions/{solutionName}/analyticsModels/default/aggregatedAlerts/{aggregatedAlertName}/dismiss\":\n    post:\n      description: Use this method to dismiss an aggregated IoT Security Solution Alert.\n      operationId: IotSecuritySolutionsAnalyticsAggregatedAlert_Dismiss\n      parameters:\n        - description: API version for the operation\n          in: query\n          name: api-version\n          required: true\n          schema:\n            type: string\n          examples:\n            Dismiss an aggregated IoT Security Solution Alert:\n              value: 2019-08-01\n        - description: Azure subscription ID\n          in: path\n          name: subscriptionId\n          required: true\n          schema:\n            type: string\n            pattern: ^[0-9A-Fa-f]{8}-([0-9A-Fa-f]{4}-){3}[0-9A-Fa-f]{12}$\n          examples:\n            Dismiss an aggregated IoT Security Solution Alert:\n              value: 20ff7fc3-e762-44dd-bd96-b71116dcdc23\n        - description: The name of the resource group within the user's subscription. The\n            name is case insensitive.\n          in: path\n          name: resourceGroupName\n          required: true\n          x-ms-parameter-location: method\n          schema:\n            type: string\n            minLength: 1\n            maxLength: 90\n            pattern: ^[-\\w\\._\\(\\)]+$\n          examples:\n            Dismiss an aggregated IoT Security Solution Alert:\n              value: IoTEdgeResources\n        - $ref: \"#/components/parameters/SolutionName\"\n        - $ref: \"#/components/parameters/AggregatedAlertName\"\n      responses:\n        \"200\":\n          description: This aggregate alert is permanently dismissed.\n        default:\n          description: Error response describing why the operation failed.\n          content:\n            application/json:\n              schema:\n                description: Error response structure.\n                properties:\n                  error:\n                    description: Error details.\n                    properties:\n                      code:\n                        description: An identifier for the error. Codes are invariant and\n                          are intended to be consumed programmatically.\n                        readOnly: true\n                        type: string\n                      message:\n                        description: A message describing the error, intended to be\n                          suitable for display in a user interface.\n                        readOnly: true\n                        type: string\n                    type: object\n                    x-ms-external: true\n                type: object\n                x-ms-external: true\n      tags:\n        - Aggregated Alert\n  \"/subscriptions/{subscriptionId}/resourceGroups/{resourceGroupName}/providers/Microsoft.Security/iotSecuritySolutions/{solutionName}/analyticsModels/default/aggregatedRecommendations\":\n    get:\n      description: Use this method to get the list of aggregated security analytics\n        recommendations of yours IoT Security solution.\n      operationId: IotSecuritySolutionsAnalyticsRecommendation_List\n      parameters:\n        - description: API version for the operation\n          in: query\n          name: api-version\n          required: true\n          schema:\n            type: string\n          examples:\n            Get the list of aggregated security analytics recommendations of yours IoT Security solution:\n              value: 2019-08-01\n        - description: Azure subscription ID\n          in: path\n          name: subscriptionId\n          required: true\n          schema:\n            type: string\n            pattern: ^[0-9A-Fa-f]{8}-([0-9A-Fa-f]{4}-){3}[0-9A-Fa-f]{12}$\n          examples:\n            Get the list of aggregated security analytics recommendations of yours IoT Security solution:\n              value: 075423e9-7d33-4166-8bdf-3920b04e3735\n        - description: The name of the resource group within the user's subscription. The\n            name is case insensitive.\n          in: path\n          name: resourceGroupName\n          required: true\n          x-ms-parameter-location: method\n          schema:\n            type: string\n            minLength: 1\n            maxLength: 90\n            pattern: ^[-\\w\\._\\(\\)]+$\n          examples:\n            Get the list of aggregated security analytics recommendations of yours IoT Security solution:\n              value: IoTEdgeResources\n        - $ref: \"#/components/parameters/SolutionName\"\n        - description: Number of results to retrieve.\n          in: query\n          name: $top\n          required: false\n          schema:\n            type: integer\n      responses:\n        \"200\":\n          description: OK\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/IoTSecurityAggregatedRecommendationList\"\n              examples:\n                Get the list of aggregated security analytics recommendations of yours IoT Security solution:\n                  $ref: \"#/components/examples/Get_the_list_of_aggregated_security_\\\n                    analytics_recommendations_of_yours_IoT_Security_solution\"\n        default:\n          description: Error response describing why the operation failed.\n          content:\n            application/json:\n              schema:\n                description: Error response structure.\n                properties:\n                  error:\n                    description: Error details.\n                    properties:\n                      code:\n                        description: An identifier for the error. Codes are invariant and\n                          are intended to be consumed programmatically.\n                        readOnly: true\n                        type: string\n                      message:\n                        description: A message describing the error, intended to be\n                          suitable for display in a user interface.\n                        readOnly: true\n                        type: string\n                    type: object\n                    x-ms-external: true\n                type: object\n                x-ms-external: true\n      tags:\n        - Aggregated Recommendation\n      x-ms-pageable:\n        nextLinkName: nextLink\n  \"/subscriptions/{subscriptionId}/resourceGroups/{resourceGroupName}/providers/Microsoft.Security/iotSecuritySolutions/{solutionName}/analyticsModels/default/aggregatedRecommendations/{aggregatedRecommendationName}\":\n    get:\n      description: Use this method to get the aggregated security analytics recommendation\n        of yours IoT Security solution. This aggregation is performed by\n        recommendation name.\n      operationId: IotSecuritySolutionsAnalyticsRecommendation_Get\n      parameters:\n        - description: API version for the operation\n          in: query\n          name: api-version\n          required: true\n          schema:\n            type: string\n          examples:\n            Get the aggregated security analytics recommendation of yours IoT Security solution:\n              value: 2019-08-01\n        - description: Azure subscription ID\n          in: path\n          name: subscriptionId\n          required: true\n          schema:\n            type: string\n            pattern: ^[0-9A-Fa-f]{8}-([0-9A-Fa-f]{4}-){3}[0-9A-Fa-f]{12}$\n          examples:\n            Get the aggregated security analytics recommendation of yours IoT Security solution:\n              value: 075423e9-7d33-4166-8bdf-3920b04e3735\n        - description: The name of the resource group within the user's subscription. The\n            name is case insensitive.\n          in: path\n          name: resourceGroupName\n          required: true\n          x-ms-parameter-location: method\n          schema:\n            type: string\n            minLength: 1\n            maxLength: 90\n            pattern: ^[-\\w\\._\\(\\)]+$\n          examples:\n            Get the aggregated security analytics recommendation of yours IoT Security solution:\n              value: IoTEdgeResources\n        - $ref: \"#/components/parameters/SolutionName\"\n        - $ref: \"#/components/parameters/AggregatedRecommendationName\"\n      responses:\n        \"200\":\n          description: OK\n          content:\n            application/json:\n              schema:\n                $ref: \"#/components/schemas/IoTSecurityAggregatedRecommendation\"\n              examples:\n                Get the aggregated security analytics recommendation of yours IoT Security solution:\n                  $ref: \"#/components/examples/Get_the_aggregated_security_analytic\\\n                    s_recommendation_of_yours_IoT_Security_solution\"\n        default:\n          description: Error response describing why the operation failed.\n          content:\n            application/json:\n              schema:\n                description: Error response structure.\n                properties:\n                  error:\n                    description: Error details.\n                    properties:\n                      code:\n                        description: An identifier for the error. Codes are invariant and\n                          are intended to be consumed programmatically.\n                        readOnly: true\n                        type: string\n                      message:\n                        description: A message describing the error, intended to be\n                          suitable for display in a user interface.\n                        readOnly: true\n                        type: string\n                    type: object\n                    x-ms-external: true\n                type: object\n                x-ms-external: true\n      tags:\n        - Aggregated Recommendation\nservers:\n  - url: https://management.azure.com\ncomponents:\n  examples:\n    Get_Security_Solution_Analytics:\n      value:\n        id: /subscriptions/20ff7fc3-e762-44dd-bd96-b71116dcdc23/resourceGroups/MyGroup/providers/Microsoft.Security/IoTSecuritySolutions/Locations/eastus/default\n        name: /subscriptions/20ff7fc3-e762-44dd-bd96-b71116dcdc23/resourceGroups/MyGroup/providers/Microsoft.Security/IoTSecuritySolutions/Locations/eastus/default\n        properties:\n          devicesMetrics:\n            - date: 2019-02-01T00:00:00Z\n              devicesMetrics:\n                high: 3\n                low: 70\n                medium: 15\n            - date: 2019-02-02T00:00:00Z\n              devicesMetrics:\n                high: 3\n                low: 65\n                medium: 45\n          metrics:\n            high: 5\n            low: 102\n            medium: 200\n          mostPrevalentDeviceAlerts:\n            - alertDisplayName: Custom Alert - number of device to cloud messages in AMQP\n                protocol is not in the allowed range\n              alertsCount: 200\n              reportedSeverity: Low\n            - alertDisplayName: Custom Alert - execution of a process that is not allowed\n              alertsCount: 170\n              reportedSeverity: Medium\n            - alertDisplayName: Successful Bruteforce\n              alertsCount: 150\n              reportedSeverity: Low\n          mostPrevalentDeviceRecommendations:\n            - devicesCount: 200\n              recommendationDisplayName: Install the Azure Security of Things Agent\n              reportedSeverity: Low\n            - devicesCount: 170\n              recommendationDisplayName: High level permissions configured in Edge model twin for Edge\n                module\n              reportedSeverity: Low\n            - devicesCount: 150\n              recommendationDisplayName: Same Authentication Credentials used by multiple devices\n              reportedSeverity: Medium\n          topAlertedDevices:\n            - alertsCount: 200\n              deviceId: id1\n            - alertsCount: 170\n              deviceId: id2\n            - alertsCount: 150\n              deviceId: id3\n          unhealthyDeviceCount: 1200\n        type: Microsoft.Security/IoTSecuritySolutionAnalyticsModel\n    Get_the_aggregated_alert_list_of_yours_IoT_Security_solution:\n      value:\n        value:\n          - id: /subscriptions/20ff7fc3-e762-44dd-bd96-b71116dcdc23/resourceGroups/MyGroup/providers/Microsoft.Security/IoTSecuritySolutions/Locations/eastus/default/IoT_Bruteforce_Fail/2019-02-02\n            name: /subscriptions/20ff7fc3-e762-44dd-bd96-b71116dcdc23/resourceGroups/MyGroup/providers/Microsoft.Security/IoTSecuritySolutions/Locations/eastus/default/IoT_Bruteforce_Fail/2019-02-02\n            properties:\n              actionTaken: Detected\n              aggregatedDateUtc: 2019-02-02\n              alertDisplayName: Failed Bruteforce\n              alertType: IoT_Bruteforce_Fail\n              count: 50\n              description: Multiple unsuccsseful login attempts identified. A Bruteforce\n                attack on the device failed.\n              effectedResourceType: IoT Device\n              logAnalyticsQuery: SecurityAlert | where tolower(ResourceId) ==\n                tolower('/subscriptions/b77ec8a9-04ed-48d2-a87a-e5887b978ba6/resourceGroups/IoT-Solution-DemoEnv/providers/Microsoft.Devices/IotHubs/rtogm-hub')\n                and tolower(AlertName) == tolower('Custom Alert - number of\n                device to cloud messages in MQTT protocol is not in the allowed\n                range') | extend\n                DeviceId=parse_json(ExtendedProperties)['DeviceId'] | project\n                DeviceId, TimeGenerated, DisplayName, AlertSeverity,\n                Description, RemediationSteps, ExtendedProperties\n              remediationSteps: \"\"\n              reportedSeverity: Low\n              systemSource: Devices\n              vendorName: Microsoft\n            type: Microsoft.Security/IoTSecurityAggregatedAlert\n          - id: /subscriptions/20ff7fc3-e762-44dd-bd96-b71116dcdc23/resourceGroups/MyGroup/providers/Microsoft.Security/IoTSecuritySolutions/Locations/eastus/default/IoT_Bruteforce_Success/2019-02-02\n            name: /subscriptions/20ff7fc3-e762-44dd-bd96-b71116dcdc23/resourceGroups/MyGroup/providers/Microsoft.Security/IoTSecuritySolutions/Locations/eastus/default/IoT_Bruteforce_Success/2019-02-02\n            properties:\n              actionTaken: Detected\n              aggregatedDateUtc: 2019-02-02\n              alertDisplayName: Successful Bruteforce\n              alertType: IoT_Bruteforce_Success\n              count: 600000\n              description: Multiple unsuccsseful login attempts identified followed by a\n                succssful login. A Bruteforce attack on the device was\n                Successfule\n              effectedResourceType: IoT Device\n              logAnalyticsQuery: SecurityAlert | where tolower(ResourceId) ==\n                tolower('/subscriptions/b77ec8a9-04ed-48d2-a87a-e5887b978ba6/resourceGroups/IoT-Solution-DemoEnv/providers/Microsoft.Devices/IotHubs/rtogm-hub')\n                and tolower(AlertName) == tolower('Custom Alert - number of\n                device to cloud messages in MQTT protocol is not in the allowed\n                range') | extend\n                DeviceId=parse_json(ExtendedProperties)['DeviceId'] | project\n                DeviceId, TimeGenerated, DisplayName, AlertSeverity,\n                Description, RemediationSteps, ExtendedProperties\n              remediationSteps: \"\"\n              reportedSeverity: Low\n              systemSource: Devices\n              vendorName: Microsoft\n            type: Microsoft.Security/IoTSecurityAggregatedAlert\n    Get_the_aggregated_security_analytics_alert_of_yours_IoT_Security_solution._This_aggregation_is_performed_by_alert_name:\n      value:\n        id: /subscriptions/20ff7fc3-e762-44dd-bd96-b71116dcdc23/resourceGroups/MyGroup/providers/Microsoft.Security/IoTSecuritySolutions/Locations/eastus/default/IoT_Bruteforce_Fail/2019-02-02\n        name: /subscriptions/20ff7fc3-e762-44dd-bd96-b71116dcdc23/resourceGroups/MyGroup/providers/Microsoft.Security/IoTSecuritySolutions/Locations/eastus/default/IoT_Bruteforce_Fail/2019-02-02\n        properties:\n          actionTaken: Detected\n          aggregatedDateUtc: 2019-02-02\n          alertDisplayName: Failed Bruteforce\n          alertType: IoT_Bruteforce_Fail\n          count: 50\n          description: Multiple unsuccsseful login attempts identified. A Bruteforce attack\n            on the device failed.\n          effectedResourceType: IoT Device\n          logAnalyticsQuery: SecurityAlert | where tolower(ResourceId) ==\n            tolower('/subscriptions/b77ec8a9-04ed-48d2-a87a-e5887b978ba6/resourceGroups/IoT-Solution-DemoEnv/providers/Microsoft.Devices/IotHubs/rtogm-hub')\n            and tolower(AlertName) == tolower('Custom Alert - number of device\n            to cloud messages in MQTT protocol is not in the allowed range') |\n            extend DeviceId=parse_json(ExtendedProperties)['DeviceId'] | project\n            DeviceId, TimeGenerated, DisplayName, AlertSeverity, Description,\n            RemediationSteps, ExtendedProperties\n          remediationSteps: \"\"\n          reportedSeverity: Low\n          systemSource: Devices\n          vendorName: Microsoft\n        type: Microsoft.Security/IoTSecurityAggregatedAlert\n    Get_the_list_of_aggregated_security_analytics_recommendations_of_yours_IoT_Security_solution:\n      value:\n        value:\n          - id: /subscriptions/075423e9-7d33-4166-8bdf-3920b04e3735/resourceGroups/IoTEdgeResources/providers/Microsoft.Security/IoTSecuritySolutions/Locations/eastus/default/OpenPortsOnDevice\n            name: /subscriptions/075423e9-7d33-4166-8bdf-3920b04e3735/resourceGroups/IoTEdgeResources/providers/Microsoft.Security/IoTSecuritySolutions/Locations/eastus/default/OpenPortsOnDevice\n            properties:\n              description: An allowed firewall policy was found in main firewall Chains\n                (INPUT/OUTPUT). The policy should Deny all traffic by default\n                define rules to allow necessary communication to/from the device\n              detectedBy: Microsoft\n              healthyDevices: 10000\n              logAnalyticsQuery: SecurityRecommendation | where tolower(AssessedResourceId) ==\n                tolower('/subscriptions/075423e9-7d33-4166-8bdf-3920b04e3735/resourceGroups/IoTEdgeResources/providers/Microsoft.Devices/IotHubs/t-ofdadu-hub')\n                and tolower(RecommendationName) == tolower('OpenPortsOnDevice')\n              recommendationDisplayName: Permissive firewall policy in one of the chains was found\n              recommendationName: OpenPortsOnDevice\n              recommendationTypeId: \"{20ff7fc3-e762-44dd-bd96-b71116dcdc23}\"\n              remediationSteps: \"\"\n              reportedSeverity: Low\n              unhealthyDeviceCount: 200\n            type: Microsoft.Security/IoTSecurityAggregatedRecommendation\n          - id: /subscriptions/075423e9-7d33-4166-8bdf-3920b04e3735/resourceGroups/IoTEdgeResources/providers/Microsoft.Security/IoTSecuritySolutions/Locations/eastus/default/TooLargeIPRange\n            name: /subscriptions/075423e9-7d33-4166-8bdf-3920b04e3735/resourceGroups/IoTEdgeResources/providers/Microsoft.Security/IoTSecuritySolutions/Locations/eastus/default/IoT_InstallAgent\n            properties:\n              description: An allow IP filter rule source IP range is too large. Overly\n                permissive rules can expose your IoT hub to malicious actors.\n              detectedBy: Microsoft\n              healthyDevices: 130000\n              logAnalyticsQuery: SecurityRecommendation | where tolower(AssessedResourceId) ==\n                tolower('/subscriptions/075423e9-7d33-4166-8bdf-3920b04e3735/resourceGroups/IoTEdgeResources/providers/Microsoft.Devices/IotHubs/t-ofdadu-hub')\n                and tolower(RecommendationName) == tolower('TooLargeIPRange')\n              recommendationDisplayName: Permissive firewall policy in one of the chains was found\n              recommendationName: TooLargeIPRange\n              recommendationTypeId: \"{20ff7fc3-e762-44dd-bd96-b71116dcdc23}\"\n              remediationSteps: \"\"\n              reportedSeverity: High\n              unhealthyDeviceCount: 1\n            type: Microsoft.Security/IoTSecurityAggregatedRecommendation\n    Get_the_aggregated_security_analytics_recommendation_of_yours_IoT_Security_solution:\n      value:\n        id: /subscriptions/075423e9-7d33-4166-8bdf-3920b04e3735/resourceGroups/IoTEdgeResources/providers/Microsoft.Security/IoTSecuritySolutions/Locations/eastus/default/OpenPortsOnDevice\n        name: /subscriptions/075423e9-7d33-4166-8bdf-3920b04e3735/resourceGroups/IoTEdgeResources/providers/Microsoft.Security/IoTSecuritySolutions/Locations/eastus/default/OpenPortsOnDevice\n        properties:\n          description: An allowed firewall policy was found in main firewall Chains\n            (INPUT/OUTPUT). The policy should Deny all traffic by default define\n            rules to allow necessary communication to/from the device\n          detectedBy: Microsoft\n          healthyDevices: 10000\n          logAnalyticsQuery: SecurityRecommendation | where tolower(AssessedResourceId) ==\n            tolower('/subscriptions/075423e9-7d33-4166-8bdf-3920b04e3735/resourceGroups/IoTEdgeResources/providers/Microsoft.Devices/IotHubs/t-ofdadu-hub')\n            and tolower(RecommendationName) == tolower('OpenPortsOnDevice')\n          recommendationDisplayName: Permissive firewall policy in one of the chains was found\n          recommendationName: OpenPortsOnDevice\n          recommendationTypeId: \"{20ff7fc3-e762-44dd-bd96-b71116dcdc23}\"\n          remediationSteps: \"\"\n          reportedSeverity: Low\n          unhealthyDeviceCount: 200\n        type: Microsoft.Security/IoTSecurityAggregatedRecommendation\n  parameters:\n    AggregatedAlertName:\n      description: Identifier of the aggregated alert.\n      in: path\n      name: aggregatedAlertName\n      required: true\n      x-ms-parameter-location: method\n      schema:\n        type: string\n      examples:\n        Get the aggregated security analytics alert of yours IoT Security solution. This aggregation is performed by alert name:\n          value: IoT_Bruteforce_Fail/2019-02-02\n        Dismiss an aggregated IoT Security Solution Alert:\n          value: IoT_Bruteforce_Fail/2019-02-02/dismiss\n    AggregatedRecommendationName:\n      description: Name of the recommendation aggregated for this query.\n      in: path\n      name: aggregatedRecommendationName\n      required: true\n      x-ms-parameter-location: method\n      schema:\n        type: string\n      examples:\n        Get the aggregated security analytics recommendation of yours IoT Security solution:\n          value: OpenPortsOnDevice\n    SolutionName:\n      description: The name of the IoT Security solution.\n      in: path\n      name: solutionName\n      required: true\n      x-ms-parameter-location: method\n      schema:\n        type: string\n      examples:\n        Get Security Solution Analytics:\n          value: default\n        Get the aggregated alert list of yours IoT Security solution:\n          value: default\n        Get the aggregated security analytics alert of yours IoT Security solution. This aggregation is performed by alert name:\n          value: default\n        Dismiss an aggregated IoT Security Solution Alert:\n          value: default\n        Get the list of aggregated security analytics recommendations of yours IoT Security solution:\n          value: default\n        Get the aggregated security analytics recommendation of yours IoT Security solution:\n          value: default\n  securitySchemes:\n    azure_auth:\n      description: Azure Active Directory OAuth2 Flow\n      type: oauth2\n      flows:\n        implicit:\n          authorizationUrl: https://login.microsoftonline.com/common/oauth2/authorize\n          scopes:\n            user_impersonation: impersonate your user account\n  schemas:\n    IoTSecurityAggregatedAlert:\n      allOf:\n        - description: Describes an Azure resource.\n          properties:\n            id:\n              description: Resource Id\n              readOnly: true\n              type: string\n            name:\n              description: Resource name\n              readOnly: true\n              type: string\n            type:\n              description: Resource type\n              readOnly: true\n              type: string\n          type: object\n          x-ms-azure-resource: true\n        - $ref: \"#/components/schemas/TagsResource\"\n      description: Security Solution Aggregated Alert information\n      properties:\n        properties:\n          $ref: \"#/components/schemas/IoTSecurityAggregatedAlertProperties\"\n      type: object\n    IoTSecurityAggregatedAlertList:\n      description: List of IoT Security solution aggregated alert data.\n      properties:\n        nextLink:\n          description: When there is too much alert data for one page, use this URI to\n            fetch the next page.\n          readOnly: true\n          type: string\n        value:\n          description: List of aggregated alerts data.\n          items:\n            $ref: \"#/components/schemas/IoTSecurityAggregatedAlert\"\n          type: array\n      required:\n        - value\n    IoTSecurityAggregatedAlertProperties:\n      description: IoT Security solution aggregated alert details.\n      properties:\n        actionTaken:\n          description: IoT Security solution alert response.\n          readOnly: true\n          type: string\n        aggregatedDateUtc:\n          description: Date of detection.\n          format: date\n          readOnly: true\n          type: string\n        alertDisplayName:\n          description: Display name of the alert type.\n          readOnly: true\n          type: string\n        alertType:\n          description: Name of the alert type.\n          readOnly: true\n          type: string\n        count:\n          description: Number of alerts occurrences within the aggregated time window.\n          readOnly: true\n          type: integer\n        description:\n          description: Description of the suspected vulnerability and meaning.\n          readOnly: true\n          type: string\n        effectedResourceType:\n          description: Azure resource ID of the resource that received the alerts.\n          readOnly: true\n          type: string\n        logAnalyticsQuery:\n          description: Log analytics query for getting the list of affected devices/alerts.\n          readOnly: true\n          type: string\n        remediationSteps:\n          description: Recommended steps for remediation.\n          readOnly: true\n          type: string\n        reportedSeverity:\n          description: Assessed alert severity.\n          enum:\n            - Informational\n            - Low\n            - Medium\n            - High\n          readOnly: true\n          type: string\n          x-ms-enum:\n            modelAsString: true\n            name: reportedSeverity\n            values:\n              - value: Informational\n              - value: Low\n              - value: Medium\n              - value: High\n        systemSource:\n          description: The type of the alerted resource (Azure, Non-Azure).\n          readOnly: true\n          type: string\n        vendorName:\n          description: Name of the organization that raised the alert.\n          readOnly: true\n          type: string\n      type: object\n    IoTSecurityAggregatedRecommendation:\n      allOf:\n        - description: Describes an Azure resource.\n          properties:\n            id:\n              description: Resource Id\n              readOnly: true\n              type: string\n            name:\n              description: Resource name\n              readOnly: true\n              type: string\n            type:\n              description: Resource type\n              readOnly: true\n              type: string\n          type: object\n          x-ms-azure-resource: true\n        - $ref: \"#/components/schemas/TagsResource\"\n      description: IoT Security solution recommendation information.\n      properties:\n        properties:\n          $ref: \"#/components/schemas/IoTSecurityAggregatedRecommendationProperties\"\n      type: object\n    IoTSecurityAggregatedRecommendationList:\n      description: List of IoT Security solution aggregated recommendations.\n      properties:\n        nextLink:\n          description: When there is too much alert data for one page, use this URI to\n            fetch the next page.\n          readOnly: true\n          type: string\n        value:\n          description: List of aggregated recommendations data.\n          items:\n            $ref: \"#/components/schemas/IoTSecurityAggregatedRecommendation\"\n          type: array\n      required:\n        - value\n    IoTSecurityAggregatedRecommendationProperties:\n      description: IoT Security solution aggregated recommendation information\n      properties:\n        description:\n          description: Description of the suspected vulnerability and meaning.\n          readOnly: true\n          type: string\n        detectedBy:\n          description: Name of the organization that made the recommendation.\n          readOnly: true\n          type: string\n        healthyDevices:\n          description: Number of healthy devices within the IoT Security solution.\n          readOnly: true\n          type: integer\n        logAnalyticsQuery:\n          description: Log analytics query for getting the list of affected devices/alerts.\n          readOnly: true\n          type: string\n        recommendationDisplayName:\n          description: Display name of the recommendation type.\n          readOnly: true\n          type: string\n        recommendationName:\n          description: Name of the recommendation.\n          type: string\n        recommendationTypeId:\n          description: Recommendation-type GUID.\n          readOnly: true\n          type: string\n        remediationSteps:\n          description: Recommended steps for remediation\n          readOnly: true\n          type: string\n        reportedSeverity:\n          description: Assessed recommendation severity.\n          enum:\n            - Informational\n            - Low\n            - Medium\n            - High\n          readOnly: true\n          type: string\n          x-ms-enum:\n            modelAsString: true\n            name: reportedSeverity\n            values:\n              - value: Informational\n              - value: Low\n              - value: Medium\n              - value: High\n        unhealthyDeviceCount:\n          description: Number of unhealthy devices within the IoT Security solution.\n          readOnly: true\n          type: integer\n      type: object\n    IoTSecurityAlertedDevice:\n      description: Statistical information about the number of alerts per device during\n        last set number of days.\n      properties:\n        alertsCount:\n          description: Number of alerts raised for this device.\n          readOnly: true\n          type: integer\n        deviceId:\n          description: Device identifier.\n          readOnly: true\n          type: string\n      type: object\n    IoTSecurityAlertedDevicesList:\n      description: List of devices with open alerts including the count of alerts per\n        device.\n      items:\n        $ref: \"#/components/schemas/IoTSecurityAlertedDevice\"\n      type: array\n    IoTSecurityDeviceAlert:\n      description: Statistical information about the number of alerts per alert type during\n        last set number of days\n      properties:\n        alertDisplayName:\n          description: Display name of the alert\n          readOnly: true\n          type: string\n        alertsCount:\n          description: Number of alerts raised for this alert type.\n          readOnly: true\n          type: integer\n        reportedSeverity:\n          description: Assessed Alert severity.\n          enum:\n            - Informational\n            - Low\n            - Medium\n            - High\n          readOnly: true\n          type: string\n          x-ms-enum:\n            modelAsString: true\n            name: reportedSeverity\n            values:\n              - value: Informational\n              - value: Low\n              - value: Medium\n              - value: High\n      type: object\n    IoTSecurityDeviceAlertsList:\n      description: List of alerts with the count of raised alerts\n      items:\n        $ref: \"#/components/schemas/IoTSecurityDeviceAlert\"\n      type: array\n    IoTSecurityDeviceRecommendation:\n      description: Statistical information about the number of recommendations per device,\n        per recommendation type.\n      properties:\n        devicesCount:\n          description: Number of devices with this recommendation.\n          readOnly: true\n          type: integer\n        recommendationDisplayName:\n          description: Display name of the recommendation.\n          readOnly: true\n          type: string\n        reportedSeverity:\n          description: Assessed recommendation severity.\n          enum:\n            - Informational\n            - Low\n            - Medium\n            - High\n          readOnly: true\n          type: string\n          x-ms-enum:\n            modelAsString: true\n            name: reportedSeverity\n            values:\n              - value: Informational\n              - value: Low\n              - value: Medium\n              - value: High\n      type: object\n    IoTSecurityDeviceRecommendationsList:\n      description: List of aggregated recommendation data, per recommendation type, per\n        device.\n      items:\n        $ref: \"#/components/schemas/IoTSecurityDeviceRecommendation\"\n      type: array\n    IoTSecuritySolutionAnalyticsModel:\n      allOf:\n        - description: Describes an Azure resource.\n          properties:\n            id:\n              description: Resource Id\n              readOnly: true\n              type: string\n            name:\n              description: Resource name\n              readOnly: true\n              type: string\n            type:\n              description: Resource type\n              readOnly: true\n              type: string\n          type: object\n          x-ms-azure-resource: true\n      description: Security analytics of your IoT Security solution\n      properties:\n        properties:\n          $ref: \"#/components/schemas/IoTSecuritySolutionAnalyticsModelProperties\"\n      type: object\n    IoTSecuritySolutionAnalyticsModelList:\n      description: List of Security analytics of your IoT Security solution\n      properties:\n        nextLink:\n          description: When there is too much alert data for one page, use this URI to\n            fetch the next page.\n          readOnly: true\n          type: string\n        value:\n          description: List of Security analytics of your IoT Security solution\n          items:\n            $ref: \"#/components/schemas/IoTSecuritySolutionAnalyticsModel\"\n          type: array\n      required:\n        - value\n    IoTSecuritySolutionAnalyticsModelProperties:\n      description: Security analytics properties of your IoT Security solution\n      properties:\n        devicesMetrics:\n          description: List of device metrics by the aggregation date.\n          items:\n            properties:\n              date:\n                description: Aggregation of IoT Security solution device alert metrics by\n                  date.\n                format: date-time\n                type: string\n              devicesMetrics:\n                $ref: \"#/components/schemas/IoTSeverityMetrics\"\n          readOnly: true\n          type: array\n        metrics:\n          $ref: \"#/components/schemas/IoTSeverityMetrics\"\n        mostPrevalentDeviceAlerts:\n          $ref: \"#/components/schemas/IoTSecurityDeviceAlertsList\"\n        mostPrevalentDeviceRecommendations:\n          $ref: \"#/components/schemas/IoTSecurityDeviceRecommendationsList\"\n        topAlertedDevices:\n          $ref: \"#/components/schemas/IoTSecurityAlertedDevicesList\"\n        unhealthyDeviceCount:\n          description: Number of unhealthy devices within your IoT Security solution.\n          readOnly: true\n          type: integer\n    IoTSeverityMetrics:\n      description: IoT Security solution analytics severity metrics.\n      properties:\n        high:\n          description: Count of high severity alerts/recommendations.\n          type: integer\n        low:\n          description: Count of low severity alerts/recommendations.\n          type: integer\n        medium:\n          description: Count of medium severity alerts/recommendations.\n          type: integer\n      type: object\n    TagsResource:\n      description: A container holding only the Tags for a resource, allowing the user to\n        update the tags.\n      properties:\n        tags:\n          additionalProperties:\n            type: string\n          description: Resource tags\n          type: object\n",
			"canonicalURL": "/github.com/restful-ma/thresholds@5b0b2a3322d3b2b7c0e0f2c0c0ad0e524e67bf82/-/blob/benchmark-repository/openapi/azure.com-security-iotSecuritySolutionAnalytics-2019-08-01-swagger.yaml",
			"externalURLs": [
				{
					"url": "https://github.com/restful-ma/thresholds/blob/5b0b2a3322d3b2b7c0e0f2c0c0ad0e524e67bf82/benchmark-repository/openapi/azure.com-security-iotSecuritySolutionAnalytics-2019-08-01-swagger.yaml",
					"serviceKind": "GITHUB"
				}
			]
		}
	},
	"Error": "buildIR: make ir: path \"/subscriptions/{subscriptionId}/resourceGroups/{resourceGroupName}/providers/Microsoft.Security/iotSecuritySolutions/{solutionName}/analyticsModels/default\": get: responses: 200: contents: application/json: generate schema: allOf: allOf \"#/components/schemas/IoTSecuritySolutionAnalyticsModel\" [0]: reference \"#/components/schemas/IoTSecuritySolutionAnalyticsModel\" [0] leads to infinite recursion",
	"NotImplemented": [
		"oauth2 security"
	]
}